{
  "entries": {
    "START": {
      "text": [
        "THE DEATH KNIGHT’S SQUIRE: A DM-LESS ADVENTURE!",
        "",
        "BACKSTORY",
        "Arrival in Orlbar",
        "",
        "It is the year 1349 DR, in the month of Deepwinter. You have been on the road for nearly two months now, and snow hangs thick on the trees as you make your way towards the town of Orlbar, at the foot of the Greypeak Mountains. The Greypeaks are known throughout Faerun for their silver and iron mines, but it is a different type of metal that brought you here: gold. While you were in Neverwinter you overheard rumours of a large horde of treasure within an abandoned goblin keep. Even tavern rumours prove to be fruitful sometimes, and having been without a purpose for some months, you departed immediately for the Grey Vale.",
        "When you reach Orlbar, the air is brisk and town is busy. Carts carry all manner of goods: timber, wool bales, grain, and animals from the surrounding country. Some of these goods would be bound for Waterdeep or Neverwinter, others for the nearby city of Loudwater.",
        "Hungry and thirsty after many days on the road, you enter the first tavern you see, *The Woodsman’s Retreat*, and satisfy your cravings. Bread, cheese and a hot mulled wine do the trick nicely. You then enquire from the barkeep about accomodation. Your bones ache and rest is essential. The mountains can wait one or two days while you rest and replenish your supplies in town. The barkeep tells you that a very respectable inn, the Silver Flask, is just nearby.",
        "Toting your backpack, you walk down the street to the Silver Flask and pay for a room. The inkeep is a jolly woman who is glad to have your business, and she lights a cosy fire in your room. You bathe, then lie down to rest and soon fall into a deep sleep; it’s been a while since your travel-hardened self has had clean sheets and a roof overhead!",
        "You are woken later that night by noise from the next room. You can hear a woman openly sobbing on the other side of the wall. The sound is gut-wrenching. Every now and then a male voice says something, as if trying to comfort her. You tolerate this for a while, but eventually it becomes evident that sleep is going to be impossible, and you walk out into the hallway and knock on the door to the room next to yours.",
        "An elderly man answers. He is dressed finely, like a member of the aristocracy, but sports a nasty black eye and a gash across his cheek. In the background a woman, also richly dressed, sits on a chair by the fire, her face buried in her hands.",
        "“Yes? What is it?” the elderly gentleman asks directly.",
        "You straighten yourself up, peering into the room.",
        "“I was wondering what all the noise was about,” you say, although now you don’t feel quite so annoyed. “I could hear the crying from next door. I was wondering,” you say gruffly, not used to dealing with aristocrats, “If it’s anything I can help you with? Perhaps then we can all get some rest?”",
        "At this the woman looks up and sees you. You probably look a fright, after all those weeks on the road – ungroomed, hair dishevelled, travel-worn clothes - but you’ve had a bath so you at least you don’t smell bad. However, your type has an… air about them. You’ve seen a fight or two and know how to handle yourself in most situations. You’re what’s known in these parts as ‘the adventuring type.’ Such types generally know how to get things done, things that others might shy away from.",
        "“Show our guest in, Elric,” the woman says weakly, drying her tears with a silk handkerchief."
      ],
      "nextSteps": [
        {
          "description": "Continue...",
          "target": "BACKSTORY2"
        }
      ]
    },
    "BACKSTORY2": {
      "text": [
        "THE MYSTERIOUS KNIGHT",
        "",
        "You are shown to a chair. For some reason, this old couple, who introduce themselves as Lord and Lady Brewmont, welcome your presence, if only as a distraction from the grief they seem consumed by.",
        "“We arrived here last night,” Lady Brewmont begins. “Elric is so busy these days, so we thought we would bring ourselves out to Orlbar for a little holiday. Our son, he’s so fond of the mountains. Loves all the stories. Well, he’s our grandson really. The son of our daughter who died some years ago. He is all we have left of her. We call him our son.“ Lady Brewmont begins sobbing once more.",
        "Elric Brewmont picks up the thread. “Long story short, my friend, we were accosted on the highway. We were passing along a lonely stretch of read when he appeared, from nowhere. A knight, a towering brute of a man, all clad in armour.” Lord Elric points to his face. “Did this to me, knocked me out cold. Then he grabbed our boy, threw him on a horse and bolted! Without a word!”",
        "“Hmm,” you say, mulling over this information. “Did he seem familiar, this knight?”",
        "Elric shakes his head. “I know what you’re thinking. Wealthy aristocrat, on holiday from Loudwater, someone must have known we were coming out here, and siezed the opportunity. It’s true, I am what you would call… a public figure. It is well known, in Loudwater at least, that I am a wealthy man. But no…. this knight was something else. We didn’t see his face, it was hidden by a great metal visor. A towering warrior he was, a hulk of a man.”",
        "Lady Brewmont speaks again. “And he has kidnapped our poor little Darek! Abducted him, just ripped him out of our grasp!”"
      ],
      "nextSteps": [
        {
          "description": "Continue...",
          "target": "BACKSTORY3"
        }
      ]
    },
    "BACKSTORY3": {
      "text": [
        "INCOMPETENT FOOLS",
        "",
        "“What did you do then?” you ask.",
        "“We came straight to Orlbar,” Lady Brewmont says. “We went to the Captain of the Guard, but he, he…”",
        "“A thoroughly incompetent fool,” Lord Brewmont growls. “Said this Knight was a ghost, that he’d chosen Darek as his squire, and that there was nothing we could do about it! Said Darek wasn’t the first. Called him *The Death Knight*! You can imagine what a comfort that was to us.”",
        "“They say the Knight lives in the wood nearby,” Lady Brewmont says airily, as if in a waking dream. “Weathercote Wood, isn’t it dear?”",
        "The old man grits his teeth, staring into the fire, and punches his palm. “Ghost my arse!” he snarls through gritted teeth. “That knight looked real enough to me. He’s a lunatic, nothing more, a lunatic who kidnaps young boys! And when I find the blaggard, by the Gods will he pay!”",
        "You can’t help thinking that Lord Brewmont is a bit out of his depth here. You don’t doubt his resolve, but he looks as though his days of conquest are well behind him.",
        "You feel for this poor old couple. While not usually associating with the wealthy, you do know that you have something to offer them, and you’re never one to shy away from a good adventure… especially when the chance of a reward is on the table.",
        "",
        "“I can find your boy,” you hear yourself saying.",
        "The woman looks up, and new hope begins to shine from her eyes.",
        "“Oh Gods,” she says, her voice quavering.",
        "“We’ll give you anything, *anything*…”",
        "The old man is a little more practical. “If I was a few decades younger, I’d be out there myself. I saw action in the Battle of Tanglefork, when we freed the Vale from Rensha rule.”",
        "You nod appreciatively – that battle happened about 30 years ago, and was said to be fierce. You are not surprised – Elric Brewmont definitely carries himself like an old veteran.",
        "“I can’t put my sword forward any more, but I can offer you gold, my friend… 2000 pieces of it, to be exact…”"
      ],
      "nextSteps": [
        {
          "description": "Go to the first entry, ADVENTUREBEGINS",
          "target": "ADVENTUREBEGINS"
        }
      ]
    },
    "ADVENTUREBEGINS": {
      "text": [
        "THE ADVENTURE BEGINS…",
        "",
        "At dawn the next day, following the few scraps of information you have, you saddle your horse and ride to the outskirts of town. The townsfolk pay you little mind as you go, casting you the occasional glance.",
        "The journey to Weathercote Wood lies due east, but is no short ride. The Captain of the Guard tells you that the Death Knight has always been seen in a small patch of wood that juts out from the western side of Weathercote, “like a wart on a giant’s nose.”",
        "By midday you reach a sign which tells you you have another 15 miles to go. You should make it there by nightfall.",
        "Not far past the sign is a small inn and tavern. An old man sits on a chair in the afternoon sun, and raises a tankard of ale as you pass.",
        "“Last drink for many miles!” the old man calls to you. “Come, sit! I’ll buy you an ale!”"
      ],
      "imageId": 1,
      "nextSteps": [
        {
          "description": "Do you accept the old man’s invitation? If so, go to entry BREWSKI",
          "target": "BREWSKI"
        },
        {
          "description": "If you are mindful of the time and choose to ride on, go to entry KEEPGOING",
          "target": "KEEPGOING"
        }
      ]
    },
    "ALLCLEAR": {
      "text": [
        "You search around the door but find nothing trap-like. (continue across…)"
      ],
      "nextSteps": [
        {
          "description": "To try and open the door, go to entry OPENSTONEDOOR",
          "target": "OPENSTONEDOOR"
        },
        {
          "description": "To leave and continue north, go back to Tilepage 3 and continue from the last line you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "AMBUSH": {
      "text": [
        "Suddenly something gives way under your feet. You fall about 10 ft, landing heavily in a deep pit. It winds you, and you get to your feet shakily, cursing your carelessness.",
        "*Take 1d6 fall damage*",
        "Looking around, you decide that you had better get out of this pit trap as quickly as possible, before whoever dug it returns!"
      ],
      "nextSteps": [
        {
          "description": "Do you have rope? If so, go to entry ROPEESCAPE",
          "target": "ROPEESCAPE"
        },
        {
          "description": "Do you know the spell Jump? If so, go to JUMPESCAPE",
          "target": "JUMPESCAPE"
        },
        {
          "description": "Are you a variant tiefling (Sword Coast Adventurer’s Guide) or do you have some other way of flying? Go to entry FLYESCAPE",
          "target": "FLYESCAPE"
        },
        {
          "description": "Otherwise you could try carving steps into the dirt walls with your weapon. Go to entry DIGESCAPE",
          "target": "DIGESCAPE"
        }
      ]
    },
    "APOLOGIZE": {
      "text": [
        "The strange man waves a hand dismissively.",
        "“Your apologies mean little to me. Be on your way.”",
        "*Do you want to respond or not?*"
      ],
      "nextSteps": [
        {
          "description": "“You are very rude, my friend. No wonder you’re out here all alone talking to fairies.” Go to CHASTISE",
          "target": "CHASTISE"
        },
        {
          "description": "Shaking your head confusedly, you turn and depart, leaving this demented soul to his own devices. Return to tilepage 9 and continue from the last direction you read",
          "target": "TILEPAGE_9"
        }
      ]
    },
    "ASYOUWERE": {
      "text": [
        "You keep watching, peering into the forest, but don’t see any other movement.",
        "Shrugging, you turn your attention back to the path and the quest at hand."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "AWAKE": {
      "text": [
        "You wake up in the cabin, and find that you are once more able to move! It is totally dark inside the cabin… probably night time. You look around, but the cultists are gone."
      ],
      "nextSteps": [
        {
          "description": "Go to entry INDUCTED",
          "target": "INDUCTED"
        }
      ]
    },
    "BACKTOJUNCTION": {
      "text": [
        "As you are heading south back towards the four-way junction, you hear a crack of thunder overhead, followed by a hollow, ragged laugh, coming from the direction of the cemetery. A sense of urgency overcomes you… you sense, in the pit of your stomach, that time is running out for Darek Brewmont."
      ],
      "nextSteps": [
        {
          "description": "To ignore your instincts and head south anyway, go to IGNOREINSTINCTS",
          "target": "IGNOREINSTINCTS"
        },
        {
          "description": "To return to the cemetery, go to tilepage 10 and follow the directions there (ignoring anything you have already encountered or investigated)",
          "target": "TILEPAGE_10"
        }
      ]
    },
    "BADLIAR": {
      "text": [
        "The thief shakes his head, pouting angrily at you.",
        "“I don’t believe this story,” he says firmly.",
        "“You are lying to me. For that, I have a mind to cast you out and keep everything you carry…. hmmm.”",
        "He eyes you up and down, considering.",
        "“Instead,” he says finally, “I will take one thing of value from you. What do you carry? I don’t want your weapon but… something else. Show me what you carry. And don’t bother telling me the real story now. I don’t want to hear it. You had a chance to tell the truth, and you chose to lie instead. I want something from you, in return for letting you go. For daring to enter our lair and rifle through our possessions!”",
        "The female stands nearby, caressing the flat of her blade and eyeing you darkly. The boy stands motionless, watching you with head tilted slightly back and hands clasped before him. You are severely outnumbered here.",
        "*You must choose one item worth at least 20gp from your inventory (gold or gems will also do) and give it to this hardened rogue. Only then will you be allowed to go free. As soon as you have done this, you are quite literally shown the door.*"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "BALLSYMOVE": {
      "text": [
        "There is a long, awkward silence, and you fear the worst. Then the Blood Knight throws his head back and laughs uproariously, the sound filling the room and nearly deafening you. You wince, covering your ears. Finally he stops, and addresses you, leveling his greatsword under your chin.",
        "Suddenly you feel paralyzed, as if by a spell.",
        "“You are very brave, traveller. You will make a perfect general for the Goddess. Now BOW, or DIE LIKE A DOG!”"
      ],
      "nextSteps": [
        {
          "description": "Do you bow to the Blood Knight’s will? If so, go to DARKQUEST",
          "target": "DARKQUEST"
        },
        {
          "description": "If you still resist, go to entry RESIST",
          "target": "RESIST"
        }
      ]
    },
    "BATEDBREATH": {
      "text": [
        "You give it a reasonable look over, but decide that the entrance is not booby-trapped.",
        "Gingerly, you ease the gates open. The metal seems to be relatively rust-free and does not creak as you expected it would. Easing yourself within the gates, you grasp the handle of the left stone door and lean back. It swings smoothly out."
      ],
      "nextSteps": [
        {
          "description": "Do you know the spell Detect Evil and Good? You can cast this by going to entry DETECTEVIL",
          "target": "DETECTEVIL"
        },
        {
          "description": "Alternately, you can simply proceed inside. Go to entry CROSSTHRESHOLD",
          "target": "CROSSTHRESHOLD"
        }
      ]
    },
    "BEARINGS": {
      "text": [
        "Your primal instinct, your danger sense, is clamouring, warning you that danger is close at hand. You don't know the nature of that danger, but experience tells you that it's likely a strong enemy is nearby.",
        "It is as if the air itself has been sucked out of this place. The crypt sits silent and pale as bone on the far side, shaded by the trees which border this graveyard.",
        "Suddenly you fancy you hear the neigh of a horse, as if heard from far away, almost like an echo..",
        "*Your barbarian danger sense means that you have advantage on any dexterity saving throws you make while in this graveyard.*"
      ],
      "nextSteps": [
        {
          "description": "To move through the rows of gravestones towards the crypt, despite your instincts, go to entry SOFTLY",
          "target": "SOFTLY"
        },
        {
          "description": "To leave this place, go to LEAVECEMETERY",
          "target": "LEAVECEMETERY"
        }
      ]
    },
    "BENDINGPASSAGE": {
      "text": [
        "As quietly as you can, you sidle around the corner… a diagonal passage continues ahead and opens into a room, which appears to be illuminated.",
        "You hear the voice again, little more than a growl shaped into words: “Look at me, cur! Look at me!”",
        "You take advantage of these words to make a few more steps, and then you have a view into the room. What you see stops your heart.",
        "Seated on a large throne atop a dais is a gruesome-looking warrior. Even sitting down he appears tall; you reckon his height to be at least seven feet, probably taller. He is armoured from head to toe, although his face and parts of his midriff are exposed. The armour is patched and rusted. In his hand he holds a huge sword, and he is glaring at the bound figure grovelling before him. This figure has their back to you, but you notice the clothes of a noble. From his size, you judge this to be a teenage boy; likely Darek Brewmont. Which can only mean one thing: the big ugly guy on the throne is the Death Knight! And it looks as though you have arrived just in time – this appears to be a Squiring ceremony!",
        "You feel a malevolent energy pulsing from the warrior. Watching, your mind races as you carefully consider your next move.",
        "Oddly, to his right is a brazier which iemanates an unearthly blue light, casting an eerie pall over the huge warrior.",
        "*Place a token to represent the Death Knight on the throne, and one representing you near the door. Don’t worry about a token for Darek just yet.*",
        "*Did you succeed on that earlier stealth check?*"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry SNEAKUP",
          "target": "SNEAKUP"
        },
        {
          "description": "If not, go to entry WELCOME",
          "target": "WELCOME"
        }
      ]
    },
    "BENDTRAPS": {
      "text": [
        "As you enter the passage, you check thoroughly for traps ahead.",
        "*Make a perception roll, DC 14. If you have a hand-drawn map that you picked up in your travels, you may make this roll with advantage.*"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry PASSAGETRAPS",
          "target": "PASSAGETRAPS"
        },
        {
          "description": "If you are unsuccessful, go to entry ITLLBEFINE",
          "target": "ITLLBEFINE"
        },
        {
          "description": "If you prefer not to try, go to entry DOGLEG",
          "target": "DOGLEG"
        }
      ]
    },
    "BENDYBIT": {
      "text": [
        "*Roll perception, DC 10.*"
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to WHATTRAPS",
          "target": "WHATTRAPS"
        },
        {
          "description": "If you fail, go to TRAPSWHAT",
          "target": "TRAPSWHAT"
        }
      ]
    },
    "BETTER": {
      "text": [
        "Searching around the nooks and crannies, you find a few trinkets, items of worship and other things, mostly worthless.",
        "Then you come across a pile of books, stacked against the wall. Rummaging quickly through them, you find a scroll, a little bit flattened, but then, unrolling it you see eldritch runes meticulously written in red ink. At the bottom, in small writing, you see the following words printed in a neat hand: *A Scroll of Curing Wounds, gifted by the gracious cleric Kagnar the Indefatigable. All glory to Amaunator!*",
        "What a find! You stow the scroll in your backpack, feeling much better about how things are turning out! This is bound to come in handy.",
        "*(Add a Spell scroll, Cure wounds, 1st Level, to your inventory. This scroll, when used, will restore 1d8+2 hp to the user)*."
      ],
      "nextSteps": [
        {
          "description": "To investigate the image of Amaunator, go to entry INSPECTALTAR",
          "target": "INSPECTALTAR"
        },
        {
          "description": "If you have already inspected the altar, you become mindful that time is pressing, and you leave this underground chamber. Go to entry LEAVECHAMBER",
          "target": "LEAVECHAMBER"
        }
      ]
    },
    "BETTERSAFE": {
      "text": [
        "You hold your breath, waiting till the kobold patrol has passed, and then re-emerge on the path, and look north. What else lurks in this forest? Taking a breath, you continue on."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "BEYONDRIVER": {
      "text": [
        "You give the walls and floor a pretty good search, but find no traps.",
        "You continue down the tunnel."
      ],
      "nextSteps": [
        {
          "description": "Go to entry MOVEWITHIN",
          "target": "MOVEWITHIN"
        }
      ]
    },
    "BITEME": {
      "text": [
        "You move your hand away just in time, avoiding the bite of whatever it was that attacked you. And then you see what it was: a GIANT CENTIPEDE emerges from the shadows, skittering towards you on a multitude of legs!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry CENTIBATTLE",
          "target": "CENTIBATTLE"
        }
      ]
    },
    "BLADEBOY": {
      "text": [
        "Darek has managed to cut himself free and has gotten to his feet. He is shaky, but there is a light in his eyes. You remember Lord Brewmont, and how honourable he seemed… 14 perhaps there is a little bit of the warrior in this boy too!",
        "*Roll initiative for Darek (straight d20) and have him enter the fray with whatever weapon he is holding. Stats for Darek are below. Place his token at the wall of the chamber.*",
        "| |\n|-|\n| ****DAREK BREWMONT**** |\n| *Medium Humanoid, Lawful Good* |",
        "| |\n|-|\n| **Armour Class** 10 |\n| **Hit Points** 4 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 10 (0) | 10 (0) | 10 (0) | 10 (0) | 10 (0) | 10 (0) |",
        "| |\n|-|\n| **Senses** Passive Perception 10 |\n| **Proficiency Bonus** +2 |\n| **Languages** Common |",
        "| |\n|-|\n| **ATTACKS** |\n| Use the stats for whichever blade you have supplied him with, no modifiers. Straight d20 to attack. |",
        "*The Death Knight will not attack Darek until you are dead, so stay alive!*"
      ],
      "nextSteps": [
        {
          "description": "Go to entry YOURATTACK",
          "target": "YOURATTACK"
        }
      ]
    },
    "BLADEDODGE": {
      "text": [
        "Scything blades come swinging out of the walls towards you, but you manage to jump out of the way just in time. You feel the air from the razor - sharp edge as they swing, back and forward, like dual pendulums. Heart pounding, you stand and proceed towards the circular room which is now visible ahead."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CIRCULARROOM",
          "target": "CIRCULARROOM"
        }
      ]
    },
    "BLADEPOINT": {
      "text": [
        "You are ushered at bladepoint back into the abandoned mine, then kicked in the back of the leg and forced to the ground. This is when you get your first good look at the bladewielder: an older man, he appears to be the leader. He carries a needle-thin rapier in one hand and a dagger, backhanded, in the other. You know this fighting style. These are rogues. Thieves. And, obviously, the residents of this den.",
        "The woman stands behind you, with weapon drawn. Sighing resignedly, as if this thing happens often, the older man finds a chair and plonks down in it. Suddenly the boy reappears and informs the leader of what you had been up to in their treasure room. You are searched, and any items you took are retrieved. Then you are bound hand and foot, and given a boot in the stomach for good measure.",
        "“So,” the man says finally. “Give me a good reason why we shouldn’t kill you, intruder? What’s your story? What are you doing in Weathercote Wood, and more specifically, what are you doing in our lair? Who are you?” he demands."
      ],
      "nextSteps": [
        {
          "description": "Do you tell this thief of your quest? Go to DISCLOSURE",
          "target": "DISCLOSURE"
        },
        {
          "description": "Or will you make something up? Go to SPINYARN",
          "target": "SPINYARN"
        }
      ]
    },
    "BLESSING": {
      "text": [
        "The little fairy flutters towards you across the stream and lands on your shoulder.",
        "“What blessing would you like me to bestow?” Plumeria asks you. “Expertise or endurance?”"
      ],
      "nextSteps": [
        {
          "description": "If you choose expertise, go to EXPERTISE",
          "target": "EXPERTISE"
        },
        {
          "description": "If you choose endurance, go to ROBUSTNESS",
          "target": "ROBUSTNESS"
        }
      ]
    },
    "BLOODKNIGHTSCURSE": {
      "text": [
        "Despite your victory, the words of the Blood Knight are still fresh in your mind. Turning north at the junction that led you to the cemetery, you continue for a short way, after which this part of Weathercote Wood finally ends, and the landscape changes to wide, open grassland, bordered on the east by the main part of the wood which stretches north.",
        "The sky is overcast, threatening rain, and pulling poor Darek behind you, you proceed at a run to a nearby farmhouse where you steal a horse. The farmer comes out of his house as you gallop away, shouting and waving his fist at your back.",
        "You reach Orlbar that evening, and deliver Darek to his grateful grandparents.",
        "“You shall be rewarded, brave champion,” Lord Brewmont promises, his eyes misting over. “On the morrow, I shall go to the Orlbar bank, and –“ You cut Lord Brewmont off, informing him that there is no time. You want to be out of this town as soon as possible. Now the Blood Knight has physical form, he will pursue you to the ends of the realm, and possibly beyond, with his army of cultists. You certainly don’t want those fanatics following you to the village of Orlbar. That will put all these poor folk in danger.",
        "Lord Brewmont is sad that he is not able to reward you properly. But then Lady Brewmont comes forth, clasping your hands gratefully.",
        "“Thank you,” she says, and then reaches up and unclasps her necklace, removing it from her neck and placing it in your hands. “Sell this,” she says. “And don’t take anything less than 700 gold for it!” Seeing your urgency, Lord Brewmont gifts you with a horse from his carriage team, and you mount up and ride immediately, out of Orlbar and into the deep, inky night."
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPOILSOFADVENTURE",
          "target": "SPOILSOFADVENTURE"
        }
      ]
    },
    "BREWSKI": {
      "text": [
        "You tie your horse up to the tavern’s porch and join the old man, who directs a young boy to bring you a frothing tankard of ale. The boy also brings a bowl of stew for you to eat.",
        "“What brings you out this way?” the old man asks eventually."
      ],
      "imageId": 2,
      "nextSteps": [
        {
          "description": "Do you tell him of your quest? If so, go to entry QUESTCONVO",
          "target": "QUESTCONVO"
        },
        {
          "description": "If you choose to simply replenish yourself and be on your way, go to entry REPLENISH",
          "target": "REPLENISH"
        }
      ]
    },
    "BRINGIT": {
      "text": [
        "You bravely stand your ground, and place a hand on your weapon, fixing the new arrivals with a steely gaze.",
        "You can soon make out what they are: Kobolds! They see you and shout, then move quickly forward.",
        "In their broken Common, the one who appears to be the leader addresses you.",
        "“Pay up, human! 5 gold to pass this way. All must pay the toll.”"
      ],
      "nextSteps": [
        {
          "description": "Do you pay the gold? If so, go to entry PAYTOLL",
          "target": "PAYTOLL"
        },
        {
          "description": "If not, go to entry TOLLBEDAMNED",
          "target": "TOLLBEDAMNED"
        }
      ]
    },
    "BUMPINTHENIGHT": {
      "text": [
        "*Roll a d100*"
      ],
      "nextSteps": [
        {
          "description": "If you roll 0-33 go to entry MIDNIGHTSNACK",
          "target": "MIDNIGHTSNACK"
        },
        {
          "description": "If you roll 34-66 go to entry DISTURBED",
          "target": "DISTURBED"
        },
        {
          "description": "If you roll 67-100 go to entry NIGHTNIGHT",
          "target": "NIGHTNIGHT"
        }
      ]
    },
    "BURNWEB": {
      "text": [
        "You unlease the fire on the webs, and the silky strands quickly ignite. As flame consumes the webs, you hear a horrid screeching and a clacking sound…",
        "From the side of the path where they were hidden, awaiting their prey, two GIANT WOLF SPIDERS emerge and advance quickly on you!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPIDERBATTLE",
          "target": "SPIDERBATTLE"
        }
      ]
    },
    "CABINENTRY": {
      "text": [
        "You cautiously edge inside the cabin, looking around. It appears empty, even though a crackling fire burns in the hearth. There is a strange smell in here…",
        "Suddenly you feel something press against your skull, as if a giant invisible hand were crushing it! You resist as best you can, but the force is overwhelming. Within moments, you have blacked out.",
        "You wake at what seems like many hours later. It is dark inside the room, probably night-time, and the room is empty."
      ],
      "nextSteps": [
        {
          "description": "Go to entry INDUCTED",
          "target": "INDUCTED"
        }
      ]
    },
    "CAMPNORTHWEST": {
      "text": [
        "To the northwest is a low rock outcropping beneath the trees. You unfurl your bedroll beneath it.",
        "*If you are eating provisions, do so now.*",
        "You lie down and quickly fall asleep to the gentle sound of wind whispering through the canopy."
      ],
      "nextSteps": [
        {
          "description": "Go to entry BUMPINTHENIGHT",
          "target": "BUMPINTHENIGHT"
        }
      ]
    },
    "CAPTIVE": {
      "text": [
        "The Cultist waits there, watching you for some time, as you plot the different ways you could possibly get out of this situation.",
        "Soon more of her kind arrive, burly male cultists, and five descend into the pit.",
        "Realizing you are outnumbered, you submit to being tied up and blindfolded and are soon tossed into a cart which begins trundling along the path.",
        "The female cultist kicks you occasionally, laughing each time she does so.",
        "The journey is relatively short, and you can still hear the birds and rustling of the trees, so you know you are still within the wood.",
        "You try to keep track of the twists and turns, but lying in the bottom of the cart blindfolded, you become disoriented.",
        "Then you feel your sleeve being pulled up and something being rubbed on your arm.",
        "A strong, antiseptic smell hits your nostrils and moments later you fall into a deep, unconscious state.",
        "When you wake, much later, the blindfold has been removed, and someone has loosed the bonds on your wrists and feet.",
        "It is dark in the room, and you massage your extremities as you look around.",
        "You appear to be in a cabin of some kind."
      ],
      "nextSteps": [
        {
          "description": "Go to entry INDUCTED",
          "target": "INDUCTED"
        }
      ]
    },
    "CAVECLUES": {
      "text": [
        "You have a scavenge around. There were people here at one time, lots of people. You find rings, semi-precious jewellery (to the value of 10gp, if you want to take it) and a few silver pieces here and there (17 in total).",
        "You also find, disturbingly, a child's wooden toy soldier… but nothing of any real value.",
        "*You may take a short rest here if you wish, regaining one hit die.*"
      ],
      "nextSteps": [
        {
          "description": "When you are done here, you may leave this cave. Go to entry LEAVECAVERN",
          "target": "LEAVECAVERN"
        }
      ]
    },
    "CAVESTREAM": {
      "text": [
        "You peer into the black cave entrance that gapes at you from the other side of the river. The area around the entrance is interesting – it appears to be surrounded with discarded pottery and other detritus.",
        "Perhaps there was a settlement here once. Tribal societies once roamed this area freely in prehistory. Now the cave appears abandoned, and its black mouth forbidding.",
        "The stream appears calm but a glance at its depths tells you it is moving quite swiftly. It might take a bit of effort to cross.",
        "*You may take this opportunity to refill your waterskin if need be.*"
      ],
      "nextSteps": [
        {
          "description": "Are you a paladin? If so, go to entry DEEPCURRENT",
          "target": "DEEPCURRENT"
        },
        {
          "description": "To attempt to wade across the stream, make an athletics check, DC 12. If you succeed go to entry STREAMCROSSED",
          "target": "STREAMCROSSED"
        },
        {
          "description": "If you fail, go to entry SWEPTDOWN",
          "target": "SWEPTDOWN"
        },
        {
          "description": "If you do not wish to attempt this, Return to tilepage 7 and continue from the last direction you read.",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "CENTIBATTLE": {
      "text": [
        "Place one token on the map to represent the centipede, roll initiative, then do battle with the hideous bug! Spawn its token within melee range.",
        "| |\n|-|\n| ****GIANT CENTIPEDE**** |\n| *Small Beast, Unaligned* |",
        "| |\n|-|\n| **Armour Class** 13 |\n| **Hit Points** 4 |\n| **Speed** 30 ft., Climb 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 5 (-3) | 14 (+2) | 12 (+1) | 1 (-5) | 7 (-2) | 3 (-4) |",
        "| |\n|-|\n| **Senses** Blindsight 30 ft., Passive Perception 8 |\n| **Skills** Perception +3, Stealth +7 |\n| **CR** 1/4 (50 XP) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Bite** +4 Weapon Attack, Reach 5ft, one creature. Hit 4 (1d4+2) piercing |"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry TOAST",
          "target": "TOAST"
        },
        {
          "description": "If you are killed, go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "CHALLENGE": {
      "text": [
        "You brandish your weapon and stand your ground before the rider. “Halt, brigand!” you roar as ferociously as you can. “Release that boy, or I’ll knock you off your mount, you merciless rogue!”",
        "The rider pulls his horse to a stop, and then appears to tilt his head down towards you. With a single, smooth motion, he moves his gauntletted hand forward and lifts his visor.",
        "And what you see inside the visor is… nothing.",
        "Just an empty, black void.",
        "Your heart stops, and it seems time stops too.",
        "Your hands go cold, and your mouth dries up.",
        "Then, suddenly, the armoured rider throws his head back, and a hollow, horrifying laugh fills the forest around you, echoing off every tree, scattering a multitude of birds into the sky…",
        "You close your eyes and clap your hands over your ears, as the malevolent cackle reaches down and smothers all good feelings within you… leaving only a despairing, black emptiness.",
        "When you open your eyes again, the mounted figure is gone.",
        "Gods, what did you just see? You breathe slowly, regaining your composure, slowing your heart, and praying to the gods you hold dear to give you strength! Looks like you’ll need it for this quest."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "CHANCEROLL": {
      "text": [
        "Make a d100 roll, adding 10 if you made a successful stealth check earlier."
      ],
      "nextSteps": [
        {
          "description": "If you score 0-33, go to DRYBONES",
          "target": "DRYBONES"
        },
        {
          "description": "If you score 34-65, go to PHANTASM",
          "target": "PHANTASM"
        },
        {
          "description": "If you score 66-100, go to QUIETPATH",
          "target": "QUIETPATH"
        }
      ]
    },
    "CHARMTHEPANTS": {
      "text": [
        "“You should let me go,” you hear yourself saying. “Do you know of the Death Knight?” The three all look at each other. “We do,” the leader says, looking back at you. “What of it?”",
        "“I’m here to put an end to him,” you say. “And to rescue a boy he has kidnapped.”",
        "There is an immediate change to their demeanour.",
        "“The Death Knight’s Squire!” the female rogue hisses.",
        "“What do you mean?” you ask quickly.",
        "She shakes her head. “He has kidnapped this boy to turn him into his squire. We’ve seen it before.”",
        "Your eyes go wide. “This has happened before?” The head rogue nods. “Yes. Some years ago. And it didn’t end well.”",
        "There is an awkward silence then, after which the leader directs the boy to search you.",
        "*He finds any items you might have taken. If you have the night goggles and a healing potion, the leader lets you keep these.*",
        "“Here,” he says, and comes forward, holding out a small bottle. “Holy water, given to me by a cleric. It may come in handy.” He gives you a slight smile. “Go well, traveller. I can’t let you steal from us, but if you can rid the wood of the Death Knight’s Scourge, you’ll be doing this land a great favour. We tried once before to infiltrate his lair. We failed. Now we do not concern ourselves with the business of ordinary folk.”",
        "*Except to rob them*, you think, but say instead, “Thanks.”",
        "The female rogue brings you something too – a hand-drawn map.",
        "“We made this after we tried to enter his lair last time.”",
        "You study the map – it is incomplete, but could prove useful.",
        "*You will find the map at the back of the Tilepage Booklet.*",
        "You farewell these rogues, and climb out of the entrance hole."
      ],
      "imageId": 3,
      "nextSteps": [
        {
          "description": "Return to tilepage entry 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "CHASTISE": {
      "text": [
        "At these words, the man rounds in anger, his face contorted in fury.",
        "“Insolent fool!” he roars, thrusting his hands towards you. A strange, sickly grey beam of energy flies at you across the river!",
        "*Make a dexterity save, DC 12 (he’s quite far away).*"
      ],
      "nextSteps": [
        {
          "description": "If you fail, go to entry GREYBEAM",
          "target": "GREYBEAM"
        },
        {
          "description": "If you succeed, go to entry LUCKYDODGE",
          "target": "LUCKYDODGE"
        }
      ]
    },
    "CHECKSUCCESS": {
      "text": [
        "You search carefully around, but see nothing to indicate any traps are set here."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 1 and continue from the last direction you read",
          "target": "TILEPAGE_1"
        }
      ]
    },
    "CHESTTRAPS": {
      "text": [
        "*Make a perception roll, DC 17.*"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to CRAFTY",
          "target": "CRAFTY"
        },
        {
          "description": "If you are unsuccessful, go to HMMM",
          "target": "HMMM"
        }
      ]
    },
    "CIRCULARROOM": {
      "text": [
        "This room is perfectly circular, and unlike the last one, does not smell musty. There is a faint smell of incense in here, and at the other side of the room from where you entered, you can see an altar of some kind. Rubble is scattered across the altar, and the floor at its base"
      ],
      "nextSteps": [
        {
          "description": "To investigate this rubble, go to entry LOOKRUBBLE",
          "target": "LOOKRUBBLE"
        },
        {
          "description": "To continue on towards the exit on the other side of the room, go to entry TUNNELVISION",
          "target": "TUNNELVISION"
        }
      ]
    },
    "CLAPPERS": {
      "text": [
        "You redouble your efforts, digging for all your life is worth!",
        "Make an athletics check, DC 15."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to DIGGER",
          "target": "DIGGER"
        },
        {
          "description": "If you fail, go to TOOSLOW",
          "target": "TOOSLOW"
        }
      ]
    },
    "CLIMBOUT": {
      "text": [
        "You climb out of the pit, relieved to be free. You dust yourself off and take a moment to get your bearings.",
        "You can see that you are in a small clearing in the forest. There is a path leading out of the clearing to the north, and another path leading to the east.",
        "You decide to take the north path."
      ],
      "nextSteps": [
        {
          "description": "Go to entry NORTHPATH",
          "target": "NORTHPATH"
        }
      ]
    },
    "CLIMBREDTREE": {
      "text": [
        "*Make an athletics check, DC9.*"
      ],
      "nextSteps": [
        {
          "description": "If successful, go to TREECLIMB",
          "target": "TREECLIMB"
        },
        {
          "description": "If unsuccessful, go to OHDEAR",
          "target": "OHDEAR"
        }
      ]
    },
    "CLOAKCHECK": {
      "text": [
        "You make your way off the path slightly, primed for any movement, and walk slowly up to the cloak.",
        "Pulling it down off the branch, you turn it over in your hands, inspecting the workmanship. It looks like it belonged to someone about your size, and you place it over your shoulders to try it out.",
        "You feel a change come over you – instantly you feel more secure, more hidden even. You have a feeling this cloak could come in very handy.",
        "*Add a Cloak of Protection to your inventory. This cloak will give you +1 bonus to AC and saving throws while you are wearing it! What a find!*",
        "Pleased with your new acquisition, you rejoin the path and continue on your way."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "COASTCLEAR": {
      "text": [
        "You do a pretty thorough visual search of the area, but find no traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "COMEATME": {
      "text": [
        "You ready your ranged attack, waiting with bated breath to see who appears.",
        "A hooded figure appears in sight.",
        "*Make your attack! Their AC is 12!*"
      ],
      "nextSteps": [
        {
          "description": "If you hit, take note of damage and go to CULTISTCOMBAT",
          "target": "CULTISTCOMBAT"
        },
        {
          "description": "If you miss, go to entry ENRAGED",
          "target": "ENRAGED"
        }
      ]
    },
    "COMPLIMENT": {
      "text": [
        "The strangers mood changes once more, a broad smile lighting up his face.",
        "“Oh, you like them?” he says with feigned modesty. “Yes, I got them in Llorkh, some years ago now, but they’ve kept their shape well, haven’t they! Thank you for your kind words, traveller! Plumeria, go and give our new friend a blessing!”",
        "You are beginning to see how capricious this stranger’s moods are. He seems quite literally away with the fairies.",
        "How do you respond to this?"
      ],
      "nextSteps": [
        {
          "description": "“A blessing? Why thank you, that sounds wonderful!” Go to entry BLESSING",
          "target": "BLESSING"
        },
        {
          "description": "“No thank you, I must be on my way.” Go to entry DECLINE",
          "target": "DECLINE"
        }
      ]
    },
    "CONVERSATION": {
      "text": [
        "The stranger seems friendly enough, and you respond, “You seem very relaxed! Do you live here in Weathercote Wood?”",
        "“I do,” he says, a mysterious twinkle in his eyes. “For some years now. “I talk to the trees, the birds, the woodland spirits… they are all my friends.”",
        "As you near this enigmatic fellow, you notice several strange things about him. For one, his voice does not seem to match his frame. His voice is deep, commanding, and he appears quite a slight man, short enough to pass for a halfling even, if a slightly taller one.",
        "There is a small winged creature who has alighted nearby, and strangely, the stranger has his feet rested on the head of what looks like a fallen stone statue.",
        "This strikes you as strange. A statue, all the way out here?",
        "Who is this mysterious character, and what is his story?",
        "You consider your next words."
      ],
      "nextSteps": [
        {
          "description": "“What is that statue that your rest your feet on, friend?” Go to entry STATUEQUESTION",
          "target": "STATUEQUESTION"
        },
        {
          "description": "“Do you know anything of the Death Knight?” Go to DKQUESTION",
          "target": "DKQUESTION"
        },
        {
          "description": "“Who is your little winged friend?” Go to FAIRYQUESTION",
          "target": "FAIRYQUESTION"
        }
      ]
    },
    "CORPSE": {
      "text": [
        "You lose your balance and drop, but only a short distance. To your horror, however, you smell death, feel a clammy hand grab you around the chest, and a horrid croak rattle in your ears!",
        "*Roll a d20 and add 3.*"
      ],
      "nextSteps": [
        {
          "description": "If the result is is equal to or higher than your AC, go to SLAMMED",
          "target": "SLAMMED"
        },
        {
          "description": "If lower, go to EXTRICATE",
          "target": "EXTRICATE"
        }
      ]
    },
    "CRAFTY": {
      "text": [
        "Cleverly concealed within the lock mechanism, you see a trigger switch that could be connected to a poison dart or something similar. The mechanism is extremely fine and will be hard to disarm.",
        "Still, no guts, no glory, right?",
        "Do you want to try to disarm it? You will need thieves’ tools.",
        "*If you do, make a thieves’ tools check, DC 17. This is a dex check with your proficiency bonus if you are a rogue, added twice if you have expertise.*"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to MASTERTHIEF",
          "target": "MASTERTHIEF"
        },
        {
          "description": "If you are unsuccessful, go to NOOBTHIEF",
          "target": "NOOBTHIEF"
        },
        {
          "description": "If you would rather not, you can check the pile of books and scrolls for clues. Go to SEARCHCLUES",
          "target": "SEARCHCLUES"
        },
        {
          "description": "Or you could leave the cave. Go to entry LEAVECAVE",
          "target": "LEAVECAVE"
        }
      ]
    },
    "CREEPERSLAIN": {
      "text": [
        "*Add 50 XP*",
        "You finally lay waste to the undead creeper, but keep your weapon to hand as you turn, facing the crypt. You fancy that you just heard an echo of some sort, like just the faintest note of… a song? An incantation? It was too faint to tell.",
        "You notice the dappled light of the sun, getting low in the sky once more. It only feels like an hour since morning! What is going on with the time in this wood?",
        "The burden of your quest lays heavily on your mind, and you begin to feel a sense of urgency. Perhaps it is already too late to rescue Darek Brewmont! You hope not."
      ],
      "nextSteps": [
        {
          "description": "Are you a paladin? If so go to EXUDING",
          "target": "EXUDING"
        },
        {
          "description": "If not, you move forward to investigate the entrance to the crypt. Go to entry ENTRANCETOMB",
          "target": "ENTRANCETOMB"
        },
        {
          "description": "If there is some other action you would like to take, for example to heal, (not rest, that would be foolish here), or leave the cemetery, you may return to tilepage 10 and take this action, moving your token appropriately.",
          "target": "TILEPAGE_10"
        }
      ]
    },
    "CRITICAL": {
      "text": [
        "*Roll initiative (d20) for yourself and the Death Knight. His initiative bonus is +1.*"
      ],
      "nextSteps": [
        {
          "description": "If you win the initiative, go to INITWON",
          "target": "INITWON"
        },
        {
          "description": "If you do not, go to KNIGHTATTACK",
          "target": "KNIGHTATTACK"
        }
      ]
    },
    "CROSSTHRESHOLD": {
      "text": [
        "You move inside the door and into the cool silence of the crypt. A stone passage, well-paved with solid rock walls, extends ahead."
      ],
      "nextSteps": [
        {
          "description": "Move your token to sub-map 3 (in the tilepage booklet) and follow the directions given",
          "target": "SUBMAP_3"
        }
      ]
    },
    "CULTISTCOMBAT": {
      "text": [
        "Place one token on the map to represent the cultist, 30 feet away (six squares) if you are fighting within the pit, melee range if not.",
        "Roll initiative and deal to this crazed fanatic! Who knows what bizarre ritual you were destined for!",
        "*The cultist will fire her crossbow first until you are within melee range, then she will use her scimitar (unless you are still in the pit, in which case she will use her crossbow the entire time).*",
        "| |\n|-|\n| ****CULTIST**** |\n| *Medium Human, Lawful Evil* |",
        "| |\n|-|\n| **Armour Class** 12 |\n| **Hit Points** 9 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 11 (0) | 12 (+1) | 10 (0) | 10 (0) | 11 (0) | 10 (0) |",
        "| |\n|-|\n| **Proficiency Bonus** +2 |\n| **Senses** Passive Perception 10 |\n| **Skills** Religion +2, Deception +2 |\n| **Languages** Common |\n| **CR** 1/8 (25 XP) |\n| **Dark Devotion** The cultist has advantage on saving throws against being charmed or frightened |",
        "| |\n|-|\n| **ATTACKS** |\n| **Hand crossbow** +3 to hit, 1d6 piercing damage |\n| **Scimitar** +2 to hit, 1d6 piercing damage |"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to EXCULTIST",
          "target": "EXCULTIST"
        },
        {
          "description": "If you are victorious, but still within the pit, go to STILLSTUCK",
          "target": "STILLSTUCK"
        },
        {
          "description": "If you run out of ranged attacks, go to SPENT",
          "target": "SPENT"
        },
        {
          "description": "If you are defeated, go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "CULTISTSHUT": {
      "text": [
        "You duck inside the still-open door of the little hut the cultists emerged from. The room appears to be empty!",
        "Suddenly you feel something press against your skull, as if a giant invisible hand were crushing it! You resist as best you can, but the force is overwhelming. Within moments, you have blacked out.",
        "You wake at what seems like much, much later. It is dark inside the room, probably night-time, and the room is empty."
      ],
      "nextSteps": [
        {
          "description": "Go to entry INDUCTED",
          "target": "INDUCTED"
        }
      ]
    },
    "DARKQUEST": {
      "text": [
        "At these words, you hear a crackling sound, like logs moving in a fire, and through the Blood Knight’s visor, you see the twisted shape of a hideous smile made out in embers, like a thin line of fire. You stare in horror.",
        "“Excellent, mortal! You have pleased me well. I would complete this task myself, but until the Goddess’s arrival I cannot risk standing in sunlight. As soon as Kiaransalee comes, she will grant me physical form. Then, for a time, I may roam free. Now go, fulfill your destiny!!!”",
        "*(If you were frozen by a spell, you are now released from this).* You stand, and, as if in trance, walk from the cabin. There, in a small pile outside the door, are your belongings. You quickly check them: yes everything is there, including your provisions. You shoulder your backpack, regaining some small measure of comfort, and look around, getting your bearings. You wonder for a second if this was all a dream, but then you feel for your newly acquired sword… and yes, it is still there.",
        "Quickly you turn, open the door, and peer inside again… but the hut is now empty. The Blood Knight is gone, and the table and chairs are overturned and covered in cobwebs and dust. What?!",
        "What just happened?",
        "*Add Sword of the Goddess’s Wrath to your inventory. Against normal creatures, this functions as a longsword with an extra 1d4 of fire damage, but against undead creatures, it gives you a +2 bonus on all attack rolls, with a damage of 1d8 slashing and 1d4 fire. Note these stats on your inventory.*"
      ],
      "nextSteps": [
        {
          "description": "You are standing on a pathway through Weathercote Wood. Go to tilepage 6 and continue from the last direction you read, or start with the first entry if this is your first time on this tilepage.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "DARTHIT": {
      "text": [
        "Two darts shoot out of cleverly concealed holes on the surrounding frame of the stone door, straight at you! You recoil in pain as they pierce your skin.",
        "*Roll 2d4 and deduct the result from your HP.*",
        "As you quickly tend to your wound, you look inside the now open door. Beyond it is a dark passageway, and some way inside you can see that a set of stairs leads down."
      ],
      "nextSteps": [
        {
          "description": "If you wish to enter, go to ENTERPASSAGE",
          "target": "ENTERPASSAGE"
        },
        {
          "description": "Or return to tilepage 3 if you want to leave this place and continue north or east.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "DARTMISS": {
      "text": [
        "The darts fly out at you at blinding speed, but your reflexes kick in and you dodge quickly out of the way. Well done!"
      ],
      "nextSteps": [
        {
          "description": "Go to ENTERPASSAGE",
          "target": "ENTERPASSAGE"
        },
        {
          "description": "Or return to tilepage 3 if you want to leave this place and continue north or east.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "DEADEND": {
      "text": [
        "You tread warily through the gravestones, weaving between them and taking care not to disturb whatever sleeps beneath your feet.",
        "You are about 100 ft away from the crypt."
      ],
      "nextSteps": [
        {
          "description": "Go to ENTRANCETOMB",
          "target": "ENTRANCETOMB"
        }
      ]
    },
    "DEADGOBLINS": {
      "text": [
        "*Add 150 XP*",
        "You quickly search the goblin’s bodies. Apart from their weapons, they carry little of value; they appear to be tribal, not really caring much for money or anything much else, apart from murdering passers-by perhaps!",
        "However, the leader of the group carries something interesting on a chain around his neck. It appears to be a human-sized ring.",
        "You can feel something emanating from it, some kind of potency. What is this little trinket?"
      ],
      "nextSteps": [
        {
          "description": "Do you know the Identify spell? That would tell you what this trinket is. If you want to cast Identify, go to DETECTRING",
          "target": "DETECTRING"
        },
        {
          "description": "If not, you could try putting it on? Go to entry PUTRINGON",
          "target": "PUTRINGON"
        }
      ]
    },
    "DEADLIZARDS": {
      "text": [
        "*Add 75 XP*",
        "You slay all three kobolds and quickly sheathe your weapon, feeling a sudden sense of urgency. A brief search of their bodies reveals two daggers, and a pouch containing… your jaw drops. Around 120gp! These kobolds have been busy little blighters, it seems!",
        "Satisfied with your find, you stand and look north, wondering what other surprises lay on the path ahead."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "DEADNELLY": {
      "text": [
        "You walk forward to where the beast had been before, making all that noise that woke you. There, twitching in its death throes, is the horse you rode from Orlbar. Gritting your teeth in anger, you take out your weapon and quickly put the poor beast out of its misery.",
        "The first rays of dawn begin to creep into the sky. With a sigh of resignation, you wipe the horse’s blood from your weapon and begin the trek towards the wood’s edge.",
        "The morning is peaceful, in contrast to the savagery you have just witnessed, and a chorus of birds greet the dawn with calls that echo off the low hills of the surrounding landscape. As you near Weathercote Wood and can see down the single path that leads into its depths, you see that little light seems to penetrate in through the canopy. Night still hides beneath the mossy boughs and dark green vines that thread the ancient trees together.",
        "You step onto the path and enter Weathercote Wood… who knows what fate awaits you within these shadowed depths…"
      ],
      "nextSteps": [
        {
          "description": "Go to tilepage 1 (Maps Booklet) and then click this link to go to the entry.",
          "target": "TILEPAGE_1"
        }
      ]
    },
    "DEADSPIDERS": {
      "text": [
        "*Add 100 XP*",
        "You take a moment to catch your breath, recovering from the battle with the spiders. Their dismembered corpses litter the ground.",
        "You destroy the rest of the webs, and then assess the situation."
      ],
      "nextSteps": [
        {
          "description": "To have a look around, go to entry INVESTIGATESPIDERS.",
          "target": "INVESTIGATESPIDERS"
        },
        {
          "description": "To keep going, go back to Tilepage 2 and continue from the last direction you read.",
          "target": "TILEPAGE_2"
        }
      ]
    },
    "DEATHBED": {
      "text": [
        "To your horror, you feel the ground begin to give way beneath your feet!",
        "*Make a dexterity check, DC 16.*"
      ],
      "nextSteps": [
        {
          "description": "If successful, go to JUMPAWAY",
          "target": "JUMPAWAY"
        },
        {
          "description": "If unsuccessful, go to CORPSE",
          "target": "CORPSE"
        }
      ]
    },
    "DEATHLYPACT": {
      "text": [
        "Do you have a pact with the Blood Knight of Kiaransalee?"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry BLOODKNIGHTSCURSE",
          "target": "BLOODKNIGHTSCURSE"
        },
        {
          "description": "If not, go to entry ULTIMATEGLORY",
          "target": "ULTIMATEGLORY"
        }
      ]
    },
    "DECLINE": {
      "text": [
        "“No, that’s allright thanks,” you reply.",
        "The man stands, screwing up his face. “You would refuse a blessing from an innocent little sprite such as Plumeria? What kind of monster are you? I have a mind to teach you a lesson, friend!”",
        "This abrupt mood change leads you to think this character is a few cards short of a full deck.",
        "*What do you say now?*"
      ],
      "nextSteps": [
        {
          "description": "*“Sorry, I didn’t mean anything by it. I’m on a quest, that’s all.”* Go to entry APOLOGIZE",
          "target": "APOLOGIZE"
        },
        {
          "description": "*“Oh ok then, I will take a blessing.”* Go to entry BLESSING",
          "target": "BLESSING"
        },
        {
          "description": "Turn and depart at a run… this man seems a bit dangerous and unpredictable. Go to entry SCARPER",
          "target": "SCARPER"
        }
      ]
    },
    "DEEPCAVE": {
      "text": [
        "You ponder the fate of these poor souls, whose bones lay in a pile in the middle of the floor. Why did they not leave? After reasoning it through, you decide that the only reason must be that they were trapped in here somehow. But by what? The river?",
        "What sort of end did they come to, stuck here in this cave? You shake your head in disbelief and horror.",
        "*To search the bonepile, make an investigation roll, DC 10.*"
      ],
      "nextSteps": [
        {
          "description": "If successful, go to SEARCHCAVE",
          "target": "SEARCHCAVE"
        },
        {
          "description": "If unsuccessful, go to CAVECLUES",
          "target": "CAVECLUES"
        },
        {
          "description": "If you would rather not, go to entry LEAVECAVERN",
          "target": "LEAVECAVERN"
        }
      ]
    },
    "DEEPCURRENT": {
      "text": [
        "There is something about this river that causes your Divine Sense to tingle. You move forward, and dip a hand into it, feel the water in your palm. It caresses your skin gently, infusing you with sacred potency…",
        "This entire river, or at least this section of it, is holy water!",
        "*If you wish, you may empty out your waterskin and replace the contents with holy water. You can still drink it as normal water, but the holy water may be useful against any undead you encounter.*"
      ],
      "nextSteps": [
        {
          "description": "When you are ready, you may return to the previous entry, CAVESTREAM, and continue from there.",
          "target": "CAVESTREAM"
        }
      ]
    },
    "DEEPWOODS": {
      "text": [
        "You edge forward warily, checking the ground and the trees above for traps. Who knows what deadly plans the inhabitants of this wood have in store for hapless travellers!",
        "*Make a perception check, DC 15.*"
      ],
      "nextSteps": [
        {
          "description": "If you fail, go to entry AMBUSH",
          "target": "AMBUSH"
        },
        {
          "description": "If you succeed, go to FREEPASS",
          "target": "FREEPASS"
        }
      ]
    },
    "DEFUSE": {
      "text": [
        "“Stop!” you yell at the top of your lungs.",
        "Shocked at this exclamation, the goblins halt their advance.",
        "“Attacking me would be foolish, little goblins,” you say, extending your hands, palms down, in a gesture of placation. “Do you know who I am?”",
        "*Make a charisma check, DC 16.*"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry SILVERTONGUE",
          "target": "SILVERTONGUE"
        },
        {
          "description": "If you fail, go to UNCONVINCING",
          "target": "UNCONVINCING"
        }
      ]
    },
    "DENYEVERYTHING": {
      "text": [
        "You have no way of knowing whether this ent is a friend or an enemy of the Death Knight. Evil ents are not unheard of in these parts – maligned, twisted old trees who take pleasure in the suffering of humans, elves and other two-legged creatures.",
        "“Just passing through, old one,” you say.",
        "The ent eyes you doubtfully. “Hm,” he grunts, squinting his eyes. “Well then, don’t dawdle too long about it,” he booms. “This wood is no place to linger for such creatures as yourself. There are many hidden dangers in the Wood you call the Weathercote. Be off with you!”",
        "And with that, he turns and stalks back into the forest, quickly disappearing from sight."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "DETECTEVIL": {
      "text": [
        "Deduct one spell slot.",
        "You cast the spell, and immediately feel it: the presence of powerful undead within this crypt. (continued across…)"
      ],
      "nextSteps": [
        {
          "description": "To enter, go to entry CROSSTHRESHOLD",
          "target": "CROSSTHRESHOLD"
        },
        {
          "description": "Otherwise, you can leave by going to LEAVECEMETERY",
          "target": "LEAVECEMETERY"
        }
      ]
    },
    "DETECTRING": {
      "text": [
        "Deduct one spell slot.",
        "You focus all your attention on the ring, trying to get inside its true nature. After some time it comes to you; the magic inherent in the ring belongs to the School of Enchantment.",
        "As the nature of the ring’s magic comes to you, you look closer at it. Finely etched around the little gold band are fine engravings, the shapes of animals: a bird, this is a Ring of Animal Friendship!"
      ],
      "nextSteps": [
        {
          "description": "Add the ring to your inventory if you desire, and then Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "DEVIOUS": {
      "text": [
        "The entry to the crypt appears trap-free.",
        "Gingerly, you ease the gates open. The metal seems to be relatively rust free and does not creak as you expected it would. Easing yourself within the gates, you grasp the handle of the left stone door and lean back. It swings smoothly out."
      ],
      "nextSteps": [
        {
          "description": "You proceed inside. Go to entry CROSSTHRESHOLD",
          "target": "CROSSTHRESHOLD"
        }
      ]
    },
    "DIGESCAPE": {
      "text": [
        "Sighing with resignation, you take your weapon and start digging holes in the dirt, footholds for you to climb up. The job takes quite some time, causing you to break into a sweat!",
        "Roll a d4."
      ],
      "nextSteps": [
        {
          "description": "If the result is 4, go to entry RETURN",
          "target": "RETURN"
        },
        {
          "description": "If the result is 1,2 or 3, go to MADEIT",
          "target": "MADEIT"
        }
      ]
    },
    "DIGGER": {
      "text": [
        "The approaching creature must be a bit slow.",
        "Working as fast as you can, you manage to create the last of your steps and quickly scale the side of the pit, turning to face whatever approaches.",
        "A robed woman, on the path ahead, stops in her tracks. “Wha – How did you get out?” she exclaims, infuriated at the fact that you have escaped her trap. Without another word, she angrily takes out a crossbow and begins loading a bolt."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CULTISTCOMBAT",
          "target": "CULTISTCOMBAT"
        }
      ]
    },
    "DILLYDALLY": {
      "text": [
        "As you are moving back towards the entrance that leads back to the surface, you hear voices! Voices speaking Common, laughing and conversing loudly. They are getting closer."
      ],
      "nextSteps": [
        {
          "description": "There is a largish pile of boulders nearby. To hide behind these, go to entry HIDEQUICK",
          "target": "HIDEQUICK"
        },
        {
          "description": "To stand in the open and face whoever approaches (if they come down the hole that is) go to entry NOTAFRAID",
          "target": "NOTAFRAID"
        }
      ]
    },
    "DISCERN": {
      "text": [
        "Even someone who had lived in the city their entire life could discern that whatever creature shed this blood, it was heading east as it did so. And as you look east, squinting ahead along the forest path, you fancy you can see a junction ahead where another path branches off to the north. It is hard to tell with trees encroaching on every inch of the path around here!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read.",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "DISCLOSURE": {
      "text": [
        "You begin telling your story, the quest your are on for the Brewmonts, looking for their grandson; how you came to be here in Weathercote Wood, and everything that has happened so far.",
        "As you talk, you notice the three thieves, the older man, the young boy and the woman exchanging looks. The more you talk, the less they interrupt, and simply listen to your story.",
        "When you finally finish, there is a long silence.",
        "Finally the older man, the one who seems like the leader of this little band of thieves, speaks.",
        "“My friend… we had no idea. We blundered into the Death Knight’s lair, once before, seeking treasure. We had no idea what the place really was. We escaped there with our lives, barely.”",
        "“Then untie me!” you demand. “And let me continue on my quest.”",
        "The leader directs the boy to untie you, and he quickly does so. The leader motions the female thief to him and whispers something in her ear. She moves away quickly.",
        "As you massage your wrists and ankles, you are brought water to drink, and some bread. The leader then crouches by your side, producing a map. You bite into the bread, surpised at how hungry you are.",
        "“Here,” he says, pointing to the small piece of parchment. “The lair of the one you seek.”",
        "Go to the tilepage booklet and turn to the very back. You will see a hand-drawn map on the last page. This is what he is showing you.",
        "“We went in there not long after we first arrived in Weathercote,” the thief says quietly. “We thought the place abandoned, but no. This Death Knight you seek, he is in there. And probably keeping this boy Darek captive there too. As you can see, the map is incomplete. We were chased out of there before we could progress further, but I am sure his lair is just a little further on. I don’t think the crypt went that far back.”",
        "You pore over the map. “And how do I get here,” you ask, tapping the page. “To the crypt. Where is the entrance?”",
        "The man exchanges looks with the other two, then turns back to you. “If you are set on going there, I will give you the directions. It is north from here. You go past the junction, and it is the first left. The crypt is on the far side of the cemetery. But beware! I have a feeling that the Death Knight has become even more powerful since we last visited him. Go cautiously, try to be unnoticed… like a shadow!”",
        "You eat a little more and then thank the band of thieves (recover 2hp). They do not let you take any gold, but do gift you with one healing potion, a blue coloured tincture in an ornate bottle, which you accept gratefully, and the map, which they also let you keep."
      ],
      "imageId": 4,
      "nextSteps": [
        {
          "description": "Add these items to your inventory and leave this thieves’ den! Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "DISTURBED": {
      "text": [
        "You are woken at midnight by a sound that makes you sit bolt upright – an unearthly howl, that sounds not even animal, certainly not human… You are in a dream when you hear it, and the spine-chilling sound mingles with your dream. It is still going when you wake up and then trails off, the last rising note haunted with agony. Gods, what could make a sound like that?",
        "Disturbed to the core, you try to settle down and get back to sleep, but it is hopeless. You are on edge for the rest of the night.",
        "Recover a hit die minus 1hp for your disturbed sleep. If you roll 1 or 2, take the average for your hit die instead. Yeah – I’m a nice DM.",
        "As dawn begins to creep into the sky, you pack away your bedroll and quietly make your way back out to the path."
      ],
      "nextSteps": [
        {
          "description": "Return to the tilepage 8 entry and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "DITCHPACK": {
      "text": [
        "Quickly you wriggle out of the straps of your pack and keep swimming towards the far shore. The only thing you are able to save is your weapon and whatever else is tucked securely into your belt.",
        "Erase your backpack and everything kept within it, including your provisions, from your inventory.",
        "Bedraggled and panting, you finally wash up on the far shore, thanking the gods you didn’t drown!",
        "Deduct 1 hp for your efforts.",
        "After some time you get your breath back and then finally gather enough energy to make your way back upstream to the cave. A chilly breeze seems to be coming from within the cave, and a strange smell also… kind of like mouldy rot. Around the entrance, embedded in the earth are broken shards of pottery and other detritus."
      ],
      "nextSteps": [
        {
          "description": "To enter the cave, go to entry ENTERCAVE",
          "target": "ENTERCAVE"
        }
      ]
    },
    "DKQUESTION": {
      "text": [
        "“Death Knight?” the stranger says quizzically. “Such things do not exist in this wood my friend, or if they do, they have not met the great Shagaxa yet!” The stranger puffs up his chest at these words. Obviously he speaks of himself, but you can’t help thinking he’s not quite right in the head. He smiles at you.",
        "“So, will you take a blessing from little Plumeria here?” he asks."
      ],
      "nextSteps": [
        {
          "description": "To take him up on his offer, go to entry BLESSING",
          "target": "BLESSING"
        },
        {
          "description": "To politely refuse, go to entry DECLINE",
          "target": "DECLINE"
        }
      ]
    },
    "DOGLEG": {
      "text": [
        "As you pass the corner, you feel the ground drop about an inch underfoot, and hear a ‘click’ sound.",
        "Can’t be good.",
        "Make a dexterity saving throw, DC 15. Make this throw with advantage if your barbarian danger sense was activated earlier."
      ],
      "nextSteps": [
        {
          "description": "If successful, go to entry BLADEDODGE",
          "target": "BLADEDODGE"
        },
        {
          "description": "If unsuccessful, go to SWINGER",
          "target": "SWINGER"
        }
      ]
    },
    "DOORCHECK": {
      "text": [
        "Move your token up to the stone building if its not already.",
        "You start inspecting the handle and all around the door, looking for booby traps, or traps of any description.",
        "Roll perception, DC 14."
      ],
      "nextSteps": [
        {
          "description": "If successful, go to entry ENTRANCETRAP",
          "target": "ENTRANCETRAP"
        },
        {
          "description": "If you fail, go to entry ALLCLEAR",
          "target": "ALLCLEAR"
        }
      ]
    },
    "DRYBONES": {
      "text": [
        "As you walk forward, you notice a thick grey fog spreading over the track… Hand on your weapon, you freeze, rigid, as the fog roils towards you. It is still some meters away, but it turns and billows like steam from a boiling cauldron.",
        "From the middle of this strange mist, a figure emerges… an armoured skeleton!",
        "He carries a sword and a shield, and seeing you, lets out a ghastly rattling noise, somewhere between laughter and a dying breath. He limps forward, raising his blade.",
        "You steady yourself, drawing your weapon.",
        "Looks like its bonecrunching time!"
      ],
      "nextSteps": [
        {
          "description": "Are you a cleric? If so, you could try to turn this undead warrior! Go to entry TURNSKELETON",
          "target": "TURNSKELETON"
        },
        {
          "description": "If not, you will simply have to hack away at this bag of bones! Go to entry SKELETONBATTLE",
          "target": "SKELETONBATTLE"
        }
      ]
    },
    "DUCKUNDER": {
      "text": [
        "You crouch as you make your way forward along the path, taking care to stay below the level of the glyph. If there is any sort of effect that it is supposed to emanate, you seem to be avoiding it."
      ],
      "nextSteps": [
        {
          "description": "Do you want to investigate the hut? If so, go to entry LITTLEHUT.",
          "target": "LITTLEHUT"
        },
        {
          "description": "If not, return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "DUKEITOUT": {
      "text": [
        "Frothing like some crazed animal, the Death Knight harnesses his rage once more and attacks!",
        "Roll a d20+5 with advantage a final time, with 1d8+4 slashing damage if it hits.",
        "Continue the combat between yourself and the Death Knight (and Darek too, if you tossed him a blade). The Death Knight’s stats are below, minus feats. From now on he will only attack using Hellreaver, his longsword +1.",
        "| |\n|-|\n| ****DEATH KNIGHT**** |\n| *Medium Undead, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 15 |\n| **Hit Points** 28 (minus dmg already caused) |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 15 (+2) | 11 (+0) | 13 (+1) | 12 (+1) | 10 (+0) | 5 (-3) |",
        "| |\n|-|\n| **Saving Throws** Strength +3 |\n| **Damage Immunities** Poison |\n| **Condition Immunities** Poisoned, charmed, unconscious, frightened, paralyzed, stunned |\n| **Senses** Darkvision 60ft, Passive Perception 8 |\n| **Languages** Common |\n| **CR** 1 (200XP) |\n| **Turn Immunity** The Death Knight cannot be turned by any Turn Undead feat or spell. |",
        "| |\n|-|\n| **ATTACKS** |\n| **Hellreaver (Longsword +1)** +5 Melee Weapon Attack (proficiency added), reach 5ft, one target. Hit 4 (1d8+3) slashing damage. |"
      ],
      "nextSteps": [
        {
          "description": "If you defeat the Death Knight, go to entry VICTORIOUS",
          "target": "VICTORIOUS"
        },
        {
          "description": "If you are defeated, go to entry VALIANTDEFEAT",
          "target": "VALIANTDEFEAT"
        }
      ]
    },
    "EASYPATH": {
      "text": [
        "You leave the cemetery, a little voice inside you chiding you for your cowardice. Scared of a graveyard, a hardened adventurer like you?",
        "You return to the junction and see the grassland ahead. It would be so easy to leave right now, just abandon the quest and depart this area completely.",
        "If you are still thinking of rescuing Darek Brewmont, you get the nagging feeling that he may be running out of time.",
        "ENOUGHOFTHIS!",
        "Aborting your attempt to cross the river, you turn and swim back the way you came, finally flopping onto the shore you left from, panting and coughing up water.",
        "Erase your provisions from your inventory – they are ruined!",
        "Finally you get your breath back and assess your situation."
      ],
      "nextSteps": [
        {
          "description": "To head north towards the grasslands, go to entry QUESTABANDON",
          "target": "QUESTABANDON"
        },
        {
          "description": "To return to the cemetery, go to tilepage 10 and follow the instructions there",
          "target": "TILEPAGE_10"
        },
        {
          "description": "Or you may return south to the four-way junction. Go to entry BACKTOJUNCTION",
          "target": "BACKTOJUNCTION"
        },
        {
          "description": "Return to tilepage 7 and continue from the last direction you read.",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "ENRAGED": {
      "text": [
        "The figure rolls out of the way just in time, and your attack goes flying into the forest behind.",
        "Throwing her hood back, the robed female screams in rage. “How dare you attack one of the order of the Kiaransalee!” she screams, producing a hand crossbow which she immediately begins loading."
      ],
      "nextSteps": [
        {
          "description": "You’ll need to keep those ranged attacks going now! Go to entry CULTISTCOMBAT",
          "target": "CULTISTCOMBAT"
        }
      ]
    },
    "ENTERCAVE": {
      "text": [
        "You cautiously step inside the cave entrance, feeling the cool, slightly stale air surround you."
      ],
      "nextSteps": [
        {
          "description": "Go to sub-map 1 and then proceed to the sub-map 1 entry in this booklet.",
          "target": "SUBMAP_1"
        }
      ]
    },
    "ENTERPASSAGE": {
      "text": [
        "You enter the quiet, cool passage and pad softly down the corridoor. Soon you are at the top of a flight of stone stairs, looking down.",
        "(This is presuming you have a source of light, or darkvision. If you do not have darkvision and do not have a source of light handy, then your character will know to turn around and leave this place. If you do have a source of light, activate it and continue! See the intro section on darkvision).",
        "You quietly walk down the stairs, keeping an eye out for anything out of the ordinary.",
        "Could this be the place where Darek Brewmont is being held? You hold your breath, fearful of making any sound to disturb the deathly still air.",
        "Slowly you descend to the bottom of the stairs, where a medium-sized chamber lies.",
        "You look around for clues as to what this place is used for.",
        "As you become accustomed to the light, or rather the lack of it, you notice that at the far end of the chamber is a large idol, made out of bronze by the looks of it. You know the God well: it is Amaunator, the Sun god, the god of law and justice, worshipped throughout Faerun. You also notice cushions lying about the place. It appears this room was once a monastery of some sort, used by devotees of Amaunator for meditation. Although what it’s doing so far out in the wilderness is anyone’s guess.",
        "Are you a paladin or a cleric? If so, you could pray to Amaunator for inspiration. Roll a d100. If you score 50 or above, award yourself 1 inspiration point, which you can use to award yourself advantage, once, when making a saving throw or an attack roll."
      ],
      "nextSteps": [
        {
          "description": "To inspect the area around the altar, go to entry INSPECTALTAR",
          "target": "INSPECTALTAR"
        },
        {
          "description": "To have a general search around the room, go to entry EXPLOREROOM",
          "target": "EXPLOREROOM"
        },
        {
          "description": "To turn around and leave, return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "ENTRANCETOMB": {
      "text": [
        "You walk slowly forward, primed for any surprises that might suddenly present themselves.",
        "As you near the crypt, you see that it is ornately carved, and also set into a solid bank of earth that sits behind it. It appears the crypt extends underground some way. It doesn’t take a dwarf to see that whoever this was constructed for was lavish in their tastes.",
        "Above the door is a coat of arms with a small plaque set beneath. It reads:",
        "Together for all eternity, abiding peacefully in the Rays of Amaunator, the Family of- Where the name of this family was presumably carved before, now the marble has been chipped away until unrecognizable.",
        "You can possibly see the top of an ‘a’ near the middle of what used to be the name, but that is all.",
        "You see that the gates, and the double stone doors beyond are ever so slightly ajar. They appear open."
      ],
      "imageId": 5,
      "nextSteps": [
        {
          "description": "To check the entrance for traps, go to GATETRAP",
          "target": "GATETRAP"
        },
        {
          "description": "To skip that part and just open the gates, go to GETINSIDE",
          "target": "GETINSIDE"
        }
      ]
    },
    "ENTRANCETRAP": {
      "text": [
        "Your keen eye could have just saved your life! Closely inspecting the door, you notice a catch mechanism cleverly hidden under the large metal ring handle on the right door."
      ],
      "nextSteps": [
        {
          "description": "Do you want to try and disarm it? You will need thieves’ tools to do so. If you want to attempt this, go to entry NIMBLEFINGERS",
          "target": "NIMBLEFINGERS"
        },
        {
          "description": "If you don’t have thieves’ tools, but want to try and open the door anyway, go to entry OPENSTONEDOOR",
          "target": "OPENSTONEDOOR"
        },
        {
          "description": "If you would rather leave it and continue north, Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "EXCULTIST": {
      "text": [
        "Add 25 XP.",
        "The female cultist carries little in the way of her equipment. You may take her weapons (hand crossbow, 18 bolts, scimitar).",
        "She does carry two items of interest: a map of the town of Orlbar, with various houses mapped in red. And these houses all have the word “here” written next to them. Around her neck is an amulet of some kind. It is made of dull steel, and is a simple flat coin with an image of a red gauntlet on it. You have no idea what either of these signifies.",
        "Add these items to your inventory if you wish, and continue on your way!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "EXPERTISE": {
      "text": [
        "“Show me your weapon,” Plumeria says.",
        "You do so. The little fairy alights on it, and you hear a faint, barely audible incantation.",
        "“It is done,” she says. “When you are ready, kiss your weapon twice and it will become enchanted with woodland magic! And now…” Plumeria flutters back up to your shoulder, and whispers in your ear, “Run!",
        "Get away, while you still can! He’s insane!” You may use Plumeria’s blessing in any encounter, making your weapon +1. It will last for the duration of one battle, although you wonder what your enemies will think when they see you kiss your weapon during battle!"
      ],
      "nextSteps": [
        {
          "description": "Wasting no more time, you get out of there quickly! Go to entry SCARPER",
          "target": "SCARPER"
        }
      ]
    },
    "EXPLOREROOM": {
      "text": [
        "There are numerous nooks and alcoves around the side of this dusty room, many of them hidden in darkness. You search, mindful of traps, but also on the lookout for any items of interest. As you walk, small puffs of dust rise up, seemingly undisturbed for a long time; years, maybe decades.",
        "Make an investigation check."
      ],
      "nextSteps": [
        {
          "description": "If you score 1-10, go to entry NOTBAD.",
          "target": "NOTBAD"
        },
        {
          "description": "If you score 11-15, go to entry BETTER",
          "target": "BETTER"
        },
        {
          "description": "If you score 16 or above, go to entry REALLYGOOD",
          "target": "REALLYGOOD"
        }
      ]
    },
    "EXTRACAUTIOUS": {
      "text": [
        "You think better of descending into the gaping hole, and instead consider your options at the four way junction."
      ],
      "nextSteps": [
        {
          "description": "Return to the tilepage 8 entry and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "EXTRICATE": {
      "text": [
        "With a violent elbow backwards into the guts of whatever has a hold of you, you force it to release you and jump to your feet, quickly pulling yourself up and out of the grave."
      ],
      "nextSteps": [
        {
          "description": "Go to entry ZOMBIEBATTLE",
          "target": "ZOMBIEBATTLE"
        }
      ]
    },
    "EXUDING": {
      "text": [
        "You sense the presence of undead nearby nearby. Your heart races. Could this be the could this be the Death Knight’s Lair? It certainly seems a likely location!"
      ],
      "nextSteps": [
        {
          "description": "To move forward and investigate the crypt doors, go to entry ENTRANCETOMB",
          "target": "ENTRANCETOMB"
        }
      ]
    },
    "FAIRYQUESTION": {
      "text": [
        "“Ah, this is my little friend, Plumeria! She grants blessings, would you like one?”"
      ],
      "nextSteps": [
        {
          "description": "To answer “Yes, I would!” go to entry BLESSING",
          "target": "BLESSING"
        },
        {
          "description": "To answer, “No thanks, that’s allright,” go to entry DECLINE",
          "target": "DECLINE"
        }
      ]
    },
    "FANATICSBATTLE": {
      "text": [
        "Place two tokens on the map, within melee range of your token, to represent the two cultists. Roll initiative and do battle with these lunatics!",
        "| |\n|-|\n| ****CULTISTS**** |\n| *Medium Human, Lawful Evil* |",
        "| |\n|-|\n| **Armour Class** 12 |\n| **Hit Points** 9 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 11 (0) | 12 (+1) | 10 (0) | 10 (0) | 11 (0) | 10 (0) |",
        "| |\n|-|\n| **Proficiency Bonus** +2 |\n| **Senses** Passive Perception 10 |\n| **Skills** Religion +2, Deception +2 |\n| **Languages** Common |\n| **CR** 1/8 (25 XP) |\n| **Dark Devotion** The cultist has advantage on saving throws against being charmed or frightened |",
        "| |\n|-|\n| **ATTACKS** |\n| **Scimitar** +2 to hit, 1d6 piercing damage |"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry ZEALOTSSNOMORE",
          "target": "ZEALOTSSNOMORE"
        },
        {
          "description": "If you are defeated, go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "FLAILING": {
      "text": [
        "You are now in danger, and must ditch your pack if you want to make it the whole way across. If you do not, you run the very real risk of drowning."
      ],
      "nextSteps": [
        {
          "description": "To ditch your pack, go to DITCHPACK",
          "target": "DITCHPACK"
        },
        {
          "description": "To try and keep hold of your pack, go to SKETCHY",
          "target": "SKETCHY"
        }
      ]
    },
    "FLAMEWEB": {
      "text": [
        "You produce your flint and tinder and start trying to light some tinder to create fire… You crouch down, working the stone, trying to produce a fire that can burn the webs away."
      ],
      "nextSteps": [
        {
          "description": "Did you suceed in an earlier stealth check? If so, go to entry HEREWEGO.",
          "target": "HEREWEGO"
        },
        {
          "description": "If you did not make a stealth check, or if you failed one, go to entry OHNO.",
          "target": "OHNO"
        }
      ]
    },
    "FLYESCAPE": {
      "text": [
        "Hovering easily up and out of the pit trap, you thank the creator that made you the way you are! Smiling broadly, you come to rest gently at the side of the pit. Looking ahead, you focus back on your quest and resume your progress down the path."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "FOOTHOLDS": {
      "text": [
        "You carefully climb down. There is a drop, about 15 ft or so, but you use several rocky crags to make the descent a bit easier.",
        "Reaching the bottom you see a passage of sorts, more a kind of winding burrow, extending ahead. You begin to make your way slowly down it. Outside it was nearing evening, and thus inside here it grows dark, but ahead you see a source of light!"
      ],
      "nextSteps": [
        {
          "description": "To head towards this light source, go to entry TOTHELIGHT",
          "target": "TOTHELIGHT"
        },
        {
          "description": "To leave this place and climb back up to the surface, return to tilepage 8 and continue from the last direction you read.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "FORESTTRAPS": {
      "text": [
        "You have a good look around, but cannot see anything that looks trap-like around here.",
        "Still cautious, you move forward."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "FORWARD": {
      "text": [
        "You edge forward, drawing your weapon and keeping watch on all sides. After all, where there’s webs… You stop before the first web, a thick mass of silken threads. It looks tough; an ordinary weapon is going to struggle to cut through this."
      ],
      "nextSteps": [
        {
          "description": "Do you know any flame-producing cantrips or spells? Or, do you possess Alchemists Fire? If so, go to entry BURNWEB.",
          "target": "BURNWEB"
        },
        {
          "description": "What about the Mage Hand cantrip? If you want to try this, go to entry SHIFTWEB.",
          "target": "SHIFTWEB"
        },
        {
          "description": "Thunderwave spell? Go to entry THUNDERWEB.",
          "target": "THUNDERWEB"
        },
        {
          "description": "If you want to try and use ordinary fire to burn them away, go to entry FLAMEWEB.",
          "target": "FLAMEWEB"
        },
        {
          "description": "If you’d prefer to try and move them with your weapon, go to entry SLASHWEB",
          "target": "SLASHWEB"
        },
        {
          "description": "Or, you could just throw something at the web and see what happens? Go to TESTWEB",
          "target": "TESTWEB"
        }
      ]
    },
    "FREEPASS": {
      "text": [
        "You notice a patch of the forest path that looks a bit out of place. Staying back and poking around with a stick, you can see that someone has dug a pit trap here. Who knows that they had planned for whoever fell in!",
        "You skirt around the outside of the pit trap and continue on the path."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "FRIENDLYCHAP": {
      "text": [
        "After showing you his wares, Mikadus claps you firmly on the back.",
        "“Well met, my friend!” he exclaims cheerfully as his assistant loads up the poor pony again, who was beginning to look relieved at having its load removed. “I wish you luck on your journey, wherever you are heading!” ( Before you can get another word in, the talkative merchant has turned his back and departed, the pony labouring under the weight of its load once more.",
        "You can’t help thinking that Mikadus Fairweather is the happiest merchant you have ever met."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "FUNKYFUNGI": {
      "text": [
        "Suddenly it comes to you! Yes, you thought it had seemed familiar. These are Grakspores, and they are well-known to warriors, emboldening them before going into battle.",
        "Overjoyed at this find, you begin gathering the fungi into a small pouch. Weathercote Wood is certainly full of surprises!",
        "Grakspores will grant immunity to the frightened condition or any fear effect, at full effectiveness for one hour. They can effectively be used for one encounter and can be consumed as a free action, after which they take effect immediately. Add them to your inventory."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "GARB": {
      "text": [
        "You make your way quietly up the path, keeping an eye out for enemies.",
        "To your right, something catches your eye, something moving in the trees. You freeze, hand on your weapon, and look closer, squinting through the dense undergrowth.",
        "It appears to be a cloak, hanging from a branch and moving slightly in the breeze. It is a deep green, a forest green, easily missed."
      ],
      "nextSteps": [
        {
          "description": "To inspect this cloak, go to entry CLOAKCHECK",
          "target": "CLOAKCHECK"
        },
        {
          "description": "To ignore it and keep going, Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "GASSED": {
      "text": [
        "Roll 1d4 and take that much poison damage.",
        "If this causes you to die, go to entry OHWELL. Otherwise, continue reading below.",
        "You don’t remember anything after the gas hit you in the face. You wake up, still within the mine, but your head is pounding, and you find you are bound hand and foot. Your mouth is gagged also. As your vision clears, you see that you are surrounded by three figures – all human. Gradually your sight improves a little more and you see that they are all what you would call, ‘the adventuring type’. Probably rogues.",
        "The first one, an older man, smiles on seeing you awake. He has a long, deep scar across his cheek, and a rough-looking face.",
        "“Ah! We didn’t kill him after all. That’s good.” “Nice try,” says another, a younger man, in his teens, walking forward and crouching down. “But you should have known.",
        "Shouldn’t you? You should have recognized the workmanship. We’re not playing around here. We’re not new to this game.” Then the third, a darkly-dressed female, speaks up. “Now the only question that remains is… what do we do with you?” The rough-looking older man speaks again.",
        "“Remove his gag,” he orders the boy, who immediately obeys. You cough a little, smacking your lips to try and get a bit of moisture back into your parched mouth.",
        "“Speak!” the man says. “Who are you?”’"
      ],
      "nextSteps": [
        {
          "description": "Do you tell this thief of your quest? Go to DISCLOSURE",
          "target": "DISCLOSURE"
        },
        {
          "description": "Or will you make something up? Go to SPINYARN",
          "target": "SPINYARN"
        }
      ]
    },
    "GATETRAP": {
      "text": [
        "Make a perception roll, DC 12"
      ],
      "nextSteps": [
        {
          "description": "If successful, go to DEVIOUS",
          "target": "DEVIOUS"
        },
        {
          "description": "If unsuccessful, go to BATEDBREATH",
          "target": "BATEDBREATH"
        }
      ]
    },
    "GETINSIDE": {
      "text": [
        "Steeling yourself, you pull the gate smoothly open… nothing happens.",
        "You congratulate yourself on trusting your instincts and open the stone door too, pulling it out.",
        "There is a sucking sound as the air of the crypt is replaced by the outside air. You stare within the depths, and see a passageway that appears to open into a chamber after some way."
      ],
      "nextSteps": [
        {
          "description": "Do you know the spell Detect Good and Evil? You can cast it by going to DETECTEVIL",
          "target": "DETECTEVIL"
        },
        {
          "description": "Alternately, you can move inside by going to entry CROSSTHRESHOLD",
          "target": "CROSSTHRESHOLD"
        }
      ]
    },
    "GIFTOFGAB": {
      "text": [
        "The thief leader nods slowly. “Very well then,” he says quietly, and directs the boy to bring you your things and release your bonds. “Get you gone then.” he points towards the exit.",
        "Quickly you exit the hole back into the night, and walk some way, looking back, making sure you are not followed. Then you turn back and make your way through the wood, to just north of where you were before."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "GOAROUND": {
      "text": [
        "You go around the eastern side of the tree, taking care to crouch as well, just to be safe.",
        "If there is some sort of effect inherent in this glyph, you have managed to avoid it. Good work!",
        "However, could you go to the hut, visit there, while avoiding any effects the glyph had? Perhaps the glyph itself is redundant?",
        "There is no way of telling!"
      ],
      "nextSteps": [
        {
          "description": "To investigate the little house, go to entry LITTLEHUT",
          "target": "LITTLEHUT"
        },
        {
          "description": "To ignore the little house and continue down the path, return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "GOBLINBATTLE": {
      "text": [
        "Place three tokens on the map to represent the goblins, roll initiative and do battle! The goblins attack all at once, one attack each.",
        "The spear goblin will hang back for the first attack and throw his spear, then will rush forward to retrieve it while the other two attack with staff and goblin battleaxe respectively.",
        "As a free action, you could try to stand on the thrown spear (if it misses) to stop the spear goblin from retrieving it. In order to do this, and not lower your AC, make a dex check, DC 16. If you manage to do this, the spear goblin will miss his 2nd turn, but you’ll need to take your foot off it to attack again, and then he will retrieve and use as a melee weapon from that point on.",
        "| |\n|-|\n| ****GOBLINS**** |\n| *Small Humanoid, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 15 |\n| **Hit Points** 7 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 8 (-1) | 14 (+2) | 10 (0) | 10 (0) | 8 (-1) | 8 (-1) |",
        "| |\n|-|\n| **Senses** Darkvision 60ft, Passive Perception 9 |\n| **Skills** Stealth +6 |\n| **Languages** Common, Goblin |\n| **CR** 1/4 (50 XP) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Spear** Ranged attack, +4, Range 20/60 Hit 1d6+2 |\n| **Bonestaff** Melee attack, +1, Reach 5ft Hit 1d4+1 |\n| **Goblin battleaxe** Melee attack, +1 to hit Hit 1d6+1 |"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to entry DEADGOBLINS",
          "target": "DEADGOBLINS"
        },
        {
          "description": "If you are defeated go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "GOBLINGIFT": {
      "text": [
        "The goblin leader is exceedingly pleased with your gift. He pockets it and then comes close, lowering his voice.",
        "“If it is the Death Knight you come to face, man-traveller, then you ought to know this…” And he points at the red tree, which is still visible through the undergrowth, west of the path. “Take a branch from that tree and make a stake from it. That’s the only way he can be killed. Otherwise, you can only stop him for a while! If you don’t kill him, he’ll hunt you down mercilessly! Many of your kind have died that way.” You consider these words, and thank the goblin leader for his help. The goblins totter off, fighting over the gift you just gave them, and you are left alone once more."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "GOODSHOT": {
      "text": [
        "You hear your arrow make its mark, and hear a cry of pain – definitely not human, you know that much. However, the creature hardly slows, and soon it is out of sight, disappeared within the dark green of Weathercote Wood."
      ],
      "nextSteps": [
        {
          "description": "Go to entry DEADNELLY.",
          "target": "DEADNELLY"
        }
      ]
    },
    "GOTTHEDROP": {
      "text": [
        "You round the corner, and the track points itself north again. You adjust your pack on your back, taking a deep breath and forging ahead.",
        "Suddenly, you feel something drop on your head… a net! There is a screeching sound, and through the mesh of the net you see three goblins, coming at you with weapons raised!",
        "Make a dexterity save, DC 17."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to NETESCAPE",
          "target": "NETESCAPE"
        },
        {
          "description": "If you fail, go to ROUNDONE",
          "target": "ROUNDONE"
        }
      ]
    },
    "GRAVETRAPS": {
      "text": [
        "As you peer into the graveyard, trying to make a visual inspection, you notice that the ground on one of the graves seems suspiciously fresh, as if recently disturbed.",
        "You make a note to avoid that area."
      ],
      "nextSteps": [
        {
          "description": "To proceed towards the crypt, go to SOFTLY",
          "target": "SOFTLY"
        },
        {
          "description": "To leave the cemetery, go to LEAVECEMETERY",
          "target": "LEAVECEMETERY"
        },
        {
          "description": "Are you a barbarian? If so, go to entry BEARINGS",
          "target": "BEARINGS"
        }
      ]
    },
    "GREYBARKCONVO": {
      "text": [
        "You tell Greybark everything to do with your adventure. He listens with rapt attention, nodding every now and then.",
        "When you are finished, he says to you, “And did you take a branch from the red tree, to fashion a stake? For it is the only way the Death Knight can be truly killed.” If you have not, Greybark directs you to go and do this now. Add a Red Tree Stake to your inventory.",
        "“Your quest is noble, traveller,” Greybark says. “And unlike many I have seen enter these woods, you look as though may just be able to accomplish it.” He smiles, the wood around his mouth creaking as it forms a kindly smile.",
        "You thank Greybark, and ask him if there is any way he can help you in your quest.",
        "“As a matter of fact, young traveller, I can!” Greybark reaches up to his head and snaps off a long branch, then begins working with his hands on the branch, stripping the leaves and smaller branches off, gradually fashioning it into something. As he works, he also sings, a deep sonorous sound, and birds begin to flock around him, landing on his shoulders. They begin to shed feathers, and Greybark plucks these out of the airs, stripping smaller branches and adding the feathers to the end. In what seems like a very short time, there is a pile at his feet, a pile of arrows.",
        "Gently, Greybark places a bow into your hands. It is finely made, as if crafted by expert elven bowyers, and the arrows are perfectly straight. However, it still has a certain rough wildness to it, a rustic appearance.",
        "You take it up and test it. It is probably the best bow you have ever handled.",
        "Greybark’s gift is a longbow+1! Add this very special gift, and 20 arrows, to your inventory.",
        "Greybark converses with you for a little while longer, and then informs you he has ‘things to attend to.’ “Good luck, traveller!” he booms, and then turns and walks away. Within moments he has merged back into the forest.",
        "Shaking your head in wonderment at this encounter, you turn your attention back to your quest and the task at hand."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "GREYBEAM": {
      "text": [
        "The beam hits you, and you feel a horrible sensation spread through you. You look down, and see your torso transforming into grey rock… the effect spreads outwards, extending to your limbs and your extremities.",
        "You are petrified!",
        "The strange little man laughs and flops back down on the moss. “Excellent!” he exclaims.",
        "“Another decoration for my little woodland glade! What do you think, Plumeria?” You cannot move, cannot cry out… all you can do is think, “How the hell did I get myself in this mess?” You stay like that for some time, frozen on the path, at the mercy of the elements."
      ],
      "nextSteps": [
        {
          "description": "Go to entry WHATSMYFATE",
          "target": "WHATSMYFATE"
        }
      ]
    },
    "HANKY": {
      "text": [
        "As you move cautiously forward, keeping a watch on all sides, you see something small being blown in the wind down the path towards you. As it passes you quickly trap it with your booted foot, then retrieve it from the ground for closer inspection.",
        "It is a handkerchief, white silk and slightly dirtied, with the initials “D.B.” embroidered into one corner. Darek Brewmont! Perhaps he dropped it, as a sign? You raise it to your nose and give it a sniff, and immediately choke on the hideous aroma. It smells like death, like the grave. Your heart drops – could the boy already be dead? Perhaps you are too late.",
        "Gritting your teeth determinedly, you shake these grim thoughts away and continue on your quest."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "HARMLESS": {
      "text": [
        "There is an audible ‘click’ as the catch mechanism is released. You sigh with relief, and give the door a pull. It swings smoothly open, revealing a dark passageway. Some way inside you can see that a set of stairs leads down."
      ],
      "nextSteps": [
        {
          "description": "To enter the passage, go to ENTERPASSAGE",
          "target": "ENTERPASSAGE"
        },
        {
          "description": "To leave and continue north, go back to tilepage 3 and continue from the last line you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "HASTYCARAVAN": {
      "text": [
        "Despite your victory, the words of the Blood Knight are still fresh in your mind. Turning north at the junction that led you to the cemetery, you continue for a short way, and finally Weathercote ends, and the landscape changes to wide, open grasslands.",
        "The sky is overcast, threatening rain, and pulling poor Darek behind you, you proceed at a run to a nearby farmhouse where you steal a horse. The farmer comes out of his house as you gallop away, shouting and waving his fists at your back.",
        "You reach Orlbar that evening, and deliver Darek to his grateful grandparents.",
        "“You shall be rewarded, brave champion,” Lord Brewmont promises, his eyes misting over. “On the morrow, I shall go to the Orlbar bank, and –“ You cut Lord Brewmont off, informing him that there is no time. You tell him that he must organize a caravan, and leave for Loudwater immediately, and you plead with him to trust your word.",
        "The Brewmonts leave for Loudwater that evening, with you and Lord Brewmont riding alongside, keeping watch. The journey takes several days, but finally you reach Loudwater With the Death Knight and the Blood Knight on your mind, your sleep is uneasy for weeks to come, haunted by visions. The Death Knight will haunt Orlbar once more… perhaps you will return one day and finish the job. But for now, you will be looking over your shoulder, keeping an eye on anyone in a robe… Now the Blood Knight has physical form, he will pursue you to the ends of the realm, and possibly beyond, with his army of cultists. It is time to disappear! You certainly didn’t want those fanatics following you to the village of Orlbar. That would have put all these poor folk in danger.",
        "So you resolve to deal with that danger when it presents itself.",
        "The Brewmonts pay you the promised 2000 gp, which is welcome, but it can’t relieve the weight on your mind. Poor Orlbar… no doubt the Death Knight will find another squire, in time."
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPOILSOFADVENTURE",
          "target": "SPOILSOFADVENTURE"
        }
      ]
    },
    "HEREWEGO": {
      "text": [
        "Suddenly you hear a rustling, movement off to the right side of the path. Suddenly, from the undergrowth, two GIANT WOLF SPIDERS appear! Seeing you in their territory, the rear up, hissing horribly, and launch themselves at you!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPIDERBATTLE.",
          "target": "SPIDERBATTLE"
        }
      ]
    },
    "HIDDENDANGER": {
      "text": [
        "You give the place a thorough visual search, but see nothing that looks suspicious."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "HIDEQUICK": {
      "text": [
        "You duck behind the boulder pile as fast as you can, just in time to see legs appearing through the hole.",
        "Make a stealth check, DC 14."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry INVISIBLE",
          "target": "INVISIBLE"
        },
        {
          "description": "If you are unsuccessful, go to entry SLOPPY",
          "target": "SLOPPY"
        }
      ]
    },
    "HISSANDABANG": {
      "text": [
        "At seeing your illusion, what you hoped to be an impressive diversion ends up serving as a source of comedy! The three rogues double over in fits of laughter.",
        "“Oh! Oh, that’s priceless!” the leader gasps between guffaws, holding his sides. “You are too funny my friend! Oh my…” Despite your embarassment, you think you see an opportunity, and try to slink away as the three are consumed by hilarity. However, the woman’s smile quickly disappears and she levels her blade at you, stopping you from escaping.",
        "Gradually they regain their composure.",
        "“Well, I’d like to say ‘good try’, but that would be lying,” the leader says. He motions with his head back towards the passage that leads to their lair. “That way,” he commands.",
        "You make what you think is a pretty thorough search, but cannot find any kind of booby trap on the chest."
      ],
      "nextSteps": [
        {
          "description": "Go to entry BLADEPOINT",
          "target": "BLADEPOINT"
        }
      ]
    },
    "HMMM": {
      "text": [
        "You make what you think is a pretty thorough search, but cannot find any kind of booby trap on the chest."
      ],
      "nextSteps": [
        {
          "description": "If you want to try and open the chest, go to PICKLOCK",
          "target": "PICKLOCK"
        },
        {
          "description": "If you would rather try something else, return to entry TOTHELIGHT and choose another option from the bottom of that entry",
          "target": "TOTHELIGHT"
        }
      ]
    },
    "HOLDBREATH": {
      "text": [
        "Roll 1d4 and take half that much poison damage, rounding down (max 2hp).",
        "You manage to close your mouth just in time, and get quickly out of the way of the noxious vapour stream. Coughing violently, you move and get out of the little space.",
        "You decide you will wait some time for the gas to clear. However, just as it becomes nearly safe to move back into the space, you hear something.",
        "Voices! Getting closer too, although you can’t tell from what direction.",
        "There is nowhere to hide in here, and no exit that you can see. Quickly and quietly you run out into the area just below the entrance hole, searching for somewhere to hide. The voices are getting louder, like they are approaching the entrance hole.",
        ""
      ],
      "nextSteps": [
        {
          "description": "There is a largish pile of boulders nearby. To hide behind these, go to entry HIDEQUICK",
          "target": "HIDEQUICK"
        },
        {
          "description": "To stand in the open and face whoever approaches (if they come down the hole that is) go to entry NOTAFRAID",
          "target": "NOTAFRAID"
        }
      ]
    },
    "HOLDTHATTHOUGHT": {
      "text": [
        "You take several steps up the path, then all of a sudden something bizarre happens. You are frozen, mid-step! Not frozen with cold, but paralyzed, from head to toe. One foot hovers in the air… it is if you have been stopped in time!",
        "Make a wisdom saving throw, DC 15."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to entry UNFROZEN",
          "target": "UNFROZEN"
        },
        {
          "description": "If you fail, go to entry PRESERVED",
          "target": "PRESERVED"
        }
      ]
    },
    "HUTTRAPS": {
      "text": [
        "You search all around the door frame, and the ground, but cannot find anything that looks like a trap here. Cautiously you put your hand on the door handle and quietly push down…"
      ],
      "nextSteps": [
        {
          "description": "Go to CABINENTRY",
          "target": "CABINENTRY"
        }
      ]
    },
    "IGNOREINSTINCTS": {
      "text": [
        "The sky darkens, and you hear a faint scream, followed by another crack of thunder, and then something like the neigh of a horse… if it is a horse, it is straight out of the depths of hell.",
        "Time has run out for poor Darek Brewmont!",
        "The Death Knight has found his squire, and you have failed in your quest!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "INDUCTED": {
      "text": [
        "Within the cabin there is a kind of burnt smell, like smouldering embers, and the room has only the most basic furniture. A table, a couple of chairs, a fireplace… Suddenly your heart stops. In the darkness, you see a figure, standing against one of the walls, completely silent, watching you. A tall figure, and dressed all in armour. As you watch, this figure begins to glow, red in the darkness, and you see that it is in fact a knight! A sinister-looking tower of a Knight, holding a huge greatsword that shimmers with an unearthly radiance.",
        "The Death Knight?",
        "Feeling a cold sweat break out on your brow, you feel for your weapon… No, that’s gone, as are all your supplies.",
        "“Do not bother searching for your equipment, mortal,” a voice booms… it must be the Knight’s although it seems to come from all around you rather than from his direction.",
        "“Listen mortal, and listen carefully!” the voice booms again. “I have a task for you.",
        "There is a knight who claims ownership over this forest, a warrior who, like myself, is not of this realmmmm…..” A chill travels up your spine. The voice is deep, booming, but hollow and devoid of life.",
        "At least now you know you’re not speaking to the Death Knight. Who could this be then?",
        "“My followers call me the Blood Night of Kiaransalee. I am a loyal follower of Kiaransalee, the Dark Goddess, Enemy of Lolth and Orcus, The Vengeful Banshee!” These names make your blood run cold. You had thought that the Cult of Kiaransalee was long dead. Their deeds are detailed in ancient histories, and they are responsible for numerous atrocities throughout the ages.",
        "“My followers and I will see the Mother return to her former power… and we have chosen this Wood of Weathercote as the point of her arrival. It is aligned with the unseen stars and the nodes of power that exist in this land… it is a small but potent place.",
        "“But this one who they call the Death Knight… He must die, mortal. And you have been chosen by the Goddess as the bringer of his demise!” Your spirits lift a little. Isn’t this your quest anyway? You are about to voice agreement when the Blood Knight adds, “And as reward, you will become my most exalted follower! My general, who shall stand beside me in glory as we return the Goddess Kiaransalee to her rightful place as ruler of this land!” This part, you are not so much in agreeance with. You are stunned into silence. The Blood Knight continues.",
        "“You must leave this place now.” He walks forward, taking a couple of massive steps towards you, and red sparks skitter out from his feet as he walks. “Do not be afraid mortal. I am Myrkbrood, made from the embers of the cremated dead. And this weapon is of the Myrk as well!” From some unseen place the Blood Knight produces a long sword, glowing with a red light, as if embers burn inside it. “This is known as a Sword of the Goddess’s Wrath.",
        "You will use it to slay the one known as the Death Knight! And then, return it to me before the dawn. If you refuse any part of this task, my followers will pursue you to the ends of the world! You shall live a cursed life, always looking over your shoulder. Are we in agreeance, mortal?” You take the sword in your hand. It pulsates with a volatile potency, and almost hurts to hold. The dark energy runs up your arm and you feel a little of it creep into your very soul.",
        "What is your response to the Blood Knight?"
      ],
      "nextSteps": [
        {
          "description": "“Hell yeah, sign me up!” Go to entry DARKQUEST",
          "target": "DARKQUEST"
        },
        {
          "description": "“Aaahhh yeah, the first part of what you say, I can do that. But the whole becoming your general thing… Not so sure.” Go to entry NEGOTIATE",
          "target": "NEGOTIATE"
        },
        {
          "description": "“Do you know what Blood Knight? Take your Sword of Whatever and stick it where the sun don’t shine!” Go to entry BALLSYMOVE",
          "target": "BALLSYMOVE"
        }
      ]
    },
    "INITWON": {
      "text": [
        "Make your attack! Basic stats for the Death Knight (relevant to this turn) are below. If you are playing with 2 PCs, do not double monster numbers for this encounter.",
        "Deduct any points if your surprise attack hit, and then roll your fresh attack. The Death Knight’s attacks and feats are not shown below.",
        "| |\n|-|\n| ****DEATH KNIGHT**** |\n| *Medium Undead, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 15 |\n| **Hit Points** 32 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 15 (+2) | 11 (+0) | 13 (+1) | 12 (+1) | 10 (+0) | 5 (-3) |",
        "| |\n|-|\n| **Saving Throws** Strength +2 |\n| **Damage Immunities** Poison |\n| **Condition Immunities** Poisoned, charmed, unconscious, frightened |\n| **Senses** Darkvision 60ft, Passive Perception 8 |\n| **Languages** Common |\n| **CR** 1 (200XP) |\n| **Turn Immunity** The Death Knight cannot be turned by any Turn Undead feat or spell. |"
      ],
      "nextSteps": [
        {
          "description": "Once you have completed your attack, go to KNIGHTATTACK",
          "target": "KNIGHTATTACK"
        }
      ]
    },
    "INSPECTALTAR": {
      "text": [
        "You walk up to the large bronze idol of Amaunator. It is exceptionally well made, and seems like it was just placed here yesterday. The metal gleams dully as you move around it. Then, as you move behind the altar, you see something small lying on the ground. A holy symbol of Amaunator! It is on a long, steel chain to be worn around the neck, and is in the image of a large effulgent sun with runes on the front. This perhaps belonged to a cleric, monk or paladin.",
        "Take the item if you wish, placing it into your backpack."
      ],
      "nextSteps": [
        {
          "description": "If you wish to inspect the room, go to entry EXPLOREROOM",
          "target": "EXPLOREROOM"
        },
        {
          "description": "If you are done here, and wish to leave, go to entry LEAVECHAMBER",
          "target": "LEAVECHAMBER"
        }
      ]
    },
    "INTHEKNOW": {
      "text": [
        "Quickly you reel off a couple of sentences in Thieves’ Cant. Something about honour among thieves… or the lack of it.",
        "“And what did you take from us?” the man replies in Thieves’ Cant also, advancing and sheathing his weapon, while the other two keep their crossbows trained on you. He searches you thoroughly, retrieving anything you had taken. (Adjust inventory).",
        "Standing, he smiles. “No harm done, stranger. I would have done the same at your age. Now, on your way!” Realizing you are getting off very lucky, you climb up towards the exit, crossbows following you the whole way, and are soon back above ground."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "INVESTIGATESPIDERS": {
      "text": [
        "You start to look around, searching the bush by the track and seeing if you can find anything – or anyone – the spiders may have stashed nearby.",
        "Just off the path, you find several dried up corpses, wrapped in old webs – the remains of a few hapless travellers. A quick look through the pockets of a dead orc turns up 21 copper pieces and a dagger. A further search of two human corpses produces a heavy crossbow and… jackpot! A bottle labelled “Potion of Healing”! You even recognize the script: it’s from a reputable dealer in Neverwinter who you have bought potions from before.",
        "You drop the items into your backpack and move back onto the path."
      ],
      "nextSteps": [
        {
          "description": "Go back to tilepage 2 and continue from the last direction you read.",
          "target": "TILEPAGE_2"
        }
      ]
    },
    "INVISIBLE": {
      "text": [
        "You crouch, well out of sight. The voices come near, talking in common.",
        "“…at the end of next week. How long did you say the journey was, Bradigan?” “That’s right, I forget you’ve never been to Neverwinter before, country boy! Well, about two weeks, but if we find horses we could cut that by half, and then….” The voices fade out once more. Gingerly you step out from behind the pile, and, carefully peering down the passage towards the abandoned mine, quietly scurry up and out of the hole. You hear curses behind you as you leave – they must have discovered your theft – but no-one follows. They must think that you were here hours ago, not that you are only just leaving!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read, making sure you leave the area quickly!",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "ISHALLPROCEED": {
      "text": [
        "You proceed into the passageway and make your way towards the bend."
      ],
      "nextSteps": [
        {
          "description": "Move your token to Sub-map 4 and follow the directions there",
          "target": "SUBMAP_4"
        }
      ]
    },
    "ITLLBEFINE": {
      "text": [
        "Keeping a careful watch, you proceed forward to the bend."
      ],
      "nextSteps": [
        {
          "description": "Go to entry DOGLEG",
          "target": "DOGLEG"
        }
      ]
    },
    "JUMPAWAY": {
      "text": [
        "Perhaps it was because you were so on edge, but you somehow manage to throw your body to the side just as the ground collapses beneath your feet. However, the pit isn’t that deep, only about three feet… You scramble out of the grave and back away quickly, brushing the dirt of the grave off yourself in horror."
      ],
      "nextSteps": [
        {
          "description": "Go to entry RISE",
          "target": "RISE"
        }
      ]
    },
    "JUMPESCAPE": {
      "text": [
        "Deduct one spell slot.",
        "Focusing on yourself, you chant the words of the spell and produce the materials from your pouch. You feel your legs change, a strange energy growing inside them. You feel as though you could jump above the forest canopy!",
        "Crouching down, you gather the energy inside you and, like a grasshopper, spring up into the air, well above the edge of the pit.",
        "You land easily on the path. Gathering your breath, you feel the energy slowly ebb out of your legs. That was a rush! Too bad you can’t travel everywhere like that!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "JUNCTIONTRAPS": {
      "text": [
        "Roll perception, DC9."
      ],
      "nextSteps": [
        {
          "description": "If successful, go to SAFEASHOUSES",
          "target": "SAFEASHOUSES"
        },
        {
          "description": "If unsuccessful, go to COASTCLEAR",
          "target": "COASTCLEAR"
        }
      ]
    },
    "KEEPGOING": {
      "text": [
        "It is late when you finally reach Weathercote Wood, some 55 miles east of Orlbar. There, on the wood’s edge, you camp and let your horse run free. You won’t be needing him for a while.",
        "Weathercote Wood is thick, the foliage dense, towering walls of green. And in there somewhere, if the information you have is to be trusted, is the boy Darek Brewmont.",
        "You settle down in your bedroll, the embers of your fire keeping you warm well into the night. After a full day’s riding it doesn’t take long for you to fall into a deep slumber, the sound of a nearby river lulling you to sleep.",
        "You wake just before dawn, fully rested. But a noise instantly puts you on guard; from somewhere nearby comes a wet, slavering sound. Quietly you pick up your weapon and move forward stealthily. When you are some hundred or so feet away, whatever is lurking catches your scent, and you hear it running quickly away. Only dim starlight shows any detail, and all you can see is a darkened shape moving through the night, towards the wood."
      ],
      "nextSteps": [
        {
          "description": "Do you have a ranged weapon? If so, and you wish to attack using it, go to entry SHOOTAFTER.",
          "target": "SHOOTAFTER"
        },
        {
          "description": "If not, go to entry DEADNELLY.",
          "target": "DEADNELLY"
        }
      ]
    },
    "KNIGHTATTACK": {
      "text": [
        "As he prepares to attack, the Death Knight pauses and smiles at you, a chilling sight to behold. Then, from his bony, decimated gut, a horrid laugh arises, filling the chamber and echoing all around. The air is laced with fear, and Darek Brewmont cowers into a corner, whimpering and covering his face.",
        "Make a wisdom save, DC 13, to see if the Death Knight’s fear aura affects you as well.",
        "If you fail the save, you take a -1 penalty to all attack rolls. This effect can be cancelled out by a successful wisdom save, made at the start of each of your turns (except the next one). If you have Grakspores, eat them now!",
        "Then, still laughing, he lashes out at you with his longsword!",
        "Roll a d20, adding 5. If the result is higher than your AC, roll damage (1d8+3)"
      ],
      "nextSteps": [
        {
          "description": "Then go to entry TOSSER",
          "target": "TOSSER"
        }
      ]
    },
    "KNOCKPINS": {
      "text": [
        "Your ranged attack hits! Roll damage. If the damage roll is 13 or higher, go to STRIKE.",
        "If it is lower than 13, the skeleton flees out of range, disappearing into the woods."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "KOBOLDBATTLE": {
      "text": [
        "Roll 1d8 and place three tokens on the map that many squares from you to represent the kobolds. There are two warriors and what looks like a fire-wielding mage! Attack them in whatever order you see fit. Roll initiative and do battle! For speed of play, it is recommended that you roll once for the Kobold’s initiative (d20+2) and give them all their three attacks on their turn.",
        "| |\n|-|\n| ****KOBOLDS**** |\n| *Small Humanoid, Lawful Evil* |",
        "| |\n|-|\n| **Armour Class** 12 |\n| **Hit Points** 5 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 7 (-2) | 15 (+2) | 9 (-1) | 8 (-1) | 7 (-2) | 8 (-1) |",
        "| |\n|-|\n| **Senses** Darkvision 60ft, Passive Perception 8 |\n| **Skills** Perception +3, Stealth +7 |\n| **Languages** Common, Draconic |\n| **CR** 1/8 (25 XP each) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Dagger** Melee attack, +4 to hit, Reach 5ft. Hit 4 (1d4+2) piercing damage |\n| **Mage Fireball** Ranged attack, +2 to hit, Range 60ft. Hit 3 (1d6) fire damage |"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to entry DEADLIZARDS",
          "target": "DEADLIZARDS"
        },
        {
          "description": "If you are defeated, go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "LEAVECAVE": {
      "text": [
        "Mindful of the time, you leave the little alcove, moving quickly, and make to leave the abandoned mine.",
        "Status check: How many things did you do while in the alcove?"
      ],
      "nextSteps": [
        {
          "description": "Did you do any two things from the following list: check the scrolls for clues / try to open the chest / read the strange markings. If you did do two from this list, go to entry DILLYDALLY",
          "target": "DILLYDALLY"
        },
        {
          "description": "If you only did one thing, or if you did none of these things, then you return to the surface. Go to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "LEAVECAVERN": {
      "text": [
        "You move back down through the tunnel and out to the river. With your knowledge of the dangerous sections of the river, you are now able to quickly return to the other shore without too much trouble."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "LEAVECEMETERY": {
      "text": [
        "As you turn your back on the crypt and wander back the way you came, you notice the sun in the sky, getting lower. It is barely minutes since you left the junction – isn’t it?",
        "It seems time has a mind of its own in Weathercote Wood. You wonder if it is too late for the boy Darek Brewmont? Perhaps he has already been made squire to the ghostly Death Knight, and you are too late!",
        "Clouds darken the sky, and a strange feeling enters the pit of your stomach. Your instinct for adventure speaks to you, and you can’t help feeling that your true path lies behind you, within that crypt."
      ],
      "nextSteps": [
        {
          "description": "If you still wish to leave the cemetery, go to entry EASYPATH",
          "target": "EASYPATH"
        },
        {
          "description": "If you decide to turn back and make your way through the cemetery towards the crypt, go to entry SOFTLY",
          "target": "SOFTLY"
        }
      ]
    },
    "LEAVECHAMBER": {
      "text": [
        "You climb the stairs leading up from the chamber, back towards the dim light of Weathercote Wood.",
        "Soon you are back outside the great stone double doors that led down to the underground temple."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "LEAVES": {
      "text": [
        "You collect several handfuls of the blood-red leaves. They have a pleasant smell, and with a bit of experimentation could possibly be used to make a tea of some kind… The tea might even be beneficial in some way, there is no way of telling!",
        "Add ‘Red tree leaves’ to your inventory."
      ],
      "nextSteps": [
        {
          "description": "To cast Detect Magic on the tree, go to MAGICTREE",
          "target": "MAGICTREE"
        },
        {
          "description": "To take a branch from the tree, go to TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "To return to the path, go to REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "LIKELYCAMP": {
      "text": [
        "You can see two potential camp areas, just off the track, one on the northwest corner of the junction and one on the northeast corner.",
        "You feel absolutely dog tired, in your bones, and know that if you don’t rest now, the rest of your mission could become increasingly difficult. You need to make camp and try to get some much-earned rest."
      ],
      "nextSteps": [
        {
          "description": "To make your camp in the northeast corner of the junction, go to NORTHEASTCAMP",
          "target": "NORTHEASTCAMP"
        },
        {
          "description": "To make your camp in the northwest corner, go to CAMPNORTHWEST",
          "target": "CAMPNORTHWEST"
        },
        {
          "description": "To continue, despite your fatigue, return to the tilepage 8 entry and continue from the last direction you read.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "LITTLEHUT": {
      "text": [
        "You approach the little hut that sits to the side of the forest path. It is well made, if a little dilapidated, and covered in vines and creepers.",
        "Cautiously you approach the door, and slowly reach for the handle… Do you want to check for traps? Roll perception, DC 15"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry HUTTRAPS",
          "target": "HUTTRAPS"
        },
        {
          "description": "If you are unsuccessful, go to entry WELLDAMN",
          "target": "WELLDAMN"
        }
      ]
    },
    "LOOKRUBBLE": {
      "text": [
        "You move over to the altar and check out the rubble. It becomes obvious quite quickly from looking at these fragments, that a holy idol of some sort once stood here. It has been destroyed.",
        "Wondering what this could mean (or perhaps you already know) you continue to the exit on the far side."
      ],
      "nextSteps": [
        {
          "description": "Go to entry TUNNELVISION",
          "target": "TUNNELVISION"
        }
      ]
    },
    "LOOKSFINE": {
      "text": [
        "As far as you can see, there is nothing here that looks suspicious."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "LUCKYCRITTERS": {
      "text": [
        "You hear a horrid screeching sound. From the undergrowth, two GIANT WOLF SPIDERS appear, hissing ferociously. They move to attack, clicking their pincers menacingly. Your spell has hurt them somewhat, but they still have plenty of fight left!"
      ],
      "nextSteps": [
        {
          "description": "Roll 2d8 and half the result. Go to entry SPIDERBATTLE and commence combat, deducting that number from each spider’s HP.",
          "target": "HP"
        }
      ]
    },
    "LUCKYDODGE": {
      "text": [
        "Just in time you jump out of the way, and the grey beam hits a tree behind you. In horror you turn to see an energy spreading through it, turning it completely to stone, from trunk to branches to leaves.",
        "Wasting no more time, you pick yourself up and run for all you’re worth!",
        "Behind you, you hear the stranger call, “Oh come on! I didn’t mean it! Come back, talk to me some more.” You keep running, putting as much distance between you and this lunatic as possible!"
      ],
      "nextSteps": [
        {
          "description": "Move to the edge of the tilepage and onto tilepage 6 immediately!",
          "target": "TILEPAGE_6"
        },
        {
          "description": "Move to the edge of the tilepage and onto tilepage 8 immediately!",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "MADEIT": {
      "text": [
        "Quickly you work, carving steps efficiently until there are enough footholes that you can climb out. Further up the path, you see a hooded figure come into view. At the site of you, the figure stops in their tracks, throwing their hood back. It is a woman, and she does not look pleased.",
        "“Wha – How did you get out?” she exclaims, infuriated at the fact that you have escaped her trap. Without another word, she angrily takes out a crossbow and begins loading a bolt."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CULTISTCOMBAT",
          "target": "CULTISTCOMBAT"
        }
      ]
    },
    "MAGICDIVERSION": {
      "text": [
        "Focusing, you create the most impressive illusion that you can muster, and prepare to run!",
        "Roll a d20, subtracting one of the modifiers listed below, based on the spell cast:",
        "Thaumaturgy -5",
        "Minor Illusion -4",
        "Silent Image -3",
        "Prestidigitation -1",
        "Druidcraft No modifier"
      ],
      "nextSteps": [
        {
          "description": "If the result is lower than your spell save DC, go to entry SMOKEANDMIRRORS",
          "target": "SMOKEANDMIRRORS"
        },
        {
          "description": "If the result is higher than your spell save DC, go to HISSANDABANG",
          "target": "HISSANDABANG"
        }
      ]
    },
    "MAGICTREE": {
      "text": [
        "Deduct one spell slot.",
        "You close your eyes and intone the spell, trying to discern the nature of this tree, and if it has any magic potency.",
        "After some time, you discern that there is a kind of magic emanating from it… a wild magic. Although it is impossible to discover the exact nature of that magic, you feel that it is definitely benevolent, and very potent too."
      ],
      "nextSteps": [
        {
          "description": "To take a branch from the tree, go to TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "To climb the tree, go to TREECLIMB",
          "target": "TREECLIMB"
        },
        {
          "description": "To return to the path, go to REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "MASTERTHIEF": {
      "text": [
        "You pry the lid of the chest open finally, and look expectantly within… There is a large amount of semi-precious jewellery and some small art pieces, all of which looks to be worth just under 200gp total value. There is also a large pouch containing what appears to be about 350 gp.",
        "But then your eyes fall on it… a purplish bottle, very ornate, with a stopper in the shape of a dragon’s head. You lift the lid off and give it a quick sniff, instantly recognizing it as a healing potion, a very potent one at that!",
        "This is a Potion of Greater Healing.",
        "You also find a strange set of goggles, which you immediately put on.",
        "These are Goggles of Night. If you have darkvision, you suddenly notice you can see an extra long distance, 60 extra feet! If you don’t, you notice that you now have 60ft darkvision.",
        "Great finds, all told! You quickly transfer the treasure into your pack, chuckling to yourself at the carelessness of these foolish thieves."
      ],
      "nextSteps": [
        {
          "description": "To search the pile of books and scrolls for clues, go to SEARCHCLUES",
          "target": "SEARCHCLUES"
        },
        {
          "description": "To leave this thieves’ lair, go to entry LEAVECAVE",
          "target": "LEAVECAVE"
        }
      ]
    },
    "MAUSOLEUM": {
      "text": [
        "This room is silent, and smells of decay. The four coffins are well kept though, and don’t look especially old. The wood is of a high quality and amongst the musty smell there is also the aroma of laquer in the air, a sure sign of wealth. Whoever this dead family was, they were not short a gold piece or two.",
        "The exit on the far side leads into an open passage that continues and then bends right."
      ],
      "nextSteps": [
        {
          "description": "To open one of the coffins, go to entry OPENCOFFIN",
          "target": "OPENCOFFIN"
        },
        {
          "description": "To proceed to the exit, go to ISHALLPROCEED",
          "target": "ISHALLPROCEED"
        }
      ]
    },
    "MCSTEALTH": {
      "text": [
        "The mage hand moves in amongst the webs and begins trying to gather the gossamer strands onto its fingers… but no luck. It does not have the power to shift these threads, which are quite strong despite their thinness."
      ],
      "nextSteps": [
        {
          "description": "Go to entry HEREWEGO",
          "target": "HEREWEGO"
        }
      ]
    },
    "MIDNIGHTSNACK": {
      "text": [
        "In the very early hours of the morning you awake, feeling well rested (recover 1 hit die immediately) but also experiencing a strange sensation on your neck. You reach up to rub it, and your hand feels something leathery, which moves under your hand!",
        "Your eyes fly open and you realize a bat has appended itself to you, and you have disturbed it during its meal – its meal being you! (deduct 1 piercing damage) The horrible thing screeches as you swat it away, and then flaps into the air and attacks you!",
        "Place its token within melee range, roll initiative and do battle! Should be quick.",
        "| |\n|-|\n| ****FOREST BAT**** |\n| *Medium Beast, Unaligned* |",
        "| |\n|-|\n| **Armour Class** 12 |\n| **Hit Points** 5 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 7 (-2) | 15 (+2) | 8 (-1) | 2 (-4) | 12 (+1) | 4 (-3) |",
        "| |\n|-|\n| **Senses** Blindsight 60 ft., Passive Perception 11 |\n| **CR** 1/8 (25 XP) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Bite** +0 Weapon Attack, Reach 5ft, one creature. Hit 2 (1d4) piercing |"
      ],
      "nextSteps": [
        {
          "description": "If you defeat the bat, go to SLEEPRUINED",
          "target": "SLEEPRUINED"
        },
        {
          "description": "If you are defeated, go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "MIKADUS": {
      "text": [
        "You are at the top, east-west section of the path when you hear something that sounds ridiculously out of place in these ominous woods: singing!",
        "Indeed, you hear someone enthusiastically belting out a joyous song, accompanied by the sounds of rattling, as of a horse laden with goods. You stand still and watch the path ahead.",
        "There, around the corner, comes not a horse, but a pony laden with a multitude of bags, pots, all manner of items. The poor thing looks like it is about to collapse! Walking alongside it is a halfling, a merchant by the looks, in colourful clothes, the source of the jaunty tune. Seeing you, he keeps singing but a wide smile now spreads across his face.",
        "As he nears, you see he is accompanied by a smaller creature, a humanoid of some description, the likes of which you have never seen before. Its skin looks like bone.",
        "The merchant finishes his verse just as he comes before you, and he greets you with an elaborate bow, twirling his hand as he bends low.",
        "“Grrretings, fellow traveller! And salutations on this lovely, balmy evening.” The merchant stands up straight, still grinning.",
        "“Allow me to introduce myself. My name is Mikadus Fairweather of Zelbross, and I can’t help thinking destiny has caused us to meet in this beautiful wood!” Despite the randomness of this encounter, you can’t help but feel pleased to meet a friendly face in this forbidding, gloomy wood.",
        "With a grand, sweeping gesture, Mikadus indicates the wares that his poor beast of burden is laden with.",
        "“And what can I offer such a prosperous traveller as yourself? Domnic! Get busy!” At this hissed command, Mikadus’ assistant, the tawny-coloured humanoid, whose exterior seems to consist of some sort of exoskeleton, starts taking out various wares and parading them before your eyes.",
        "“Provisions, my friend? Useful for those long journeys. I have incense, holy water, healing potions, holy symbols, sheet notation for the musically-minded, all the latest songs from Neverwinter, religious icons…” The list goes on and on! It seems this Mikadus is a literal travelling market.",
        "Nonetheless, despite all the junk that you couldn’t care less for, there are a few things that sound interesting.",
        "The following is a list of items you could purchase from Mikadus:",
        "Healing Potion (standard) – 50 gp (he has two of these)",
        "Holy Symbol – 20 gp",
        "Holy water – 25 gp (one flask)",
        "Provisions – 5 gp for a week’s worth",
        "Backpack – 2gp",
        "Tinderbox – 1 gp",
        "Rope (50ft) – 1gp",
        "Torch – 1gp"
      ],
      "nextSteps": [
        {
          "description": "When you are done with the travelling merchant, go to entry FRIENDLYCHAP",
          "target": "FRIENDLYCHAP"
        }
      ]
    },
    "MISS": {
      "text": [
        "You watch the black shape scurry away, back into the cover of Weathercote Wood, and curse your poor aim. Then you walk forward to where the creature had been before you startled it and sent it running for the trees."
      ],
      "nextSteps": [
        {
          "description": "Go to entry DEADNELLY",
          "target": "DEADNELLY"
        }
      ]
    },
    "MORETRAPS": {
      "text": [
        "Roll perception, DC 18"
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry PATHDANGER",
          "target": "PATHDANGER"
        },
        {
          "description": "If you are unsuccessful, go to SEEMSNOT",
          "target": "SEEMSNOT"
        }
      ]
    },
    "MOSSYLOG": {
      "text": [
        "You walk up to the moss-covered log, and as you near it you see that it is covered with fungi, bright green mushrooms. You are not sure if you have seen their kind before. Their colour almost seems phosphorescent, like they would glow even at night!",
        "Make a survival roll, DC 12."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to FUNKYFUNGI",
          "target": "FUNKYFUNGI"
        },
        {
          "description": "If you fail, go to MUNGUSFUNGUS",
          "target": "MUNGUSFUNGUS"
        }
      ]
    },
    "MOVEWITHIN": {
      "text": [
        "You move further within, down the silent passage, the sound of the river fading behind you. The passage turns to the right and continues for some way. Ahead you can see it opens into a cavern."
      ],
      "nextSteps": [
        {
          "description": "Go to sub-map 2 and follow the directions there",
          "target": "SUBMAP_2"
        }
      ]
    },
    "MUNGUSFUNGUS": {
      "text": [
        "Try as you might, you can’t seem to recall whether this fungi is poisonous or not. You consider eating a small amount, but have heard stories of very dangerous mushrooms in these parts, and think better of it."
      ],
      "nextSteps": [
        {
          "description": "Add the green fungi to your inventory if you wish, and then return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "NASTYBITE": {
      "text": [
        "A GIANT CENTIPEDE has dug its pincers into your hand, drawing blood, the ghastly thing!"
      ],
      "nextSteps": [
        {
          "description": "Roll 1d4+2 and subtract the damage from your HP. Then go to entry CENTIBATTLE",
          "target": "CENTIBATTLE"
        }
      ]
    },
    "NASTYTURN": {
      "text": [
        "Roll a d100, adding 10 if you succeeded in an earlier stealth test on this tilepage."
      ],
      "nextSteps": [
        {
          "description": "If you score 1-25, go to PESKY",
          "target": "PESKY"
        },
        {
          "description": "If you score 26-50, go to WHATSTHIS",
          "target": "WHATSTHIS"
        },
        {
          "description": "If you score 51 or above go to NOTAWHISPER",
          "target": "NOTAWHISPER"
        }
      ]
    },
    "NEGOTIATE": {
      "text": [
        "The Blood Knight’s roar fills the room. “You will accept this quest, or you will die as all mortal flesh dies, on the end of my sword!” He brings his greatsword underneath your chin. You try to move, but you are frozen on the spot, as if by magic. You don’t doubt his words, and you are unarmed. It seems you have little choice."
      ],
      "nextSteps": [
        {
          "description": "If you still voice your disapproval, go to NOFEAR",
          "target": "NOFEAR"
        },
        {
          "description": "If you bow to this intimidating warrior and accept his quest, go to DARKQUEST",
          "target": "DARKQUEST"
        }
      ]
    },
    "NETESCAPE": {
      "text": [
        "Quickly you manage to extract yourself from the net, kicking the goblins away as you do so."
      ],
      "nextSteps": [
        {
          "description": "Go to GOBLINBATTLE",
          "target": "GOBLINBATTLE"
        }
      ]
    },
    "NICECAMP": {
      "text": [
        "You make a small camp just off the path and take out your bedroll, making a bivouac that hides your presence well. Bedding down, you soon fall into a deep sleep, filled with many strange dreams… spectral nights stalk the forest, the blades keen and eager… you imagine yourself hidden from them, then you pounce out and stab one in the back, rip his helmet off… but it is the face of a young boy.",
        "(Despite your troubled dreams, you sleep well and may recover one hit die). In the morning you break camp and head back out to the forest path."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "NIGHTCRITTERS": {
      "text": [
        "You make camp just a little off the road, but whether it is because you are tired, or simply careless, your camoflauge skills don’t work so well… Your sleep is disturbed several times by animals gnawing at your tent, and once some small creature even tries to make a meal out of your left foot!",
        "You sleep reasonably well, but don’t regain much energy. Recover half a hit die. Cursing the pesky critters, you break camp and make your way back out to the path."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "NIGHTNIGHT": {
      "text": [
        "You awake in the early hours of the morning, feeling very refreshed.",
        "Recover 1 hit die (see the 5e rules on resting if you are not familiar with how this works).",
        "You make your way back out to the pathway and consider which path to take."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction your read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "NIMBLEFINGERS": {
      "text": [
        "You get out your thieves’ tools and proceed to carefully work on the mechanism, trying to disable whatever carnage it was designed to inflict on you.",
        "Make a thieves’ tools check (dexterity check), DC 14. If you are proficient with thieves’ tools, you can add your proficiency bonus to the dexterity check involved."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to entry HARMLESS",
          "target": "HARMLESS"
        },
        {
          "description": "If you fail go to entry TRIGGERED",
          "target": "TRIGGERED"
        }
      ]
    },
    "NINELIVES": {
      "text": [
        "You succeed in finally making it to the far shore, coughing up water as you drag yourself onto the bank.",
        "Deduct 2 hp for your struggles!",
        "If you let it go, erase your backpack and everything kept within it, including your provisions, from your inventory (but not your weapons). If you managed to keep it, then erase just your provisions as they are ruined from the water.",
        "After some time you get your breath back and then finally gather enough energy to make your way back upstream to the cave. A chilly breeze seems to be coming from within the cave, and a strange smell also… kind of like mouldy rot."
      ],
      "nextSteps": [
        {
          "description": "To enter the cave, got to entry ENTERCAVE",
          "target": "ENTERCAVE"
        }
      ]
    },
    "NOFEAR": {
      "text": [
        "The Blood Knight keeps his blade levelled at your chin, malice seeping from every inch of his ruined, infernal body. You try to move again, but are completely unable to. It seems you are held there with some sort of spell.",
        "You have heard of the Myrkbrood before, but to actually be faced with one – that is another thing entirely.",
        "“You seem devoid of fear, traveller,” the Blood Knight growls. “Do I not intimidate you? I am impressed. Such a soul as you will make a perfect general. Now BOW, or DIE LIKE A DOG!”"
      ],
      "nextSteps": [
        {
          "description": "Do you bow, and accept the quest? If so, go to DARKQUEST",
          "target": "DARKQUEST"
        },
        {
          "description": "Or do you still resist? Go to RESIST",
          "target": "RESIST"
        }
      ]
    },
    "NOOBTHIEF": {
      "text": [
        "Carefully you work with your tools, trying to dismantle the catch mechanism. But your hands are a little shaky, and you slip, accidentally knocking what looks like the trigger!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry VAPOUR (perform the save there with advantage, as you are expecting it)",
          "target": "VAPOUR"
        }
      ]
    },
    "NOREDSTAKE": {
      "text": [
        "Looking back at the corpse of the Death Knight, you see the hand twitch, just slightly. You have heard of such things before. This Death Knight cannot be killed, at least not by ordinary means!",
        "Quickly you move over to Darek Brewmont and grab him by the arm.",
        "“Let’s go,” you command, and pull him to his feet. Both of you run from the chamber, leaving the crypt and the cemetery behind."
      ],
      "nextSteps": [
        {
          "description": "Go to entry PURSUED",
          "target": "PURSUED"
        }
      ]
    },
    "NOROOMTRAPS": {
      "text": [
        "You see no traps in here."
      ],
      "nextSteps": [
        {
          "description": "Go to entry MAUSOLEUM",
          "target": "MAUSOLEUM"
        }
      ]
    },
    "NORTHEASTCAMP": {
      "text": [
        "To the northeast is a large hollow tree trunk.",
        "You unfurl your bedroll inside it.",
        "Take this opportunity to eat provisions. If you cannot, you should be able to last another day without feeling the effects of exhaustion.",
        "You lie down and quickly fall asleep to the gentle sound of wind whispering through the canopy."
      ],
      "nextSteps": [
        {
          "description": "Go to entry NIGHTNIGHT",
          "target": "NIGHTNIGHT"
        }
      ]
    },
    "NOTAFRAID": {
      "text": [
        "You draw your weapon and stand your ground, even as you see legs appear through the hole.",
        "Three darkly-clad characters drop to the ground before you: an older man, a woman, and a teenaged boy. They all wear hooded cloaks, and their weapons are out also.",
        "“Really, traveller?” the old man says.",
        "“Think you can win against the three of us?",
        "Face it, you’re outnumbered. Throw down your weapon.” You realize he is right. You are covered on all sides, and their stance tells you they are accomplished warriors. Perhaps you could get an attack or two in, but you would fall quickly. Even a fool could see that."
      ],
      "nextSteps": [
        {
          "description": "Are you a rogue? If so, go to INTHEKNOW",
          "target": "INTHEKNOW"
        },
        {
          "description": "Do you know any of the following spells: Druidcraft, Prestidigitation, Thaumaturgy, Minor Illusion, Silent Image? If so, you could cast one of these by going to MAGICDIVERSION",
          "target": "MAGICDIVERSION"
        },
        {
          "description": "If not, you could throw down your weapon? Go to entry SURRENDER",
          "target": "SURRENDER"
        },
        {
          "description": "Or, you could attempt to talk your way out of this situation. Go to entry CHARMTHEPANTS",
          "target": "CHARMTHEPANTS"
        }
      ]
    },
    "NOTAWHISPER": {
      "text": [
        "You move cautiously along the path, watching on all sides for movement, or anything out of the ordinary. But this part of the wood seems unusually quiet.",
        "The path turns right, then back towards the north again. Ahead, you see that the path continues… is that a junction up ahead?"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "NOTBAD": {
      "text": [
        "You search around the various nooks and crannies, and finally your search turns up something that may be of use; a quarterstaff!",
        "You pick it up and it feels light, easy to wield. You give it a couple of swings and it seems to almost be aiding your technique.",
        "There is something to this weapon. You’ve used staves before, but this is certainly the best of its kind you’ve ever handled. Indeed, you think it might be imbued with magic of some kind.",
        "Add a Quarterstaff+1 to your inventory, if you so wish! Nice find!",
        "Inspired by this find, you think to yourself there must be more to find around here. You see an item within an alcove, and reach in to grab it. But as you do, something lashes out at your hand!"
      ],
      "nextSteps": [
        {
          "description": "Roll 1d20 +4. If the result is higher than your AC, go to entry NASTYBITE.",
          "target": "NASTYBITE"
        },
        {
          "description": "If it is lower, go to entry BITEME",
          "target": "BITEME"
        }
      ]
    },
    "NOTRAPS": {
      "text": [
        "You move forward cautiously, primed for any motion, searching for any clues. But the wood is quiet; only the wind rustles the trees, and a few birds flit overhead in the canopy.",
        "Whatever awaits you in Weathercote Wood lies further within its depths!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 1 and continue from the last direction you read.",
          "target": "TILEPAGE_1"
        }
      ]
    },
    "NOTTURNED": {
      "text": [
        "The skeleton crouches and hisses at you, a ragged, guttural sound at the back of its throat. It appears your attempt to turn the undead creature has failed! It brandishes its weapon and you and advances, one limping step at a time."
      ],
      "nextSteps": [
        {
          "description": "Go to entry SKELETONBATTLE",
          "target": "SKELETONBATTLE"
        }
      ]
    },
    "OBVIOUS": {
      "text": [
        "Apart from the webs, you see no evidence of any traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 2 and continue from the last direction you read.",
          "target": "TILEPAGE_2"
        }
      ]
    },
    "OHDEAR": {
      "text": [
        "You make a few attempts to pull yourself up into the red tree’s branches, but try as you might you just can’t get yourself up there!",
        "Athletic feats were never your strong suit, you tell yourself.",
        "(continued across…) What would you like to do now?"
      ],
      "nextSteps": [
        {
          "description": "To take a branch from the red tree, go to TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "To go back to the path, go to entry REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "OHNO": {
      "text": [
        "The mage hand moves in amongst the webs and begins trying to gather the gossamer strands onto its fingers… but no luck. It does not have the power to shift these threads, which are quite strong despite their thinness.",
        "Suddenly, you feel something pounce on you from behind! Your noisy progress through the forest must have alerted it to your presence. You turn frantically, trying to get the thing off, whatever it is.",
        "Roll a d20+3. If the result is higher than your AC, go to entry SURPRISECRAWLY.",
        "If not, read on below.",
        "You manage to get the thing off your shoulder, and can now have a good look at it.",
        "A GIANT WOLF SPIDER is before you, hissing horribly. It is quickly joined by a mate, and they both attack you!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPIDERBATTLE.",
          "target": "SPIDERBATTLE"
        }
      ]
    },
    "OHWELL": {
      "text": [
        "Here endeth your adventure.",
        "But this doesn’t have to be the end. Why not take another stab at this? Go and roll up a fresh PC, and try again! There might be other things unexplored in this adventure, and surely Darek Brewmont deserves a second chance? Thankyou for playing The Death Knight’s Squire!"
      ],
      "nextSteps": []
    },
    "OOPS": {
      "text": [
        "Suddenly, as you walk, you feel the ground start to give way under your feet. Too late you realize and try to roll away, but the forest path drops under you."
      ],
      "nextSteps": [
        {
          "description": "Go to entry AMBUSH",
          "target": "AMBUSH"
        }
      ]
    },
    "OPENCHEST": {
      "text": [
        "Are you checking this chest for traps?"
      ],
      "nextSteps": [
        {
          "description": "If you do check for traps, go to entry CHESTTRAPS",
          "target": "CHESTTRAPS"
        },
        {
          "description": "If you are simply opening it, you will need thieves’ tools. Continue to entry USETOOLS",
          "target": "USETOOLS"
        },
        {
          "description": "If you do not have thieves’ tools, you may search for clues amongst the pile of books. Go to entry SEARCHCLUES",
          "target": "SEARCHCLUES"
        },
        {
          "description": "If you are done here, then you may leave the cave by going to entry LEAVECAVE",
          "target": "LEAVECAVE"
        }
      ]
    },
    "OPENCOFFIN": {
      "text": [
        "You try to lift one of the coffin lids, but they are nailed securely in place."
      ],
      "nextSteps": [
        {
          "description": "There is little left to do but proceed to the exit on the far side of the room. Go to ISHALLPROCEED",
          "target": "ISHALLPROCEED"
        }
      ]
    },
    "OPENSTONEDOOR": {
      "text": [
        "You grasp the metal ring and pull outwards.",
        "As you do this you hear an audible ‘click’ and then a ‘ffft!’ sound."
      ],
      "nextSteps": [
        {
          "description": "Go to entry TRIGGERED.",
          "target": "TRIGGERED"
        }
      ]
    },
    "OVERKILL": {
      "text": [
        "As the dust settles, you look around. Just off the path, the corpses of two GIANT WOLF SPIDERS lie, lifeless, destroyed by your spell!",
        "You destroy the rest of the webs, and then assess the situation."
      ],
      "nextSteps": [
        {
          "description": "To have a look around, go to entry INVESTIGATESPIDERS.",
          "target": "INVESTIGATESPIDERS"
        },
        {
          "description": "To keep going, go back to tilepage 2 and continue from the last direction you read.",
          "target": "TILEPAGE_2"
        }
      ]
    },
    "PADDLEHARD": {
      "text": [
        "Make another athletics check, DC 13 this time."
      ],
      "nextSteps": [
        {
          "description": "If you are successful go to entry WHEW",
          "target": "WHEW"
        },
        {
          "description": "If you are unsuccessful go to entry FLAILING",
          "target": "FLAILING"
        }
      ]
    },
    "PALADINTREE": {
      "text": [
        "Standing near the tree, you hear a kind of music, ringing in your ears, and you are overwhelmed by a sense of powerful, holy good emanating from the tree. You have felt the presence of evil, and of undead before.",
        "This tree seems to possess energy in direct opposition to that. Your eyes go wide with the pure joy of being in its presence. Who knows where this tree came from? Perhaps it was planted by the immortal progenitors of this land? Whatever the case, you know it has great potency."
      ],
      "nextSteps": [
        {
          "description": "To take a branch from the tree, go to TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "To take some leaves from this tree, go to LEAVES",
          "target": "LEAVES"
        },
        {
          "description": "To climb the tree, go to TREECLIMB",
          "target": "TREECLIMB"
        },
        {
          "description": "To return to the path, go to REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "PASSAGETRAPS": {
      "text": [
        "You search thoroughly, and to your great surprise, and relief, find some suspiciouslooking slits in the walls. A further search reveals a pressure plate in the floor. This looks like it could be a blade trap of some sort!",
        "Carefully you sidle past the pressure plate and move past it towards the room beyond, which you can now see at the end of the passage."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CIRCULARROOM",
          "target": "CIRCULARROOM"
        }
      ]
    },
    "PATHDANGER": {
      "text": [
        "You have a good look around this part of the path, visually searching the ground and the trees, looking for any sign of a trap.",
        "And that’s exactly what you find.",
        "Etched into the trunk of one tree on the east side of the path, so well hidden that it could be easily missed, you see a rune of some sort. You’re not entirely unfamiliar with this sort of thing. A sorcerer friend of yours gave you a long lecture on these once. They are known as glyphs, and they trigger magical effects when someone comes near them.",
        "You duck behind a tree and peer out, examining it from a distance. How are you going to get past this?"
      ],
      "nextSteps": [
        {
          "description": "If you want to go off the path and pass the tree on the right hand side, go to entry GOAROUND",
          "target": "GOAROUND"
        },
        {
          "description": "If you want to drop to the ground and go under the level of the glyph, go to DUCKUNDER",
          "target": "DUCKUNDER"
        },
        {
          "description": "You could backtrack to tilepage 3 if that is wherever you came from and move your token onto the top square",
          "target": "TILEPAGE_3"
        },
        {
          "description": "You could backtrack to tilepage 9 if that is wherever you came from and move your token onto the bottom square",
          "target": "TILEPAGE_9"
        },
        {
          "description": "If you want to ignore the glyph and continue north, go to entry WHATAWAITS",
          "target": "WHATAWAITS"
        },
        {
          "description": "The entrance to the house is closer on the path than the glyph. To visit the house without walking past the glyph, go to entry LITTLEHUT",
          "target": "LITTLEHUT"
        }
      ]
    },
    "PAYTOLL": {
      "text": [
        "You hold the Kobold’s gaze for a moment longer than is comfortable, then reach into your pouch and produce five gold, tossing it to the ground at the kobolds’ feet. You are reluctant to pay this toll, but you are also mindful that bigger battles may lie ahead.",
        "You leave the three kobolds scrabbling for coins in the dust, and make your way north."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "PEPPERWOOD": {
      "text": [
        "You speak the word given to you by Plumeria, and all of a sudden hear a great noise, like a crack, coming from the area of the Death Knight’s throne!",
        "The brazier, which previously emitted a bluish light, is now dull, and a sphere of blue light is flying through the air towards the Death Knight’s head. Already weakened by your attack, he does not see the blue sphere until it is too late! It catches him full in the head, and drops him to the ground, dead!",
        "A small figure flutters to the ground next to where you are lying, and through the haze of near-death you see a tiny hand waving circles before your eyes. A tiny voice says, “Thankyou,” and you fall into a sleep, a deep slumber, full of peaceful visions.",
        "Waking later, how much later you have no way of telling, you feel mostly restored. You glance over and see the boy Darek Brewmont also asleep. Getting him up, you cut free any bonds that remain with your blade, and get him to his feet.",
        "Do you possess a Red Tree Stake?"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry STAKEDRIVE",
          "target": "STAKEDRIVE"
        },
        {
          "description": "If not, go to entry NOREDSTAKE",
          "target": "NOREDSTAKE"
        }
      ]
    },
    "PERCEPTIONLESS": {
      "text": [
        "You see no traps in here."
      ],
      "nextSteps": [
        {
          "description": "Go to entry MAUSOLEUM",
          "target": "MAUSOLEUM"
        }
      ]
    },
    "PESKY": {
      "text": [
        "What is your passive perception?"
      ],
      "nextSteps": [
        {
          "description": "If it is 15 or above, go to entry WISETOYOU",
          "target": "WISETOYOU"
        },
        {
          "description": "If it is 14 or below, go to entry GOTTHEDROP",
          "target": "GOTTHEDROP"
        }
      ]
    },
    "PHANTASM": {
      "text": [
        "As you stand there, looking up the track, you hear a loud cawing from nearby, and see a huge murder of crows alight into the sky.",
        "Perhaps something disturbed them?",
        "You squint forward, down a pathway that now seems cloaked in mist.",
        "Suddenly, from out of the mist, emerges a figure on horseback. Covered in armour, the figure appears to be pulling something behind. As the mounted figure nears, you see that it is a rope, trailing behind the horse, attached to a boy, about 15, 16 years old, whose hands are bound by the rope. He is being pulled forward by the horse, and the armoured figure atop the horse seems completely oblivious.",
        "What do you want to do?"
      ],
      "nextSteps": [
        {
          "description": "Hide until the figure has passed? Go to entry SKULKAWAY",
          "target": "SKULKAWAY"
        },
        {
          "description": "Draw your weapon and challenge the mounted warrior? Go to entry CHALLENGE",
          "target": "CHALLENGE"
        },
        {
          "description": "Fire a ranged attack at the rider? Go to entry UNSEAT",
          "target": "UNSEAT"
        }
      ]
    },
    "PICKLOCK": {
      "text": [
        "You work with your thieves’ tools, trying to get the lock open and get to the riches within!",
        "You hear the tiniest, faintest ‘click’…."
      ],
      "nextSteps": [
        {
          "description": "Go to entry VAPOUR",
          "target": "VAPOUR"
        }
      ]
    },
    "PILEOBONES": {
      "text": [
        "Add 50 XP The skeleton warrior rattles to the ground in a pile of bones as you deal the killing blow, releasing this undead warrior from his halflife.",
        "You quickly search the skeleton, but it carries nothing apart from its shortsword and its battered shield. The shield is so worn it looks like it would crumble with the next blow it received."
      ],
      "nextSteps": [
        {
          "description": "You may take the shortsword if you wish. Return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "PINDROP": {
      "text": [
        "You are on alert, but only the sound of the river and the birds in the trees provide any noise and movement in this part of the wood."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "PITCOMBAT": {
      "text": [
        "You brandish your ranged attack and let loose on the cultist. Enraged, she screams maniacally and begins firing crossbow bolts at you!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry CULTISTCOMBAT",
          "target": "CULTISTCOMBAT"
        }
      ]
    },
    "PLAINSIGHT": {
      "text": [
        "You try to move quickly into cover, but as you do so, you hear a shout from the newly arrived band of three. And you’d recognize that lizardy croak anywhere: kobolds! They draw their weapons and rush down at the path at you. You have no choice but to stand and fight!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry KOBOLDBATTLE",
          "target": "KOBOLDBATTLE"
        }
      ]
    },
    "PRESERVED": {
      "text": [
        "As you are standing there, frozen in motion, the door to the little hut swings open, and out walk three robed figures.You groan internally. What in the name of the Gods have you gotten yourself into here? Some sort of magical effect has trapped you, and now these robed acolytes, fanatics, cultists, whatever they are, are walking towards you with big smiles on the faces.",
        "All three of them pick you up, and, one at your feet, one at your head and one in your middle, they cart you into the hut like a bundle of sticks and drop you on the floor!",
        "Then, unable to struggle, you watch as one of them produces a jar, full of some kind of ointment. You growl loudly, trying your best to voice your objection, but before you know it, a tiny amount is smeared on your arm.",
        "Within seconds you are unconscious."
      ],
      "nextSteps": [
        {
          "description": "Go to entry AWAKE",
          "target": "AWAKE"
        }
      ]
    },
    "PURSUED": {
      "text": [
        "Do you have a pact with the Blood Knight of Kiaransalee?"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry HASTYCARAVAN",
          "target": "HASTYCARAVAN"
        },
        {
          "description": "If not, go to entry UNEASYVICTORY",
          "target": "UNEASYVICTORY"
        }
      ]
    },
    "PUTRINGON": {
      "text": [
        "You slide the ring onto your finger. As you do so, you notice that it is engraved with fine etchings of animals: a bird, a bear, a deer and others, going around the band of the ring.",
        "What could this trinket be?"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "QUESTABANDON": {
      "text": [
        "You head north, guilt sitting in your gut like a poorly digested meal. Wherever Darek Brewmont is, you were his last hope and now that is no more.",
        "Suddenly there is a crack of thunder overhead, and a faint scream, followed by a hollow ragged laugh.",
        "You have failed in your quest! The Death Knight has found his squire!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "QUESTCONVO": {
      "text": [
        "You find yourself telling the old man all about your quest to find the mysterious knight and return Darek Brewmont to his grandparents.",
        "The old man nods solemnly. “The Death Knight,” he says quietly, and leans forward in his chair. “Local legend, they say, but ah….” “What?” you ask.",
        "He straightens up, looking you straight in the eye. “It’s no legend,” he says firmly. “I was a boy when they hung him, from the Red Tree in Weathercote Wood.” The old man goes on to tell you the story.",
        "The man who would become the Death Knight was once a good man, who came from a village in the far south. After his wife died from the pox, he left his village taking his only son with him as his squire, eager to teach him the ways of the righteous warrior.",
        "But a large band of brigands ambushed them on the road, shot the knight with a poison dart, and kidnapped his son. They left a note pinned in the ground with a dagger, demanding the knight plunder the treasury in Orlbar and deliver the gold to them. The Knight did so, almost dying in the process, but the town guard pursued him from town.",
        "When the kidnapperss saw the Knight coming with the authorities close behind, they killed the poor boy and fled.",
        "Upon finding his son’s body, the Knight swore vengeance on the bandits and vowed to pursue them unto the ends of the world.",
        "Unwilling to be taken by the town guard, the Knight drew his weapon to resist the arrest.",
        "The ensuing fight was bloody, but the knight slew all who came against him. When the fight was over, the Knight pursued the bandits deeper into the wood but lost their tracks in the undergrowth. His rage deepened until the bloodlust and madness possessed him entirely, driven insane at the thought of his son’s killers escaping unpunished. None would cross his path and live until the bandits had been brought to justice at the tip of his blade.",
        "Eventually more soldiers had to come from Loudwater to capture the insane knight.",
        "“When they finally did,” the old man concludes, “they hung him in Weathercote Wood, from a Red Tree.” The old man looks down. “But his unfulfilled quest to find his son’s killers brought him back. As undead.",
        "The Death Knight, they call him now. And since then, every few years or so, a boy will go missing… He’s looking for a squire, someone to help him on his quest.” You take a moment to digest all this information and drink from your tankard.",
        "After a while, you thank the old man for the company and the information and are on your way."
      ],
      "nextSteps": [
        {
          "description": "Go to entry KEEPGOING",
          "target": "KEEPGOING"
        }
      ]
    },
    "QUIETENTRY": {
      "text": [
        "You pause for a second, thinking you heard something. But no, it was just some bird flapping off out of cover. You watch it rise into the canopy and then look around at the three paths that lead off from here."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 1 and choose which adjoining map to move to.",
          "target": "TILEPAGE_1"
        }
      ]
    },
    "QUIETPATH": {
      "text": [
        "The wood has fallen silent. Ahead, you see a river crossing the track, which appears to turn to the east."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "QUIETSTEPS": {
      "text": [
        "Taking care not to disturb the headstones, you creep carefully through the cemetery, reading epitaphs and trying to get a feel for the place.",
        "Here lies Roghan, Cleric of Llorkh. Born a peasant, lived as a saint and hero, died a martyr.",
        "And another:",
        "Laid to rest eternally, Lady Rottridge of the Vale. A matriarch and benefactor, survived by Lord Rottridge and their son Petrus.",
        "It seems this little cemetery is filled with lords, ladies and adventurers of high distinction."
      ],
      "nextSteps": [
        {
          "description": "Have you already checked for traps? If so, go to entry DEADEND.",
          "target": "DEADEND"
        },
        {
          "description": "If not, go to entry DEATHBED",
          "target": "DEATHBED"
        }
      ]
    },
    "RANGEDSURPRISE": {
      "text": [
        "Roll damage and take note of it.",
        "The attack hits the undead knight full in the chest, making him cry out in anger.",
        "“Aaargh! Who dares enter my chamber?!” Quickly he regains composure and stands, lifting his weapon. And then his gaze lands on you. “Ah! There you are. So foolish, to enter here unaccompanied! And now, you shall pay for your foolishness!”"
      ],
      "nextSteps": [
        {
          "description": "Go to entry CRITICAL",
          "target": "CRITICAL"
        }
      ]
    },
    "READCANT": {
      "text": [
        "Looking over the strange markings on the map, your knowledge of Thieves’ Cant reveals a lot to you. There is a map of Loudwater, and the sewers beneath it… it appears these thieves, whose lair this is, have found (or at least think they have found) a hidden crypt full of riches. They have marked on the map where they think it is, and have indicated the way they believe should be taken to get to it.",
        "You never know when something like this might come in handy… your next adventure perhaps?",
        "Take the map if you wish, and add it to your inventory.",
        "There is also a small hand-drawn map. It is incomplete. There are two rooms, then a passage which ends abruptly. There is the word “crypt?” written with an arrow pointing at the incomplete space.",
        "You may take this map as well, if you wish.",
        "You will find it at the very end of the tilepage booklet. Do not peek at the other tilepages!"
      ],
      "imageId": 6,
      "nextSteps": [
        {
          "description": "If you wish to try and open the chest, go to entry OPENCHEST",
          "target": "OPENCHEST"
        },
        {
          "description": "If you want to search the pile of books and scrolls for clues, go to SEARCHCLUES",
          "target": "SEARCHCLUES"
        }
      ]
    },
    "REALLYGOOD": {
      "text": [
        "You check around the outside of the room, and in the middle too, turning over meditation cushions and searching through the small piles of books and scrolls that litter the floor.",
        "As you turn over one medium-sized pile, you see a small red-covered book tumble out.",
        "There is no title on the cover or the spine.",
        "Opening it, you see that it consists of handwritten entries. They detail some of the history and topography of the forest.",
        "Your attention is drawn immediately to mention of the Death Knight.",
        "“Hung he was, in the year 3010 EC, from the great Red Tree in the middle of the wood. After that, he became an abomination, a stain on mankind: one of the undead army.",
        "It is rumoured that a stake from the tree which he was hung from will finally put an end to his wretched half-life.” And another entry:",
        "“There is a cave, north of the Amaunator temple, that is said to hold the undead victims of the Death Knight. Under pain of the death, the Death Knight kidnapped the son of a great cleric and made him bless the river that runs path the cave’s mouth, turning it into holy water. Hence those poor undead victims of the Death Knight are forever trapped within that cave, from now to eternity. Perhaps someday they will be freed, though the gods only know how.” You muse over these words for some time, flicking absent-mindedly through the pages, when a small roll of parchment falls out. It appears to be a copied spell. Printed at the bottom are the words, “This scroll contains the spell Protection from Evil and Good.” Add a Spell Scroll, Protection from Evil and Good (1st level) to your inventory. The scroll also contains a description of the spell. Read the spell if you like (from the PHB) and get familiar with its effects."
      ],
      "nextSteps": [
        {
          "description": "If you would like to investigate the area around the altar, go to entry INSPECTALTAR",
          "target": "INSPECTALTAR"
        },
        {
          "description": "Or you can leave by going to entry LEAVECHAMBER",
          "target": "LEAVECHAMBER"
        }
      ]
    },
    "REDTREE": {
      "text": [
        "This tree seems very out of place here… you walk off the left side of the path and make your way towards it. It sits apart from all the other trees, and as you reach it you realize it is a lot bigger than it actually looks from the path.",
        "You stand before the red tree, looking up at its height. Apart from its colour, it doesn’t appear to be especially significant.",
        "What would you like to do now?",
        ""
      ],
      "nextSteps": [
        {
          "description": "Are you a paladin? If so, go to PALADINTREE",
          "target": "PALADINTREE"
        },
        {
          "description": "Climb the red tree? Go to entry CLIMBREDTREE",
          "target": "CLIMBREDTREE"
        },
        {
          "description": "To take some leaves from the tree, go to LEAVES",
          "target": "LEAVES"
        },
        {
          "description": "Take a brance from the tree? Go to entry TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "Head back to the path? Go to entry REJOINPATH",
          "target": "REJOINPATH"
        },
        {
          "description": "Do you know the spell Detect Magic? You could try casting it on the tree. Go to entry MAGICTREE",
          "target": "MAGICTREE"
        }
      ]
    },
    "REJOINPATH": {
      "text": [
        "Leaving the red tree, you walk back to the forest path, your mind fixed on your quest.",
        "Slowly, evening seems to be falling around you."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "REPLENISH": {
      "text": [
        "In response to the old man’s question, you say that you are looking for a lost horse, a prize stallion. He shrugs. You proceed to drink the ale with relish – it has been a hard ride – and eat the bowlful of stew, thinking that a midday meal was probably a very wise idea, as you do not know what time you will arrive at Weathercote Wood.",
        "You thank the old man for his hospitality and are on your way."
      ],
      "nextSteps": [
        {
          "description": "Go to entry KEEPGOING.",
          "target": "KEEPGOING"
        }
      ]
    },
    "RESIST": {
      "text": [
        "Add 1 inspiration point for your bravery.",
        "At your final words of defiance, the Blood Knight of Kiaransalee thrusts his blade forward."
      ],
      "nextSteps": [
        {
          "description": "Roll a d20+8. If by some miracle this is lower than your AC, go to RUN.",
          "target": "RUN"
        },
        {
          "description": "Otherwise go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "RESTINPIECES": {
      "text": [
        "The cemetery is eerily silent, and you can’t help but feel a little uneasy. There is a sense of foreboding. The tall trees which surround the cemetery stand like sentinels, watching your progress through this garden of the long dead."
      ],
      "nextSteps": [
        {
          "description": "Are you a barbarian? If so go to BEARINGS",
          "target": "BEARINGS"
        },
        {
          "description": "If not, proceed to entry SOFTLY to move through the rows of gravestones towards the tomb.",
          "target": "SOFTLY"
        }
      ]
    },
    "RETURN": {
      "text": [
        "The job is hard, much harder than you anticipated! It seems to be taking forever.",
        "As you work, you become aware of the sound of footsteps approaching, at a run. You can’t see it, but some creature is approaching the pit from the north!"
      ],
      "nextSteps": [
        {
          "description": "There is nowhere to hide! To keep digging your steps in a hurry, go to CLAPPERS",
          "target": "CLAPPERS"
        },
        {
          "description": "If you have a ranged attack, you can ready it by going to entry COMEATME",
          "target": "COMEATME"
        }
      ]
    },
    "RIDERHIT": {
      "text": [
        "Your ranged attack sears through the air at the rider, and when it hits there is a bloodcurdling scream which echoes throughout the forest… this is followed by laughter, so horrendous and so devoid of feeling it chills your very soul. You cringe into yourself, clapping your ears shut and closing your eyes, against your better judgment.",
        "When you open them again, the armoured rider and his prisoner are gone.",
        "What did you just see? Some horrific phantasm?"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "RIP": {
      "text": [
        "As you move cautiously forward, keeping a watch on all sides, something catches your eye off the left hand side of the path… Something smooth, manmade, partially hidden amongst the leaves of the forest floor.",
        "Quietly you make your way up to it, then drop to your knees and begin brushing with your hands, clearing the leaves away. It appears to be a gravestone.",
        "Your heart freezes as you uncover the name:",
        "Here lies Darek Brewmont.",
        "And underneath, the date – tomorrow’s date!",
        "Beneath that are the words, Laid to rest in Weathercote Wood Cemetery… there to rest for all eternity.",
        "A cold chill runs up your spine… what could this mean?? Is the boy already dead? But the name Weathercote Wood Cemetery… that’s interesting.",
        "You move back out onto the path and look north. A few moments later, it almost feels as if what you just saw was some sort of hallucination. Was that gravestone even real?",
        "Quickly you rush back to where the gravestone was, to check it again. It is bare from when you cleared the leaves away, but your name is gone… there are letters there, but they are faded, worn from weather and the decay of years…. You cannot read them.",
        "However, at the bottom of the stone, plain to see, is the symbol of a noose: the standard mark for the grave of a murderer.",
        "With a shudder you rejoin the path once more, turning this over in your mind, trying to discern its meaning…"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "RISE": {
      "text": [
        "There is a hideous groaning sound, and you watch in dismay as a figure rises from the grave, climbing out and turning its head towards you!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry ZOMBIEBATTLE",
          "target": "ZOMBIEBATTLE"
        }
      ]
    },
    "RIVERDWELLERS": {
      "text": [
        "Roll a d100."
      ],
      "nextSteps": [
        {
          "description": "If you score 0-33, go to entry SPATTER",
          "target": "SPATTER"
        },
        {
          "description": "if you score 34-66, go to entry MIKADUS",
          "target": "MIKADUS"
        },
        {
          "description": "If you score 67-100 go to entry PINDROP",
          "target": "PINDROP"
        }
      ]
    },
    "ROBUSTNESS": {
      "text": [
        "Plumeria flutters in close. “If you are defeated by the Death Knight,” she says quietly, out of earshot of the stranger on the other side of the river, “for I know that is who you seek, utter the word Pepperwood….",
        "You will be rescued from a fate worse than death itself. And now…” she flutters right up to your ear, and whispers, “Run! He is insane, get away from here!”"
      ],
      "nextSteps": [
        {
          "description": "Wasting no time, you kick out your heels and break into a sprint! Go to entry SCARPER",
          "target": "SCARPER"
        }
      ]
    },
    "ROCKPILE": {
      "text": [
        "You approach the rockpile and give it a bit of a poke. It seems fairly innocuous, but you don’t want anything leaping out at you in a hurry when your back is turned.",
        "You jab it warily with your weapon.",
        "Nope. A thoroughly ordinary pile of rocks.",
        "You see a small spider quickly scuttle across the rocks and disappear between the cracks, into hiding."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "ROOMTRAPS": {
      "text": [
        "Roll perception, DC 10"
      ],
      "nextSteps": [
        {
          "description": "If successful, go to NOROOMTRAPS",
          "target": "NOROOMTRAPS"
        },
        {
          "description": "If unsuccessful, go to PERCEPTIONLESS",
          "target": "PERCEPTIONLESS"
        }
      ]
    },
    "ROPEESCAPE": {
      "text": [
        "You fashion a lasso at the end of the rope and, eyeing up a low broken branch on a nearby tree, swing the rope, aiming for it.",
        "Make a dex check, DC 10."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to entry CLIMBOUT",
          "target": "CLIMBOUT"
        },
        {
          "description": "If you fail, go to entry WELLWHATNOW",
          "target": "WELLWHATNOW"
        }
      ]
    },
    "ROUNDONE": {
      "text": [
        "Your arm gets tangled and in the mesh of the net, and try as you might, you can’t get free!",
        "Go to entry GOBLINBATTLE, and give the goblins one free attack each, with advantage!",
        "After that, you may use your movement to free yourself from the net and attack.",
        "Conduct combat as normal from that point."
      ],
      "nextSteps": [
        {
          "description": "Go to entry GOBLINBATTLE, and give the goblins one free attack each, with advantage! After that, you may use your movement to free yourself from the net and attack. Conduct combat as normal from that point.",
          "target": "GOBLINBATTLE"
        }
      ]
    },
    "ROUNDTHETWIST": {
      "text": [
        "Make a d100 roll. Add 10 to it if you made a successful stealth check earlier."
      ],
      "nextSteps": [
        {
          "description": "If you score 1-20 go to entry WANDERERS",
          "target": "WANDERERS"
        },
        {
          "description": "If you score 21-40 go to entry RIP",
          "target": "RIP"
        },
        {
          "description": "If you score 41-60 go to entry HANKY",
          "target": "HANKY"
        },
        {
          "description": "If you score 61-80 go to entry SHRUB",
          "target": "SHRUB"
        },
        {
          "description": "If you score 81-100 go to entry GARB",
          "target": "GARB"
        }
      ]
    },
    "ROUNDTWO": {
      "text": [
        "“Damn you, interloper!” the Death Knight roars. “You will not rob me of my squire, as those wretches robbed me of my boy so long ago! AAAARRRGGGHHH!!!!” Quickly he moves forward to attack once more, his longsword arcing towards you, the undead warrior seemingly out of his mind with rage.",
        "The Death Knight is exercising one of his feats, which relies on rage to give him advantage on two attack rolls per day. Roll a d20+5 with advantage. If it hits, the longsword damage is 1d8+4."
      ],
      "nextSteps": [
        {
          "description": "Did you manage to throw Darek a blade? If so, go to entry BLADEBOY",
          "target": "BLADEBOY"
        },
        {
          "description": "If not, he is still bound. Go to YOURATTACK",
          "target": "YOURATTACK"
        }
      ]
    },
    "RUN": {
      "text": [
        "It is all a blur, but somehow you avoid the killing blow! Quickly you get to your feet, now able to move, and bolt for the door. You hear loud cursing in Infernal as you pull the door shut behind you, remembering that the Blood Knight said he couldn't walk in daylight. Yet.",
        "Your belongings are outside the door, but in the confusion, you left the magic sword behind!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "SAFEASHOUSES": {
      "text": [
        "You do a thorough visual search of the area, but find no traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "SCARPER": {
      "text": [
        "You don’t know why, but you have a strong instinct to get out of there quickly. Without giving any sort of warning, you break into a sudden run, putting as much distance between yourself and this strange man as possible!",
        "“Where are you going?!” the man calls after you, in a strangely hurt tone. “I’m not that repellant am I? Oh well, your loss, friend!",
        "Out of his mind, Plumeria!” Something tells you that you may have just escaped a very dangerous encounter."
      ],
      "nextSteps": [
        {
          "description": "Move to tilepage 6 immediately!",
          "target": "TILEPAGE_6"
        },
        {
          "description": "Move to tilepage 8 immediately!",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "SEARCHCAVE": {
      "text": [
        "You have a scavenge around. There were people here, lots of people. You find rings, semi-precious jewellery (to the value of 10gp, if you want to take it) and a few silver pieces here and there (17 in total). You also find, disturbingly, a child's wooden toy soldier… but nothing of any real value.",
        "Then you find a silver locket. It is tarnished and dented, but you pry it open. Inside is a cameo, dirtied and smeared with blood. Just legible inside the cover of the locket are engraved the following words:",
        "“To Fastus Brant, Captain of the Guard of the town of Orlbar, with from his father.” This sets you thinking… Gods, if the Captain of the Guard was trapped in here, and no-one came to rescue him… but why, and how?",
        "Surely the Captain of the Guard could have swum across that river and gone for help?",
        "They must have been stopped from leaving the cave somehow, or unable to for some other reason… You may take a short rest in this cave if you wish, regaining 1 hit die."
      ],
      "nextSteps": [
        {
          "description": "When you are ready, you may leave this cave by going to entry LEAVECAVERN",
          "target": "LEAVECAVERN"
        }
      ]
    },
    "SEARCHCLUES": {
      "text": [
        "You flick through the pages of the books scattered there, and in one book you find a very pleasant surprise… the inside has been hollowed out, and inside is a small pouch.",
        "You open it, and it contains gems. You are no jeweller, but you recognize three pieces of jade, two large pearls, and one transparent, deep blue gem… a blue spinel! You know this is worth quite a lot. Quickly you pocket the gems, glancing around nervously.",
        "The jade and pearls are worth 100gp each, and the blue spinel is worth 500gp!",
        "This will come in handy if you ever get out of this godforsaken wood! You pocket them quickly, your mind racing as you think of all the things you could buy with the money from these gems."
      ],
      "nextSteps": [
        {
          "description": "To attempt to open the chest, go to OPENCHEST",
          "target": "OPENCHEST"
        },
        {
          "description": "To leave and head back to the surface, go to entry LEAVECAVE",
          "target": "LEAVECAVE"
        }
      ]
    },
    "SEEMSNOT": {
      "text": [
        "You do a pretty thorough search for traps, but find nothing."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "SHIFTWEB": {
      "text": [
        "You conjure the spectral hand and direct it to start clearing the webs away. However, this task proves beyond the magical appendage;",
        "these webs are well made, and are not moving easily."
      ],
      "nextSteps": [
        {
          "description": "Have you made a successful stealth check? If so, go to entry MCSTEALTH.",
          "target": "MCSTEALTH"
        },
        {
          "description": "If you did not, go to entry OHNO.",
          "target": "OHNO"
        }
      ]
    },
    "SHOOTAFTER": {
      "text": [
        "Your target is about 100ft away. You lift your weapon, taking a quick assessment of the conditions, and fire."
      ],
      "nextSteps": [
        {
          "description": "Make a ranged attack at disadvantage (unless you have darkvision), AC 17, at whatever is fleeing from you. If your attack hits, go to entry GOODSHOT.",
          "target": "GOODSHOT"
        },
        {
          "description": "If you miss, go to MISS",
          "target": "MISS"
        }
      ]
    },
    "SHRUB": {
      "text": [
        "As you make your way cautiously forward, you spy something just off the side of the path. A bush, laden with berries! You walk up to it and inspect the fruit closer, crushing one between your fingers and smelling it.",
        "Your heart lifts – you know these berries well. They are known as Redstars and are renowned for their powers of sustenance.",
        "Quickly you take out a pouch and gather a good amount.",
        "Add Pouch of Redstar berries to your inventory. This small meal can be eaten at any time, and their healing properties will restore 5 hp to you, up to your hp max.",
        "Pleased with this find, you turn down the path and continue on your way."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "SHTUM": {
      "text": [
        "The goblin leader screws up his face. He turns to the other goblins. “Come on boys.",
        "We’ve got other business in the wood today!” The goblins totter off, shooting you disgusted looks for your miserliness as they go.",
        "You are left alone once more."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "SILVERTONGUE": {
      "text": [
        "You seem to have these goblins’ attention.",
        "“I am a great adventurer,” you continue to these simple tribal goblins. “I was sent here by a great sorceror to cleanse this wood of an evil scourge. You would be wise to let me continue on my way. “ You indicate your weapon. “This weapon is imbued with a great, great power, little friends. Resist me, and you will feel its wrath!” The goblins are now in the palm of your hand. They regard you with a mix of caution and wonder. (Add 150 XP for this subdual).",
        "“And now, a question,” you say. “Who of you has heard of the Death Knight?” The goblins look at each other, and begin muttering to one another. Their leader looks back at you, then says, “What do you have for us then, in return for what we know?” Do you have something you could give the goblin leader? A little gold perhaps?"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry GOBLINGIFT.",
          "target": "GOBLINGIFT"
        },
        {
          "description": "If you do not, or you don’t wish to give a gift, go to SHTUM",
          "target": "SHTUM"
        }
      ]
    },
    "SKELETONBATTLE": {
      "text": [
        "Place a token on the map within melee range of you to represent the skeleton. Roll initiative and do battle with this undead horror!",
        "| |\n|-|\n| ****SKELETON**** |\n| *Medium Undead, Lawful Evil* |",
        "| |\n|-|\n| **Armour Class** 13 |\n| **Hit Points** 13 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 10 (0) | 14 (+2) | 15 (+2) | 6 (-2) | 8 (-1) | 5 (-3) |",
        "| |\n|-|\n| **Senses** darkvision 60 ft., passive Perception 9 |\n| **Languages** understands all languages it knew in life but can't speak |\n| **Damage Vulnerabilities** bludgeoning |\n| **Damage Immunities** poison |\n| **Condition Immunities** exhaustion, poisoned |\n| **CR** 1/4 (50 XP) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Shortsword** Melee attack, +4 to hit, Reach 5ft. Hit 5 (1d6+2) piercing |"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to entry PILEOBONES",
          "target": "PILEOBONES"
        },
        {
          "description": "If you are defeated, go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "SKETCHY": {
      "text": [
        "You struggle to stay afloat, the weight of your pack dragging you down as the current pulls you even further downstream. You realize that if you don’t let go of your pack, you will drown. You are in real trouble now.",
        "Make one last athletics check, DC 10, with disadvantage if you are still doggedly holding onto your pack, normal if you finally decide to let it go."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to NINELIVES",
          "target": "NINELIVES"
        },
        {
          "description": "If you fail, go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "SKULKAWAY": {
      "text": [
        "Quickly you dash away behind the cover of some trees, then when you are well hidden, peek out just slightly to see… Nothing! The rider and his prisoner have disappeared!",
        "Wondering what you just saw – or didn’t see – you emerge from behind your tree and search the path.",
        "Nothing. Not a trace."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "SLAMMED": {
      "text": [
        "The thing that has a hold of you bites your shoulder viciously! You roar in pain, then jump to your feet quickly, pulling yourself out of this pit of decay before the creature can attack you again!"
      ],
      "nextSteps": [
        {
          "description": "Roll a 1d6+1 and take that much damage, then go to entry ZOMBIEBATTLE.",
          "target": "ZOMBIEBATTLE"
        }
      ]
    },
    "SLASHWEB": {
      "text": [
        "You produce your weapon and start hacking away at the webs, but they are not giving way easily! This is going to take some time."
      ],
      "nextSteps": [
        {
          "description": "Did you suceed in an earlier stealth check? If so, go to entry HEREWEGO.",
          "target": "HEREWEGO"
        },
        {
          "description": "If you did not make a stealth check, or if you failed one, go to entry OHNO.",
          "target": "OHNO"
        }
      ]
    },
    "SLEEPRUINED": {
      "text": [
        "Add 25 xp.",
        "There’s no getting back to sleep now! You got a decent rest though, and despite the bat feeding on your blood, you feel reasonably well refreshed.",
        "You make your way back out to the pathway and consider which path to take."
      ],
      "nextSteps": [
        {
          "description": "Return to the tilepage 8 entry and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "SLOPPY": {
      "text": [
        "You stay hidden, but hear nothing. Then you feel something – a blade on the back of your neck.",
        "“Look what we have here, friends!” says a mans voice. “Stand!” the voice orders you.",
        "You stand, and see before you a female and a young teenaged boy. They wear dark hooded cloaks. You cannot see whoever is holding the blade to your neck. They are behind you.",
        "It doesn’t take much to work out that you are hopelessly outnumbered. Trying to fight your way out of this would be futile."
      ],
      "nextSteps": [
        {
          "description": "Go to entry BLADEPOINT",
          "target": "BLADEPOINT"
        }
      ]
    },
    "SMOKEANDMIRRORS": {
      "text": [
        "Your illusion works well! The rogues step back, shouting in alarm, and you sieze the moment and run, bounding up rocks and out of the hole to the surface. Quickly you run into the trees and dive behind a large bush.",
        "There you wait, peering out occasionally.",
        "But your former captors do not give chase, and after half and hour or so, you return to the path, near to where you were before, taking care not to walk near the hole."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 8 and continue from the last direction you read",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "SNEAKUP": {
      "text": [
        "You are well concealed on the opposite side of the room from the Death Knight, who has not noticed your arrival!",
        "You may use this opportunity to make a ranged weapon or spell attack on the ghastly creature.",
        "Roll your attack, aiming for an AC of 15."
      ],
      "nextSteps": [
        {
          "description": "If your attack hits, go to entry RANGEDSURPRISE",
          "target": "RANGEDSURPRISE"
        },
        {
          "description": "If it misses, go to SWINGANDAMISS",
          "target": "SWINGANDAMISS"
        }
      ]
    },
    "SNEAKY": {
      "text": [
        "You wait till the kobolds pass and then emerge from hiding, sneaking up behind them. They have not noticed your presence!",
        "Which Kobold are you aiming for, one of the warriors, or the mage?"
      ],
      "nextSteps": [
        {
          "description": "Make an attack roll, aiming for a an AC of 12! Then roll damage (if damage is over 5, you will have killed one of them outright), and continue to entry KOBOLDBATTLE, deducting any hp from this surprise attack",
          "target": "KOBOLDBATTLE"
        }
      ]
    },
    "SOFTLY": {
      "text": [
        "If you have not yet made a stealth check, make one now, DC 14. If you have, follow the directions below depending on whether you were successful or not. If you are a barbarian, you may make a new one."
      ],
      "nextSteps": [
        {
          "description": "If you are successful go to entry QUIETSTEPS",
          "target": "QUIETSTEPS"
        },
        {
          "description": "If you are unsuccessful, go to WAKETHEDEAD",
          "target": "WAKETHEDEAD"
        }
      ]
    },
    "SOUTHPATH": {
      "text": [
        "Tucked back into the trees you see a large, elongated hole in the ground, like a gash, as if some huge beast has literally ripped the earth asunder.",
        "You edge forward and peer down… who knows what lurks down there! A part of you is screaming to back away, but your adventuring self always wants to know what’s around the next corner… holes in the ground are your stock in trade!"
      ],
      "nextSteps": [
        {
          "description": "To lower yourself down into this black chasm, go to entry FOOTHOLDS",
          "target": "FOOTHOLDS"
        },
        {
          "description": "To ignore this and continue north, go to EXTRACAUTIOUS",
          "target": "EXTRACAUTIOUS"
        }
      ]
    },
    "SPATTER": {
      "text": [
        "As you walk, something catches your eye.",
        "You crouch, and a cold feeling of dread comes over you as you recognize what has spattered the leaves.",
        "A blood trail.",
        "Could this be Darek Brewmont’s blood?",
        "Roll perception, DC 9. (If you are a ranger, roll with advantage)."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to TRACKER",
          "target": "TRACKER"
        },
        {
          "description": "If you are unsuccessful, go to DISCERN",
          "target": "DISCERN"
        }
      ]
    },
    "SPENT": {
      "text": [
        "Realizing that you are out of attacks, the cultist stops firing back also. She glares at you hatefully. “You will pay for that!” she seethes."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CAPTIVE",
          "target": "CAPTIVE"
        }
      ]
    },
    "SPIDERBATTLE": {
      "text": [
        "Place a token on the map to represent the Giant Wolf Spider. Roll initiative and prepare for battle!",
        "| |\n|-|\n| ****GIANT WOLF SPIDER**** |\n| *Medium Beast, Unaligned* |",
        "| |\n|-|\n| **Armour Class** 13 |\n| **Hit Points** 11 |\n| **Speed** 40 ft. / Climb 40 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 12 (+1) | 16 (+3) | 13 (+1) | 3 (-4) | 12 (+1) | 4 (-3) |",
        "| |\n|-|\n| **Senses** Blindsight 10 ft., Darkvision 60ft, Passive Perception 13 |\n| **Skills** Perception +3, Stealth +7 |\n| **CR** 1/4 (50 XP) |",
        "| |\n|-|\n| **ATTACKS** |\n| **Bite** +3 Weapon Attack, Reach 5ft, one creature. Hit 4 (1d6+1) piercing, and target must make a DC 11 con save, taking 2d6 poison dmg on a failed save and half on a successful save. |",
        "Roll 1d8 and place two tokens on the map that many squares from you. Roll initiative, then do battle!"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to entry DEADSPIDERS.",
          "target": "DEADSPIDERS"
        },
        {
          "description": "If you lose, go to entry OHWELL.",
          "target": "OHWELL"
        }
      ]
    },
    "SPINYARN": {
      "text": [
        "You quickly invent a story, saying you came to visit the Greypeaks, but got separated from your friends some miles back. You saw this cave and thought to take shelter here… “Have mercy, “ you say. “I was just looking for some shelter for the night.” The older thief, the leader, eyes you doubtfully.",
        "Make a persuasion roll, DC 15."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry GIFTOFGAB",
          "target": "GIFTOFGAB"
        },
        {
          "description": "If you are unsuccessful, go to BADLIAR",
          "target": "BADLIAR"
        }
      ]
    },
    "SPOILSOFADVENTURE": {
      "text": [
        "Congratulations, worthy adventurer!",
        "You have proved more than equal to the task. You completed the mission, rescuing Darek Brewmont, and gaining valuable experience along the way.",
        "Take 400 XP for completing this mission.",
        "This should be enough to progress to Level 3 and possibly a bit further. Level up your PC and prepare yourself for the next adventure!",
        "Keep this PC’s character sheet and advance them to Level 3, which is the level my next adventure will be set at. And keep an eye on dmsguild.com, under the heading “5e Solo Gamebook.” Thankyou for playing ‘The Death Knight’s Squire.’ Until next time!"
      ],
      "nextSteps": []
    },
    "STAKEDRIVE": {
      "text": [
        "Taking out the stake (if you only have the branch, you now whittle it to a point) you place it on the Death Knight’s chest, and smash it through his heart with all the force you can muster. On the third blow, the rickety corpse crumbles into ashes. There is the faintest of sighs, and then all falls still.",
        "Quickly you move over to Darek Brewmont and grab him by the arm.",
        "“Let’s go,” you command, and pull him to his feet. Both of you run from the chamber, leaving the crypt and the cemetery behind."
      ],
      "nextSteps": [
        {
          "description": "Go to entry DEATHLYPACT",
          "target": "DEATHLYPACT"
        }
      ]
    },
    "STASHBRANCH": {
      "text": [
        "Add the red tree branch to your inventory."
      ],
      "nextSteps": [
        {
          "description": "To climb the tree, go to CLIMBREDTREE",
          "target": "CLIMBREDTREE"
        },
        {
          "description": "To return to the path, go to REJOINPATH",
          "target": "REJOINPATH"
        },
        {
          "description": "To cast Detect Magic on the tree, go to MAGICTREE",
          "target": "MAGICTREE"
        }
      ]
    },
    "STATUEQUESTION": {
      "text": [
        "As you are asking the question, the man’s demeanour changes significantly. He sits up and looks around, distracted, then his eyes settle on you.",
        "“What?” he demands angrily. “What did you say? Who are you?” He asks, as if he has only just noticed your presence. The fairy flutters near and whispers something in his ear, but he swats it away.",
        "“You come here, and disturb my reverie?",
        "How dare you?!” He points at the statue.",
        "“You’ll suffer the same fate as him if you’re not careful, my friend!” You are taken aback, unable to tell if this man is a danger or merely insane… or perhaps both, which would be a very dangerous combination!",
        "What now?",
        "",
        ""
      ],
      "nextSteps": [
        {
          "description": "You could try to change the subject. “Those are lovely breeches you are wearing!” Go to entry COMPLIMENT",
          "target": "COMPLIMENT"
        },
        {
          "description": "You could turn your back and run for it. Go to entry SCARPER",
          "target": "SCARPER"
        },
        {
          "description": "You could apologize. “I meant nothing by it, friend. Just curious.” Go to entry APOLOGIZE",
          "target": "APOLOGIZE"
        }
      ]
    },
    "STILLSTUCK": {
      "text": [
        "Add 25 XP.",
        "The cultist falls. Quickly you finish digging your way out of the pit and search her body.",
        "She carries little in the way of equipment.",
        "You may take her weapons (hand crossbow, 18 bolts, scimitar).",
        "She does carry two items of interest: a map of the town of Orlbar, with various houses mapped in red. And these houses all have the word “here” written next to them. Around her neck is an amulet of some kind. It is made of dull steel, and is a simple flat coin with an image of a red gauntlet on it. You have no idea what either of these signifies.",
        "Add these items to your inventory if you wish, and continue on your way!"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "STONEDOORS": {
      "text": [
        "You walk up to the building, watching your periphery. It is a low, rounded building, fronted by large stone double doors, which look heavy but could probably be moved by a good pull or push. A metal ring sits halfway up the inner edge of the right hand door, surrounded by ornate designs. You look closer: it is a mosaic of sun designs."
      ],
      "nextSteps": [
        {
          "description": "You could make an history check here, if you wish. DC 10. If you are successful, go to entry STUDYDESIGN. Otherwise choose another option from this list",
          "target": "STUDYDESIGN"
        },
        {
          "description": "Check for traps? Go to entry DOORCHECK",
          "target": "DOORCHECK"
        },
        {
          "description": "Or, you could try pulling on the door. Go to entry OPENSTONEDOOR",
          "target": "OPENSTONEDOOR"
        },
        {
          "description": "You could leave and continue north. Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "STRANGEPRESENCE": {
      "text": [
        "As you watch, out of the side of your vision, without moving your head, you see it again – movement amongst the trees. Or rather… movement from the trees themselves.",
        "You whip around quickly, in time to see one of the trees move. Indeed, this tree has been following you for some time!",
        "“I can see you!” you call into the wood. “I know you’re there!” You hear a great, woody sigh, and a pair of great green eyes flicker open in the trunks of one of the trees. The treant gives up its ruse and walks openly towards you, standing before you on the side of the track.",
        "“You are very perceptive, little one!” the treant booms. “My name is Greybark, I watch all who pass in this wood.” From a brief look at this ent, you can tell he is quite young… probably only a few hundred years.",
        "“And what brings you this way, young traveller? Another one come to test your mettle against the feared Death Knight, eh?” at this, Greybark laughs, a warm, deep sound that is quite beautiful to hear."
      ],
      "nextSteps": [
        {
          "description": "Do you tell Greybark of your mission? If you decide to, go to entry GREYBARKCONVO",
          "target": "GREYBARKCONVO"
        },
        {
          "description": "If not, go to DENYEVERYTHING",
          "target": "DENYEVERYTHING"
        }
      ]
    },
    "STREAMCROSSED": {
      "text": [
        "The stream is deeper than it looks, and reaches up to your chest at its deepest part.",
        "You lift your pack above your head to keep your provisions dry, and push forward, several times slipping on mossy rocks underfoot. But finally it gets shallower, and soon you are through the worst. You dip your head down and drink deeply of the fresh, cold stream water. You feel reinvigorated from this short dip and quenching your thirst. (Add 1 hp).",
        "You plonk down on the opposite bank to catch your breath. You get your bearings as you look back to the shore you came from, and then slowly turn to look at the cave.",
        "Around the entrance are shards of broken pottery and other detritus. A wide cavemouth leads into a long tunnel with a floor of fine, dusty sand."
      ],
      "nextSteps": [
        {
          "description": "To go inside the cave, go to entry ENTERCAVE",
          "target": "ENTERCAVE"
        }
      ]
    },
    "STRICKENSKELETON": {
      "text": [
        "Seeing the holy symbol in your hand, the skeleton’s very life force – if it can be called that! – seems to drain out of it, and it cries out, as if mortally wounded. To your delight, it turns, dropping its shield and sword, and flees away from you down the path, limping as fast as it can go."
      ],
      "nextSteps": [
        {
          "description": "Do you want to make a ranged attack against the fleeing skeleton? If so, roll a d20. If the result is 13 or higher, go to entry KNOCKPINS. If it is lower, the skeleton flees out of range, disappearing into the trees.",
          "target": "KNOCKPINS"
        },
        {
          "description": "In any case, after you have finished attacking (or not attacking), Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "STRIKE": {
      "text": [
        "You have killed the fleeing skeleton warrior outright!",
        "Add 50 XP.",
        "Walking up to the destroyed pile of bones, you do a quick search but find nothing of value. Its shortsword and shield are of very poor quality and certainly inferior to what you already carry. You may take the shortsword if you wish."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 6 and continue from the last direction you read.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "STUDYDESIGN": {
      "text": [
        "A close study of the sun designs reveals the obvious: They are images of Amaunator, the Sun god, the most worshipped god in the realm. This is probably a temple of some sort."
      ],
      "nextSteps": [
        {
          "description": "Do you want to check for traps? Go to entry DOORCHECK",
          "target": "DOORCHECK"
        },
        {
          "description": "Or, you could try pushing on the door. Go to entry OPENSTONEDOOR",
          "target": "OPENSTONEDOOR"
        },
        {
          "description": "You could leave and continue north. Return to tilepage 3 and continue from the last direction you read",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "SURPRISECRAWLY": {
      "text": [
        "Roll 1d6+1, then 2d6.",
        "You feel something biting into your neck, and a burning sensation in your skin.",
        "Something poisonous has bitten you!",
        "Take the 1d6+1 piercing damage, then make a constitution saving throw, DC 11. The 2d6 is poison damage. If you fail, take the full damage. If you succeed, take half.",
        "Quickly you bat the thing off and turn, drawing your weapon. Two GIANT WOLF SPIDERS are before you, moving their pincers menacingly. Still smarting from the surprise attack, you move in, intent on destroying the horrible creatures."
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPIDERBATTLE",
          "target": "SPIDERBATTLE"
        }
      ]
    },
    "SURRENDER": {
      "text": [
        "Reluctantly, you toss your weapon aside.",
        "“Good,” the man says, moving forward and kicking it away, then motions with his head towards the passage that leads to the rogues’ lair. “That way,” he commands."
      ],
      "nextSteps": [
        {
          "description": "Go to entry BLADEPOINT",
          "target": "BLADEPOINT"
        }
      ]
    },
    "SWEPTDOWN": {
      "text": [
        "You plough your way into the deepest part of the river, and things are going well… then it starts to get deep… soon your feet are slipping on the mossy rocks underfoot, and then suddenly you lose balance and start floating downstream! The river quickly gets much deeper and you are forced to try and swim for it. You go underwater a couple of times, and so does your backpack."
      ],
      "nextSteps": [
        {
          "description": "To swim to the far shore go to PADDLEHARD",
          "target": "PADDLEHARD"
        },
        {
          "description": "To swim back the way you came, go to ENOUGHOFTHIS!",
          "target": "ENOUGHOFTHIS"
        }
      ]
    },
    "SWINGANDAMISS": {
      "text": [
        "“What!? What was that?! Who dares enter here?” Your ranged attack hits the back wall, and the undead knight stands, searching for you.",
        "He quickly finds you, even though you are hidden in the shadows.",
        "“Ah! You cannot hide from me, brave fool!",
        "And you shall not rob me of my squire, sir!",
        "Now, prepare to die!” The Death Knight stalks forward, lifting his weapon above his head."
      ],
      "nextSteps": [
        {
          "description": "Go to entry CRITICAL",
          "target": "CRITICAL"
        }
      ]
    },
    "SWINGER": {
      "text": [
        "Two large scything blades come swinging out towards you. You try to dodge them, but too late! One of the blades catches you just as you are moving out of the way.",
        "Roll 1d6+1 and take that much slashing damage."
      ],
      "nextSteps": [
        {
          "description": "If you are killed, go to entry OHWELL.",
          "target": "OHWELL"
        },
        {
          "description": "If you are not killed, you pick yourself up, tend to your wounds and then carefully proceed along the passage towards the circular room which you can now see ahead. Go to entry CIRCULARROOM",
          "target": "CIRCULARROOM"
        }
      ]
    },
    "TAKEBRANCH": {
      "text": [
        "Looking at the lower branches of the tree, you select one and reach up, carefully snapping it off while taking care not to damage any other part of the tree.",
        "What are you doing with this branch?"
      ],
      "nextSteps": [
        {
          "description": "To place it in your backpack, go to STASHBRANCH",
          "target": "STASHBRANCH"
        },
        {
          "description": "To use it as a walking stick, go to WALKINGSTICK",
          "target": "WALKINGSTICK"
        },
        {
          "description": "To whittle it to a point, go to WHITTLEBRANCH",
          "target": "WHITTLEBRANCH"
        }
      ]
    },
    "TESTWEB": {
      "text": [
        "You pick up a stick and toss it into the web, then draw your weapon, awaiting what might come…"
      ],
      "nextSteps": [
        {
          "description": "Go to entry HEREWEGO",
          "target": "HEREWEGO"
        }
      ]
    },
    "THUNDERWEB": {
      "text": [
        "Deduct a spell slot.",
        "Moving your hands and speaking the incantation, you feel force gather around you and then explode outwards, blasting the webs and sending a ripple through the trees.",
        "Roll a d20+1."
      ],
      "nextSteps": [
        {
          "description": "If the result is higher than your spell save DC, go to entry LUCKYCRITTERS. If it is lower, read on below.",
          "target": "LUCKYCRITTERS"
        },
        {
          "description": "As soon as your spell detonates, your hear a screeching sound. Something was waiting, just off the path, and was caught in the blast! Roll 2d8. If the result is higher than 11, go to entry OVERKILL. If not, read on below.",
          "target": "OVERKILL"
        },
        {
          "description": "From the undergrowth, the wounded creatures appear: Two GIANT WOLF SPIDERS! They are angry at your intrusion, and hungry for your blood! Go to entry SPIDERBATTLE, deducting your 2d8 roll from both spiders’ hp before you commence combat.",
          "target": "SPIDERBATTLE"
        }
      ]
    },
    "TOAST": {
      "text": [
        "Add 50XP You dispatch the centipede and wipe your weapon clean. There could be more of those things around… you keep a wary eye open as you move about the chamber."
      ],
      "nextSteps": [
        {
          "description": "Do you want to search the area around the altar? Go to entry INSPECTALTAR",
          "target": "INSPECTALTAR"
        },
        {
          "description": "Or, you could leave the chamber. Go to entry LEAVECHAMBER",
          "target": "LEAVECHAMBER"
        }
      ]
    },
    "TOLLBEDAMNED": {
      "text": [
        "Take one inspiration point for your bravery!",
        "You laugh openly in the Kobold’s face.",
        "“Here’s your toll!” you snarl as you move forward, drawing your weapon."
      ],
      "nextSteps": [
        {
          "description": "Go to entry KOBOLDBATTLE",
          "target": "KOBOLDBATTLE"
        }
      ]
    },
    "TOOSLOW": {
      "text": [
        "Despite your efforts, you are soon met with the business end of a crossbow.",
        "“Don’t move!” cries a female voice from above.",
        "You look up to see a hooded figure. A mouth and nose are visible from beneath the darkness of the cowl. The figure begins to chuckle softly. She has her crossbow trained right on you. “Hehe. Master will be very pleased with you! You’ll make a fine minion.” You feel your anger beginning to rise from the pit of your stomach. How can you get out of this one?"
      ],
      "nextSteps": [
        {
          "description": "Do you have any ranged weapon or spell attacks (Thunderwave, Sacred Flame etc) that you could conduct combat with, from within the pit? If so go to entry PITCOMBAT",
          "target": "PITCOMBAT"
        },
        {
          "description": "Do you know the spells Command or Charm Person? If so go to entry WHATACHARMER",
          "target": "WHATACHARMER"
        },
        {
          "description": "If you have neither of these options, the only thing you can really do is wait to see what fate befalls you! Go to entry CAPTIVE",
          "target": "CAPTIVE"
        }
      ]
    },
    "TOSSER": {
      "text": [
        "“Darek!” you yell at the boy, trying to shock him out of his frightened state. You could do with all the help you can get right now.",
        "As a free action, you may toss a dagger or shortsword to Darek if you have one to spare, so he can cut himself free of his bonds.",
        "You wield your weapon and prepare your next attack!",
        "",
        "| |\n|-|\n| ****DEATH KNIGHT**** |\n| *Medium Undead, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 15 |\n| **Hit Points** 28 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 15 (+2) | 11 (+0) | 13 (+1) | 12 (+1) | 10 (+0) | 5 (-3) |",
        "| |\n|-|\n| **Saving Throws** Strength +2 |\n| **Damage Immunities** Poison |\n| **Condition Immunities** Poisoned, charmed, unconscious, frightened |\n| **Senses** Darkvision 60ft, Passive Perception 8 |\n| **Languages** Common |\n| **CR** 1 (200XP) |\n| **Turn Immunity** The Death Knight cannot be turned by any Turn Undead feat or spell. |"
      ],
      "nextSteps": [
        {
          "description": "Roll your next attack, referring to the stat block below. Take the -1 penalty to your attack roll if you are under the influence of the Fear Aura. Make sure you are keeping track of hitpoints (on both sides!) Then go to entry ROUNDTWO",
          "target": "ROUNDTWO"
        }
      ]
    },
    "TOTHELIGHT": {
      "text": [
        "Slowly and deliberately, you edge forward, rounding a corner.",
        "It appears you are in an old mine of some sort. There is mining equipment here and there, but it is worn, rusted, unused for a long time. However, ahead, fire burns in a brazier, suggesting this place has been recently inhabited. The brazier throws warmth and light throughout this small cavern.",
        "You search further around the walls and find a small recess which contains a number of interesting items – very interesting items.",
        "There is a chest, securely locked, a small stack of scrolls and books, and a nondescript pile of all sorts of items: silver goblets, scattered, semi-valuable jewellery, paintings leant against the wall… A quick leaf through the scrolls, searching for more information, reveals maps of the area, scrawled over with all sorts of markings, many of which you don’t understand.",
        "Then it all clicks into place – you have stumbled on a thieves’ den!",
        "You feel a sudden mix of elation at finding all this loot, and apprehension at being caught in here."
      ],
      "nextSteps": [
        {
          "description": "Are you a rogue? If so, go to entry READCANT",
          "target": "READCANT"
        },
        {
          "description": "You could try opening the chest? Go to entry OPENCHEST",
          "target": "OPENCHEST"
        },
        {
          "description": "You could continue going through the books and scrolls seeing if you can find anything useful related to your quest Go entry SEARCHCLUES",
          "target": "SEARCHCLUES"
        },
        {
          "description": "Or you could quickly leave and return to the surface. Go to LEAVECAVE",
          "target": "LEAVECAVE"
        }
      ]
    },
    "TRACKER": {
      "text": [
        "You examine the blood spatters carefully.",
        "Obviously whoever was shedding it was heading east.",
        "You look up. It looks as though there is a junction some distance ahead where another path branches off this east-west byway, heading north. Perhaps the bleeding party headed that way?",
        "You stand up and search the ground further, and see more marks… these flat, almost triangular, and quite large.",
        "A knight’s booted foot.",
        "The scene pieces itself together in your mind.",
        "The Death Knight, a large, strong man, carrying the boy Darek Brewmont over his shoulder, the lad bleeding where the Knight hit him hard, across the face perhaps, to silence his cries for help?",
        "You grit your teeth. You’ve seen a lot in your time, but the strong victimising the weak is something that never sits well.",
        "Resolute, you set your mind back to your quest, adjust your pack on your back and forge ahead."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 7 and continue from the last direction you read.",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "TRAPCAVE": {
      "text": [
        "You search the walls and floor of the tunnel but find no traps. You do however see many scratches on the wall, as if someone was trying to literally dig their way through the rock with their bare hands."
      ],
      "nextSteps": [
        {
          "description": "You continue down the tunnel. Go to entry MOVEWITHIN",
          "target": "MOVEWITHIN"
        }
      ]
    },
    "TRAPCHECK": {
      "text": [
        "You move forward, alert as you investigate the surroundings."
      ],
      "nextSteps": [
        {
          "description": "To check for traps in the surrounding forest go to entry WOODCHECK",
          "target": "WOODCHECK"
        },
        {
          "description": "To approach and check for traps on the double stone doors, go to entry DOORCHECK",
          "target": "DOORCHECK"
        }
      ]
    },
    "TRAPFAIL": {
      "text": [
        "You search around but are unable to locate anything resembling a trap."
      ],
      "nextSteps": [
        {
          "description": "Return to Tilepage 1, continuing from the last entry you read.",
          "target": "TILEPAGE_1"
        }
      ]
    },
    "TRAPLESS": {
      "text": [
        "Apart from the webs, you see no evidence of any traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 2 and continue from the last direction you read.",
          "target": "TILEPAGE_2"
        }
      ]
    },
    "TRAPRIVER": {
      "text": [
        "Make a perception check to search for traps in this area, DC 12."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry HIDDENDANGER",
          "target": "HIDDENDANGER"
        },
        {
          "description": "If you are unsuccessful, go to LOOKSFINE",
          "target": "LOOKSFINE"
        }
      ]
    },
    "TRAPSNOPE": {
      "text": [
        "You have a good look around, but cannot see anything that looks trap-like around here.",
        "Still cautious, you move forward."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 3 and continue on from the last entry you read.",
          "target": "TILEPAGE_3"
        }
      ]
    },
    "TRAPSWHAT": {
      "text": [
        "You investigate this area of the wood but find no traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "TREECLIMB": {
      "text": [
        "You scurry up into the tree’s branches – you were born for this sort of thing and are soon at the top, looking out over the canopy of Weathercote Wood. There is not a lot to see:",
        "the canopy appears almost unbroken.",
        "However, to the north and slightly west, you can see some rock outcroppings protruding above the green swathe.",
        "You return to the ground and are standing at the base of the red tree once more."
      ],
      "nextSteps": [
        {
          "description": "To cast Detect Magic on the tree, go to MAGICTREE",
          "target": "MAGICTREE"
        },
        {
          "description": "To take a branch from the tree, go to TAKEBRANCH",
          "target": "TAKEBRANCH"
        },
        {
          "description": "To go back to the path, go to REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "TRIGGERED": {
      "text": [
        "You hear a click, and then a “ffffft!” sound.",
        "Two darts come flying towards you from cleverly concealed holes."
      ],
      "nextSteps": [
        {
          "description": "Roll a d20+8. If the result is higher than your AC, go to DARTHIT.",
          "target": "DARTHIT"
        },
        {
          "description": "If lower, go to DARTMISS",
          "target": "DARTMISS"
        }
      ]
    },
    "TUNNELTRAPS": {
      "text": [
        "To check for traps, make a perception roll, DC 10."
      ],
      "nextSteps": [
        {
          "description": "If successful, go to entry TRAPCAVE",
          "target": "TRAPCAVE"
        },
        {
          "description": "If unsuccessful, go BEYONDRIVER",
          "target": "BEYONDRIVER"
        }
      ]
    },
    "TUNNELVISION": {
      "text": [
        "You hear that same sound again, much clearer than before; someone is in pain, groaning and pleading. It sounds like… like a boy.",
        "You breathe silently, steadying your nerves and move slowly forward, your mind surprisingly clear."
      ],
      "nextSteps": [
        {
          "description": "Go to Sub-map 5 and follow the directions there",
          "target": "SUBMAP_5"
        }
      ]
    },
    "TURNSKELETON": {
      "text": [
        "You present your holy symbol, holding it up before the undead’s face.",
        "Roll a d20, subtracting 1."
      ],
      "nextSteps": [
        {
          "description": "If the result is 8 or below go to NOTTURNED",
          "target": "NOTTURNED"
        },
        {
          "description": "If the result is 9 or above, go to entry STRICKENSKELETON",
          "target": "STRICKENSKELETON"
        }
      ]
    },
    "ULTIMATEGLORY": {
      "text": [
        "You leave Weathercote Wood as quickly as possible, dragging an exhausted Darek Brewmont behind you. Once you are out of the wood, wide grassland opens up before you. Accepting the gift of a horse from a farmer, you make your way back to Orlbar, arriving late that night.",
        "When you deliver Darek Brewkmont to his parents, they are beyond grateful. Lord Brewmont invites you to stay at his expense at his house in Loudwater, which you politely decline. However, you do accept 2000 gp which he withdraws from the Orlbar bank for you the following day. It seems this Lord is pretty well cashed up. You leave Orlbar a few days later, bound for Loudwater, your mind turning over all the things that you will spend your money on!"
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPOILSOFADVENTURE",
          "target": "SPOILSOFADVENTURE"
        }
      ]
    },
    "UNCONVINCING": {
      "text": [
        "Despite your attempts to defuse the situation, the goblins are having none of it.",
        "“Shut your trap, human!” the leader, Grum, says. “Your words won’t save you here!",
        "Boys, attack!!!!”"
      ],
      "nextSteps": [
        {
          "description": "Go to entry GOBLINBATTLE",
          "target": "GOBLINBATTLE"
        }
      ]
    },
    "UNEASYVICTORY": {
      "text": [
        "Turning north at the junction that led you to the cemetery, you continue for a short way, and finally Weathercote ends, and the landscape changes to wide, open grasslands.",
        "The sky is overcast, threatening rain, and pulling poor Darek behind you, you proceed at a run to a nearby farmhouse where you steal a horse. The farmer comes out of his house as you gallop away, shouting and waving his fists at your back.",
        "You reach Orlbar that evening, and deliver Darek to his grateful grandparents.",
        "“You shall be rewarded, brave champion,” Lord Brewmont promises, his eyes misting over. “On the morrow, I shall go to the Orlbar bank, and –“ You cut Lord Brewmont off, telling him he needs to leave town immediately. He trusts your advice, and that evening they depart.",
        "Not having time to go to the Orlbar bank, Lady Brewmont gifts you with a necklace, telling you, “Sell this, and don’t take anything less than 700 gp for it!” Word spreads through Orlbar, and a ceremony of honour is organized for you, to be held on the morrow. But you slip away, wondering whether you should return to the wood to finally drive a stake through the Death Knight's heart, or simply make for Loudwater. After all, facing the Death Knight again..."
      ],
      "nextSteps": [
        {
          "description": "Go to entry SPOILSOFADVENTURE",
          "target": "SPOILSOFADVENTURE"
        }
      ]
    },
    "UNFROZEN": {
      "text": [
        "You have enough presence of mind to know this is a spell of some sort, an enchantment, and through sheer force of will, you extract yourself from it. You topple to the ground, breathing hard, as you are released from the spell.",
        "Hearing a noise, you look over at the little hut, in time to see the door fly open. Two robed figures come running out. Their eyes are bright, crazed, as if they have just come out of some sort of religious trance.",
        "“The spell has failed!” one of them yells.",
        "“Quickly, grab him! Grab him now!” You jump to your feet and draw your weapon. What do these fanatics want with you?"
      ],
      "nextSteps": [
        {
          "description": "Go to entry FANATICSBATTLE",
          "target": "FANATICSBATTLE"
        }
      ]
    },
    "UNSEAT": {
      "text": [
        "Quickly you produce your ranged attack and fire directly at the armoured rider."
      ],
      "nextSteps": [
        {
          "description": "Roll a d20 and turn to RIDERHIT",
          "target": "RIDERHIT"
        }
      ]
    },
    "USETOOLS": {
      "text": [
        "Carefully you take out your thieves’ tools and begin working… But you stop suddenly when you hear the faintest ‘click’ sound."
      ],
      "nextSteps": [
        {
          "description": "Go to entry VAPOUR",
          "target": "VAPOUR"
        }
      ]
    },
    "VALIANTDEFEAT": {
      "text": [
        "The Death Knight moves in for the killing blow, and he drops you… but stops just short of finishing you completely."
      ],
      "nextSteps": [
        {
          "description": "Do you have a word that you were given, spoken to you by a fairy? If so, go to the entry of that name now!",
          "target": "PEPPERWOOD"
        },
        {
          "description": "If not, go to entry WORTHYOPPONENT",
          "target": "WORTHYOPPONENT"
        }
      ]
    },
    "VAPOUR": {
      "text": [
        "Without warning, a blast of purple vapour hits you square in the face, jetting forth from a small hole in the front of the chest.",
        "Make a constitution save, DC 18."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to HOLDBREATH",
          "target": "HOLDBREATH"
        },
        {
          "description": "If you are unsuccessful go to GASSED",
          "target": "GASSED"
        }
      ]
    },
    "VICTORIOUS": {
      "text": [
        "Add 200 XP The Death Knight is slain. You stand there over the undead corpse, twice dead now, catching your breath and taking in all that has happened in the last two days.",
        "“Do you have the stake?” Darek Brewmont cries. “From the Red Tree, do you have a stake? You must pierce him through the heart, quickly!”"
      ],
      "nextSteps": [
        {
          "description": "Do you possess a Red Tree Stake or branch? If so, go to entry STAKEDRIVE",
          "target": "STAKEDRIVE"
        },
        {
          "description": "If not, go to entry NOREDSTAKE",
          "target": "NOREDSTAKE"
        }
      ]
    },
    "WAKETHEDEAD": {
      "text": [
        "You hear something from under your feet… as if someone is moving under there, turning in their grave! And a scream, faint… you get the distinct feeling your presence has been noticed!",
        "While on this tilepage or anything within it, you have lost the ability to make surprise attacks.",
        "Roll a d100."
      ],
      "nextSteps": [
        {
          "description": "If you score 0-50, go to entry DEADEND",
          "target": "DEADEND"
        },
        {
          "description": "If you score 51-100, go to DEATHBED",
          "target": "DEATHBED"
        }
      ]
    },
    "WALKINGSTICK": {
      "text": [
        "You strip the smaller branches and leaves from the branch, and heft it. Yes, this will make an excellent walking stick, and possibly and improvised staff at a glance!",
        "Add “red tree staff” to your inventory. It can deal 1d4 damage."
      ],
      "nextSteps": [
        {
          "description": "To climb the tree, go to entry CLIMBREDTREE",
          "target": "CLIMBREDTREE"
        },
        {
          "description": "To take some leaves, go to LEAVES",
          "target": "LEAVES"
        },
        {
          "description": "To cast Detect Magic on the tree, go to MAGICTREE",
          "target": "MAGICTREE"
        },
        {
          "description": "To return to the forest path, go to entry REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "WANDERERS": {
      "text": [
        "As you move through the wood, stealthily as you can, you see figures come into view on the path ahead. They don’t appear to be human!"
      ],
      "nextSteps": [
        {
          "description": "Do you hide? If so go to entry YELLOWBELLY",
          "target": "YELLOWBELLY"
        },
        {
          "description": "Or do you stand and face them, whoever they are? Go to entry BRINGIT",
          "target": "BRINGIT"
        }
      ]
    },
    "WELCOME": {
      "text": [
        "Suddenly the Death Knight’s bearing changes. He looks over the head of poor Darek and stares at you.",
        "“SO!” he booms, his rasping growl filling the chamber. “You’ve finally arrived. The great hero, come to rob me of my squire, eh?!” There is a brief pause, and then the creature breaks into a hollow, grating laugh which reverberates off the stone walls. Finally he recomposes himself and stands, uttering, “Prepare to die, fool!”"
      ],
      "nextSteps": [
        {
          "description": "Go to entry CRITICAL",
          "target": "CRITICAL"
        }
      ]
    },
    "WELLDAMN": {
      "text": [
        "Try as you might, you cannot detect anything that looks like a trap around this door. Shrugging, you reach for the door handle, turn it, and gently push the door inwards."
      ],
      "nextSteps": [
        {
          "description": "Go to CABINENTRY",
          "target": "CABINENTRY"
        }
      ]
    },
    "WELLHIDDEN": {
      "text": [
        "You crouch down behind some foliage, pulling your hood up, and wait for the little party to pass. As they do, you can see out through the leaves who they are: Kobolds!",
        "The lizardy humanoids walk past, taking care to avoid a patch of sunlight that has filtered through from the canopy – rare in this dark wood."
      ],
      "nextSteps": [
        {
          "description": "Do you wait until they are completely gone, and then leave your cover? Go to BETTERSAFE",
          "target": "BETTERSAFE"
        },
        {
          "description": "Or, do you try to sneak up behind them and make a surprise attack? Go to SNEAKY",
          "target": "SNEAKY"
        }
      ]
    },
    "WELLWHATNOW": {
      "text": [
        "Try as you might, you simply cannot get the lasso to catch on the broken branch stump!",
        "Cursing your poor aim, you put your rope away and look for another way out."
      ],
      "nextSteps": [
        {
          "description": "Do you know the Jump spell? If so, go to JUMPESCAPE",
          "target": "JUMPESCAPE"
        },
        {
          "description": "Do you have any sort of flying feat? If so, go to FLYESCAPE",
          "target": "FLYESCAPE"
        },
        {
          "description": "Or, you can try and dig steps up the side of the pit. Go to DIGESCAPE",
          "target": "DIGESCAPE"
        }
      ]
    },
    "WHATACHARMER": {
      "text": [
        "Deduct 1 spell slot.",
        "You make the invocation, and soon the cultist is under your control!",
        "“I think you should come join me in this pit!” you suggest.",
        "The cultist casts down her crossbow. “What a fabulous idea,” she exclaims, and hurls herself headfirst into the pit trap.",
        "Still seething with rage at her early mockery of you, you catch her while she’s down and mercilessly finish her off. You search her body and find a hand crossbow, 18 bolts and a scimitar. She also has a amulet depicting a red gauntlet, and a map of the town of Orlbar. Some of the houses are marked, “Here”.",
        "Add 25 XP.",
        "Then, quickly before any more of her kind turn up, you finish digging your way out of the pit and continue your quest. (continued across…)"
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "WHATASNOB": {
      "text": [
        "You turn and walk on, your mind on your quest, your instincts perhaps telling you that this mysterious stranger could be more trouble than he is worth.",
        "“What?!” you hear from behind you. “You dear to turn your back on the great Shagaxa?! You will pay for that!” You hear a sharp sound from behind you, as of stone cracking, and turn just in time to see a ray of sickly grey energy flying towards you!",
        "Make a dexterity save, DC 12 (he’s quite far away)."
      ],
      "nextSteps": [
        {
          "description": "If you fail, go to entry GREYBEAM",
          "target": "GREYBEAM"
        },
        {
          "description": "If you succeed, go to entry LUCKYDODGE",
          "target": "LUCKYDODGE"
        }
      ]
    },
    "WHATAWAITS": {
      "text": [
        "Did you make an earlier successful check for traps?"
      ],
      "nextSteps": [
        {
          "description": "If so, go to entry CHANCEROLL",
          "target": "CHANCEROLL"
        },
        {
          "description": "If not, go to entry HOLDTHATTHOUGHT",
          "target": "HOLDTHATTHOUGHT"
        }
      ]
    },
    "WHATSMYFATE": {
      "text": [
        "Eventually the little man seems to grow bored, and departs.",
        "After an hour or so, you feel something on your arm, but you can’t turn your head to look.",
        "“Foolish soul!” you hear a tiny voice whisper in your ear. “You should not have provoked him. He is a basilisk, don’t you know! A shapechanger. who has transformed himself into a halfling sorcerer. And insane as well, so you were very foolish to talk to him like that!” “Now listen carefully,” the voice continues.",
        "“I can release you from this, but you must promise me something. I know where you are going, and what your quest is. Human minds are like open books to me. So if and when you are in the presence of the Death Knight…” and then the voice comes extra close, and you hear a whisper right in your ear, “You must utter the word Pepperwood.",
        "Do you understand? Do not forget that word, all right? Pepperwood. Do you agree?” You have little choice, it would seem, but how do you let this creature, whatever it is, know that you agree? Yes, yes, you think fervently, trying to form words with your stony vocal cords.",
        "“Excellent,” the little voice says, and then you remember what it said. Human minds.",
        "Open book.",
        "You feel a tinkling sensation, and warmth begins to spread through your body.",
        "Gradually the feeling returns to your chest, your head, your arms, legs, fingers, toes… you can move again!",
        "You turn, and there is the little fairy Plumeria, hovering in mid-air.",
        "“Don’t forget – Pepperwood. You promised.” And she flutters away.",
        "You shake your head in wonder and disbelief, and adjust your pack on your back. Can this wood get any stranger?",
        "As you walk, you begin to feel a presence, all around you. Or rather, your conscious mind notices this presence: it’s not the first time you have felt that something is slightly out of place in this wood… Again, as when you first entered, you truly feel that something, or someone, is watching your presence through these woods.",
        "You stop, make your breathing very quiet, and uneasily look to the side of the path. Did you just see movement there? You could have sworn something moved, amongst the trees. Your heart begins hammering in your chest… Make a perception roll, DC 15. Do it with advantage if you have some sort of connection to the forest, for example if you are a ranger with favoured terrain of forest, or if you are a forest elf. Also do it with advantage if you have proficiency with nature."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 9 and continue from the last entry you read WHATSTHIS",
          "target": "WHATSTHIS"
        }
      ]
    },
    "WHATSTHIS": {
      "text": [
        "As you walk, you begin to feel a presence, all around you. Or rather, your conscious mind notices this presence: it’s not the first time you have felt that something is slightly out of place in this wood… Again, as when you first entered, you truly feel that something, or someone, is watching your presence through these woods.",
        "You stop, make your breathing very quiet, and uneasily look to the side of the path. Did you just see movement there? You could have sworn something moved, amongst the trees. Your heart begins hammering in your chest… Make a perception roll, DC 15. Do it with advantage if you have some sort of connection to the forest, for example if you are a ranger with favoured terrain of forest, or if you are a forest elf. Also do it with advantage if you have proficiency with nature."
      ],
      "nextSteps": [
        {
          "description": "If you are successful, go to entry STRANGEPRESENCE",
          "target": "STRANGEPRESENCE"
        },
        {
          "description": "If you are not successful, go to entry ASYOUWERE",
          "target": "ASYOUWERE"
        }
      ]
    },
    "WHATTRAPS": {
      "text": [
        "You investigate this area of the wood but find no traps."
      ],
      "nextSteps": [
        {
          "description": "Return to tilepage 5 and continue from the last direction you read",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "WHEW": {
      "text": [
        "With one final huge effort, you make it to the far shore, panting and coughing up water.",
        "Deduct 1 hp. Your provisions are also ruined, so delete these from your inventory.",
        "You take a long moment to get your breath back, then finally survey the cave mouth before you. It is littered with broken pottery and other detritus"
      ],
      "nextSteps": [
        {
          "description": "To enter the cave, go to ENTERCAVE",
          "target": "ENTERCAVE"
        }
      ]
    },
    "WHITTLEBRANCH": {
      "text": [
        "You spend a few moments shortening the branch and whittling the tip to a sharp point.",
        "This could definitely come in useful, for who knows what?",
        "Add Red Tree Stake to your inventory."
      ],
      "nextSteps": [
        {
          "description": "To climb the tree, go to entry CLIMBREDTREE",
          "target": "CLIMBREDTREE"
        },
        {
          "description": "To take some leaves, go to LEAVES",
          "target": "LEAVES"
        },
        {
          "description": "To cast Detect Magic on the tree, go to MAGICTREE",
          "target": "MAGICTREE"
        },
        {
          "description": "To return to the forest path, go to entry REJOINPATH",
          "target": "REJOINPATH"
        }
      ]
    },
    "WHOKNOWSWHAT": {
      "text": [
        "Did you make an earlier trap check on this tilepage? If you did, continue reading below.",
        "If you did not, go to entry OOPS As you progress deeper into Weathercote Wood, you realize that you are very tired.",
        "Time has a mind of its own in this forest… it is evening already! How have the hours passed so quickly? The idea of rest enters your mind, although you know that the area you are in is less than ideal for making camp.",
        "You may be disturbed by some wandering creature… there’s no way of telling!",
        "You may attempt to rest here and recover hd.",
        "If you choose to do so, roll survival , DC 11."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to NICECAMP",
          "target": "NICECAMP"
        },
        {
          "description": "If you fail, go to NIGHTCRITTERS",
          "target": "NIGHTCRITTERS"
        },
        {
          "description": "If you would rather continue without rest, return to tilepage 4 and continue from the last direction you read",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "WISETOYOU": {
      "text": [
        "Something tells you to look up, and there, up the brances of a tree overhanging the path, are three goblins, poised, with a net! They look like a tribe of some sort and wear bones on different parts of their bodies.",
        "“Damn it, Grum, he’s seen us!” one of them yells.",
        "The biggest one, probably the leader, yells, “Never mind, he’s a trespasser! GET HIM!” They drop from the branch and land with a roll, then charge you with their weapons."
      ],
      "nextSteps": [
        {
          "description": "To draw your weapon and do battle, go to entry GOBLINBATTLE",
          "target": "GOBLINBATTLE"
        },
        {
          "description": "To try and placate these little thugs with your powers of persuasion, go to entry DEFUSE",
          "target": "DEFUSE"
        }
      ]
    },
    "WOODCHECK": {
      "text": [
        "Roll perception, DC 12."
      ],
      "nextSteps": [
        {
          "description": "If you succeed, go to entry FORESTTRAPS",
          "target": "FORESTTRAPS"
        },
        {
          "description": "If you fail, go to entry TRAPSNOPE",
          "target": "TRAPSNOPE"
        }
      ]
    },
    "WORTHYOPPONENT": {
      "text": [
        "Lying there, bleeding out, you watch through a haze as the Death Knight walks over to Darek Brewmont and loosens the boy’s bonds.",
        "“Go now. GO!” he commands.",
        "Without waiting, the boy stands and runs from the chamber, casting you a stricken looks as he passes your prone form.",
        "The Death Knight walks over to you, and kneels by your side.",
        "“A worthy opponent you have proven, traveller. So worthy in fact, that I think your destiny has been made clear.” He reaches forward and touches your forehead, closing his eyes. A cold thrill passes through you, and you feel life leaving your body, but a new kind of energy entering. Your senses change, and your heart stops beating. Your are dead, but somehow… not dead.",
        "The Death Knight draws a deep, ragged breath, and proclaims, “Now arise, brave warrior, and begin your new life as my SQUIRE!” YOU have become the Death Knight’s Squire! A fate worse than death? That remains to be seen."
      ],
      "nextSteps": [
        {
          "description": "Go to entry OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "YELLOWBELLY": {
      "text": [
        "You quickly duck into the woods, hopefully before whoever is coming can see you!",
        "Make a stealth check, DC 16."
      ],
      "nextSteps": [
        {
          "description": "If you fail, go to PLAINSIGHT",
          "target": "PLAINSIGHT"
        },
        {
          "description": "If you succeed, go to entry WELLHIDDEN",
          "target": "WELLHIDDEN"
        }
      ]
    },
    "YOURATTACK": {
      "text": [
        "If you are under the influence of the Death Knight’s Fear Aura, you may attempt a wisdom save, DC 13. If you make it, the -1 penalty to attack rolls is gone.",
        "Brandishing your weapon, you move forward once more, roaring at the top of your lungs to rally yourself, and Darek Brewmont (who may attack when it is his turn, if he has a blade).",
        "| |\n|-|\n| ****DEATH KNIGHT**** |\n| *Medium Undead, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 15 |\n| **Hit Points** 28 |\n| **Speed** 30 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 15 (+2) | 11 (+0) | 13 (+1) | 12 (+1) | 10 (+0) | 5 (-3) |",
        "| |\n|-|\n| **Saving Throws** Strength +2 |\n| **Damage Immunities** Poison |\n| **Condition Immunities** Poisoned, charmed, unconscious, frightened |\n| **Senses** Darkvision 60ft, Passive Perception 8 |\n| **Languages** Common |\n| **CR** 1 (200XP) |\n| **Turn Immunity** The Death Knight cannot be turned by any Turn Undead feat or spell. |"
      ],
      "nextSteps": [
        {
          "description": "Use the Death Knight’s stats below and make another attack! Then go to entry DUKEITOUT",
          "target": "DUKEITOUT"
        },
        {
          "description": "If you have won, go to VICTORIOUS",
          "target": "VICTORIOUS"
        },
        {
          "description": "If you have been defeated, go to entry VALIANTDEAFEAT",
          "target": "VALIANTDEAFEAT"
        }
      ]
    },
    "ZEALOTSNOMORE": {
      "text": [
        "Add 75 XP You search the bodies of the dead cultists.",
        "Apart from their scimitars (you may take one if you wish), they carry little in the way of material possessions. However, one odd thing they all carry is an amulet: a simple iron chain ending in a disc, an embossed steel disc that depicts a red gauntlet. You have no idea what this means. Some obscure cult no doubt.",
        "You do note, however, that they all came from that little hut. What bizarre scenario will you find within there?"
      ],
      "nextSteps": [
        {
          "description": "To investigate, go to CULTISTSHUT",
          "target": "CULTISTSHUT"
        },
        {
          "description": "To ignore this hut and continue on your way, Return to tilepage 6 and continue from the last direction you read",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "ZOMBIEBATTLE": {
      "text": [
        "Place a token on the map within melee range to represent the zombie. Roll initiative and do battle with the rotting undead!",
        "| |\n|-|\n| ****ZOMBIE**** |\n| *Medium Undead, Neutral Evil* |",
        "| |\n|-|\n| **Armour Class** 8 |\n| **Hit Points** 22 |\n| **Speed** 20 ft. |",
        "| STR | DEX | CON | INT | WIS | CHA |\n|:-:|:-:|:-:|:-:|:-:|:-:|\n| 13 (+1) | 6 (-2) | 16 (+3) | 3 (-4) | 6 (-2) | 5 (-3) |",
        "| |\n|-|\n| **Saving Throws** Wis +0 |\n| **Damage Immunities** poison |\n| **Condition Immunities** poisoned |\n| **Senses** darkvision 60 ft., passive Perception 8 |\n| **Languages** understands the languages it knew in life but can't speak |\n| **CR** 1/4 (50 XP) |\n| **Undead Fortitude** If damage reduces the zombie to 0 hit points, it must make a constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a successful constitution save, the zombie drops to 1 hit point instead. |",
        "| |\n|-|\n| **ATTACKS** |\n| **Slam** Melee attack, +3 to hit, Reach 5ft. Hit 4 (1d6+1) bludgeoning |"
      ],
      "nextSteps": [
        {
          "description": "If you are victorious, go to CREEPERSLAIN",
          "target": "CREEPERSLAIN"
        },
        {
          "description": "If you are defeated, go to OHWELL",
          "target": "OHWELL"
        }
      ]
    },
    "SUBMAP_1": {
      "text": [
        "You enter the cave, moving slowly within. Your steps raise little puffs of fine dust as you proceed deeper within the rock.",
        "Ahead, you see that the tunnel bends to the right.",
        "",
        "Moving with stealth? Make a stealth check, DC 10. Take note of success or failure."
      ],
      "imageId": 7,
      "nextSteps": [
        {
          "description": "To check for traps, go to entry TUNNELTRAPS.",
          "target": "TUNNELTRAPS"
        },
        {
          "description": "If you want to simply continue down the tunnel without checking for traps, go to entry MOVEWITHIN.",
          "target": "MOVEWITHIN"
        }
      ]
    },
    "SUBMAP_2": {
      "text": [
        "This large cavern contains little except a large pile of bones and partially decomposed corpses in its centre. You cover your mouth and nose – the smell is horrendous!",
        "Shaking your head, you move closer to the pile and see the skeletons of adults, children… what happened to these poor souls? Why did they die here? Were they not able to leave?",
        "Then you notice, scrawled on the wall of the cavern in some unknown substance – you shudder to think what – a single word: “NORTH.”",
        "Your stealth check from earlier covers this cavern too.",
        "You do a quick visual assessment and determine it is unlikely there are traps here."
      ],
      "imageId": 8,
      "nextSteps": [
        {
          "description": "When you are ready, go to entry DEEPCAVE.",
          "target": "DEEPCAVE"
        }
      ]
    },
    "SUBMAP_3": {
      "text": [
        "Creeping warily forward, you peer down the passageway and see a chamber at the end. A brief inspection here reveals no traps, and you move forward, listening, watching your periphery, all your senses heightened.",
        "You enter a large chamber, and on either side are marble plinths, four in all, each topped with a coffin. The air is stale and musty.",
        "There is an exit on the far side of the room, and you can see that it continues for a short way and then bends to the right.",
        "",
        "Moving with stealth? Make a stealth check, DC 10. Take note of success or failure."
      ],
      "imageId": 9,
      "nextSteps": [
        {
          "description": "When you reach the room with the coffins, you may check for traps by going to entry ROOMTRAPS.",
          "target": "ROOMTRAPS"
        },
        {
          "description": "Or, if not checking for traps, you can simply proceed to entry MAUSOLEUM.",
          "target": "MAUSOLEUM"
        }
      ]
    },
    "SUBMAP_4": {
      "text": [
        "You edge forward, and fancy you hear something, from far, far down the passage ahead. Your heart leaps at the sound, and you freeze. But all falls silent again.",
        "Slowly you move forward again, gripping the handle of your weapon.",
        "",
        "Moving with stealth? Make a stealth check, DC 13. Take note of success or failure."
      ],
      "imageId": 10,
      "nextSteps": [
        {
          "description": "If you are checking for traps, go to entry BENDTRAPS.",
          "target": "BENDTRAPS"
        },
        {
          "description": "To simply continue around the bend in the passage and onwards to whatever lies ahead, go to entry DOGLEG.",
          "target": "DOGLEG"
        }
      ]
    },
    "SUBMAP_5": {
      "text": [
        "As you approach the left bend ahead, the noises become clearer… a low groaning, and underneath that, a growling sound.",
        "Then another sound – the chink of metal, the sound of armoured feet across stone…",
        "Then a ragged, broken voice, speaking a two-word command: “Kneel, squire!”"
      ],
      "imageId": 11,
      "nextSteps": [
        {
          "description": "Moving with stealth? Make a stealth check, DC 10, since you have heard noises. If you have the hand-drawn map, make this check with advantage. Take note of success or failure and go to entry BENDINGPASSAGE.",
          "target": "BENDINGPASSAGE"
        }
      ]
    },
    "TILEPAGE_1": {
      "text": [
        "You move ahead, deeper into the wood, and it almost seems as if the trees themselves are watching your progress.",
        "Indeed, as you go on, you really do get the feeling you are being watched.",
        "",
        "You can move with stealth. Make a stealth check, DC 12. If you succeed, you may add 10 points to any d100 chance rolls you make while on this Tilepage.",
        "",
        "You can check for traps (unless returning here): Roll perception, DC 12.",
        "",
        "When you have finished all encounters you may move to the edge of the map and onto an adjoining tilepage (either 2, 3 or 5)."
      ],
      "imageId": 12,
      "nextSteps": [
        {
          "description": "If successful when checking for traps, go to CHECKSUCCESS.",
          "target": "CHECKSUCCESS"
        },
        {
          "description": "If you fail when checking for traps, go to TRAPFAIL.",
          "target": "TRAPFAIL"
        },
        {
          "description": "When you are ready, move your token through the map in the direction you desire. When you reach a square adjoining the green translucent dot, go to entry QUIETENTRY.",
          "target": "QUIETENTRY"
        },
        {
          "description": "Move onto tilepage 2.",
          "target": "TILEPAGE_2"
        },
        {
          "description": "Move onto tilepage 3.",
          "target": "TILEPAGE_3"
        },
        {
          "description": "Move onto tilepage 5.",
          "target": "TILEPAGE_5"
        }
      ]
    },
    "TILEPAGE_2": {
      "text": [
        "Advance your token forward one square towards the webs. Or, return to tilepage 1 and take a different route.",
        "The track bends to the southeast, and you follow it, all light from the forest entrance now disappearing. It is like night still hides in here. Only the faintest light seeps in through the canopy.",
        "Ahead, you see something white and whispy spanning the path. COBWEBS! Slowly, you edge forward…",
        "",
        "Moving with stealth? Make a stealth check, DC 15. Take note of success or failure.",
        "",
        "You can only search thoroughly for traps once the webs are removed. Then roll perception, DC 15.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 6 or 1)."
      ],
      "imageId": 13,
      "nextSteps": [
        {
          "description": "Go forward.",
          "target": "FORWARD"
        },
        {
          "description": "You succeeded when checking for traps.",
          "target": "OBVIOUS"
        },
        {
          "description": "You failed when checking for traps.",
          "target": "TRAPLESS"
        },
        {
          "description": "Move onto tilepage 1.",
          "target": "TILEPAGE_1"
        },
        {
          "description": "Move onto tilepage 6.",
          "target": "TILEPAGE_6"
        }
      ]
    },
    "TILEPAGE_3": {
      "text": [
        "The track leads deeper into the wood, and the light fades. Ancient trees line each side of the path, and you can’t help but think this wood is an excellent place to hide out.",
        "Then, ahead you see something strange… it appears to be a low stone building, at the corner of the track where it turns north. Tucked in amongst the trees, it is made solidly, of grey stone, fronted by two large stone double doors.",
        "You move warily forward…",
        "",
        "Moving with stealth? Make a stealth check, DC 13. Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 6 or 1)."
      ],
      "imageId": 14,
      "nextSteps": [
        {
          "description": "Checking for traps?: Go to entry TRAPCHECK.",
          "target": "TRAPCHECK"
        },
        {
          "description": "To investigate the low stone building, go to entry STONEDOORS.",
          "target": "STONEDOORS"
        },
        {
          "description": "If you would rather keep going, then your character continues around the bend and north. When you reach a square adjoining the green marker, go to entry ROUNDTHETWIST.",
          "target": "ROUNDTHETWIST"
        },
        {
          "description": "Move onto tilepage 1.",
          "target": "TILEPAGE_1"
        },
        {
          "description": "Move onto tilepage 4.",
          "target": "TILEPAGE_4"
        }
      ]
    },
    "TILEPAGE_4": {
      "text": [
        "The woods become ever deeper, and the sound goes out of the air. There are no birds here, or something has frightened them into silence…",
        "It is hard even to tell what time of day it is this deep in the forest.",
        "Across the path, you see a trail of bootprints leading from the right to the left. They lead back into the forest where it becomes very dense, however there is no sign of the foliage being disturbed even though the bootprints look relatively fresh: they could have been made as recently as last night!",
        "On the track ahead, you can see that this path eventually bends to the right, and on the corner there appears to be an entrance to a cave…",
        "",
        "Moving with stealth? Make a stealth check, DC 14. Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 7 or 3)."
      ],
      "imageId": 15,
      "nextSteps": [
        {
          "description": "Checking for traps?: Go to entry DEEPWOODS.",
          "target": "DEEPWOODS"
        },
        {
          "description": "To investigate the mossy log to the left, go to entry MOSSYLOG.",
          "target": "MOSSYLOG"
        },
        {
          "description": "When you reach a square adjoining the green marker, go to entry WHOKNOWSWHAT.",
          "target": "WHOKNOWSWHAT"
        },
        {
          "description": "Move onto tilepage 3.",
          "target": "TILEPAGE_3"
        },
        {
          "description": "Move onto tilepage 7.",
          "target": "TILEPAGE_7"
        }
      ]
    },
    "TILEPAGE_5": {
      "text": [
        "Silence descends around you as you forge ever deeper down this wooded passage…",
        "Soon the junction behind you is out of sight as the passageway bends slightly east.",
        "A pile of rocks on your left sits at the base of a great oak.",
        "As you examine this pile of rocks, through the thick undergrowth you see one particular tree that looks slightly out of place. The leaves of this tree are blood red, and even the bark is a deep rich burgundy colour.",
        "Ahead it appears the passage bends back towards the north.",
        "",
        "Moving with stealth? Make a stealth check, DC 12. Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 1 or 8)."
      ],
      "imageId": 16,
      "nextSteps": [
        {
          "description": "Checking for traps?: Go to entry BENDYBIT.",
          "target": "BENDYBIT"
        },
        {
          "description": "To check out the rockpile to the left, go to entry ROCKPILE.",
          "target": "ROCKPILE"
        },
        {
          "description": "To investigate the out-of-place looking red tree, go to entry REDTREE.",
          "target": "REDTREE"
        },
        {
          "description": "When you reach a tile adjoining the green dot near the top of the map, go to entry NASTYTURN.",
          "target": "NASTYTURN"
        },
        {
          "description": "Move onto tilepage 1.",
          "target": "TILEPAGE_1"
        },
        {
          "description": "Move onto tilepage 8.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "TILEPAGE_6": {
      "text": [
        "You round the corner and see a house on the western side of the path. It appears to be inhabited: smoke is drifting from the chimney.",
        "Who knows who waits inside here? A kindly old wizard hermit, or a warlock quietly plotting the domination of the world?",
        "Come to think of it, this could even be where the death knight is hiding!",
        "The cabin doesn’t look like much though… it could just be a commoner family. And they might have food…",
        "Your belly begins to rumble at the thought of a hot meal.",
        "",
        "Moving with stealth? Make a stealth check, DC 12. Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 2 or 9)."
      ],
      "imageId": 17,
      "nextSteps": [
        {
          "description": "Checking for traps? Go to entry MORETRAPS.",
          "target": "MORETRAPS"
        },
        {
          "description": "To approach and investigate the house, go to entry LITTLEHUT.",
          "target": "LITTLEHUT"
        },
        {
          "description": "When you reach a tile adjoining the green dot near the top of the map, go to entry WHATAWAITS?.",
          "target": "WHATAWAITS?"
        },
        {
          "description": "Move onto tilepage 2.",
          "target": "TILEPAGE_2"
        },
        {
          "description": "Move onto tilepage 9.",
          "target": "TILEPAGE_9"
        }
      ]
    },
    "TILEPAGE_7": {
      "text": [
        "A river threads through this part of Weathercote Wood. Ahead, you see the path bends sharply to the right, and on the north side of the path sits a rock outcropping, on the front of which is the entrance to a cave. Peering inside from across the river, you see that it extends a long way.",
        "Exploring this cave is going to require you to cross a stream also… a busy torrent, about fifteen feet wide, rushes from east to west, filling the forest with the sound of rushing water.",
        "",
        "Moving with stealth? Make a stealth check, DC 10 (the river noise covers the sound of your approach). Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 4 or 8)."
      ],
      "imageId": 18,
      "nextSteps": [
        {
          "description": "Checking for traps? Go to entry TRAPRIVER.",
          "target": "TRAPRIVER"
        },
        {
          "description": "To approach and investigate the stream, in order to get to the cave, go to entry CAVESTREAM.",
          "target": "CAVESTREAM"
        },
        {
          "description": "When you reach a tile adjoining the green dot near the centre of the map, go to entry RIVERDWELLERS.",
          "target": "RIVERDWELLERS"
        },
        {
          "description": "Move onto tilepage 4.",
          "target": "TILEPAGE_4"
        },
        {
          "description": "Move onto tilepage 8.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "TILEPAGE_8": {
      "text": [
        "It feels as if you have been in this wood for an age. Now the dim light of evening has fallen and darkness creeps back under the boughs of Weathercote Wood.",
        "You have reached a four-way junction. You scout around, and just off the path find several places that would be suitable for making camp.",
        "Your bones ache after a long day, and your stomach rumbles.",
        "",
        "Moving with stealth? Make a stealth check, DC 10. Take note of success or failure.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 11, 9, 7 or 5)."
      ],
      "imageId": 19,
      "nextSteps": [
        {
          "description": "Checking for traps? Go to entry JUNCTIONTRAPS.",
          "target": "JUNCTIONTRAPS"
        },
        {
          "description": "If you would like to investigate the hole in the ground to the south, go to entry SOUTHPATH.",
          "target": "SOUTHPATH"
        },
        {
          "description": "When you reach a tile adjoining the green dot, go to entry LIKELYCAMP.",
          "target": "LIKELYCAMP"
        },
        {
          "description": "Move onto tilepage 5.",
          "target": "TILEPAGE_5"
        },
        {
          "description": "Move onto tilepage 7.",
          "target": "TILEPAGE_7"
        },
        {
          "description": "Move onto tilepage 9.",
          "target": "TILEPAGE_9"
        },
        {
          "description": "Move onto tilepage 11.",
          "target": "TILEPAGE_11"
        }
      ]
    },
    "TILEPAGE_9": {
      "text": [
        "You approach a bend in the path, and can hear the gurgle of a stream… This stream appears to be moving quite slowly, at least in this part of the wood.",
        "On the other side of the river, you see a strange-looking character, a human, reclining back on some moss and seemingly talking to himself… is he mad? From what you’ve experienced of Weathercote Wood so far, you wouldn’t be surprised.",
        "And then he sees you and calls out!",
        "“It’s fine, friend, nothing will harm you here. Come, talk to me! It is rare that I have company.”",
        "",
        "Moving with stealth? Make a stealth check, DC 10. Take note of success or failure.",
        "",
        "Your instincts tell you it is unlikely there are traps here. So far, all traps in this wood have been in lonely stretches.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto an adjoining tilepage (either 6 or 8)."
      ],
      "imageId": 20,
      "nextSteps": [
        {
          "description": "Talk to the stranger? Go to CONVERSATION.",
          "target": "CONVERSATION"
        },
        {
          "description": "To ignore him and continue on, go to entry WHATASNOB.",
          "target": "WHATASNOB"
        },
        {
          "description": "Move onto tilepage 6.",
          "target": "TILEPAGE_6"
        },
        {
          "description": "Move onto tilepage 8.",
          "target": "TILEPAGE_8"
        }
      ]
    },
    "TILEPAGE_10": {
      "text": [
        "Slowly and with weapon at the ready, you make your way into the slightly disheveled looking cemetery… gravestones are crooked in places, but here and there are freshly placed flowers.",
        "At the far end of the cemetery, you see a large crypt, like a dome that has been cut in half. Ornate metal gates stand before a stone door. There is a plaque on the outside, but it is too far away to read.",
        "With foreboding in the pit of your stomach, you edge forward into this haven of perished souls…",
        "",
        "Moving with stealth? Make a stealth check, DC 14. Take note of success or failure.",
        "",
        "Checking for traps? Roll perception, DC 15.",
        "",
        "When you have finished all encounters, you may move to the edge of the map and onto adjoining tilepage 11."
      ],
      "imageId": 21,
      "nextSteps": [
        {
          "description": "If successful in checking for traps, go to entry GRAVETRAPS.",
          "target": "GRAVETRAPS"
        },
        {
          "description": "If unsuccessful in checking for traps, go to RESTINPIECES.",
          "target": "RESTINPIECES"
        },
        {
          "description": "Move onto tilepage 11.",
          "target": "TILEPAGE_11"
        }
      ]
    },
    "TILEPAGE_11": {
      "text": [
        "You move north from the junction and reach a shallow stream, which you easily cross.",
        "On the other side of the stream, you see a left-branching path. On the corner of this path is a sign, the words worn away by the weather.",
        "It reads 'Cemetery' and an arrow points down the left path.",
        "Ahead, you see that the wood opens out, and a field is beyond! Your heart lifts a little, but then you remember poor Darek Brewmont.",
        "",
        "Moving with stealth? Make a stealth check, DC 10. Take note of success or failure.",
        "",
        "Your adventuring experience tells you it is unlikely there are traps here."
      ],
      "imageId": 22,
      "nextSteps": [
        {
          "description": "To go west (left), go to tilepage 10 and follow the instructions there.",
          "target": "TILEPAGE_10"
        },
        {
          "description": "To go north, go to tilepage 12.",
          "target": "TILEPAGE_12"
        }
      ]
    },
    "TILEPAGE_12": {
      "text": [
        "It looks like you have reached the end of Clodfell Wood – ahead, the forest ends and open grassland stretches out, with rolling hills in the distance.",
        "But you have still not found Darek Brewmont! He must be in some part of this wood you have not explored yet.",
        "",
        "It seems there is little point in stealth here… this is the wood’s end."
      ],
      "imageId": 23,
      "nextSteps": [
        {
          "description": "To go back, retreat to tilepage 11 and follow the instructions there.",
          "target": "TILEPAGE_11"
        }
      ]
    }
  }
}